{
  "chunk-7d7df6eff66b60d34a24a2d9980029d2": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Home\n- Explore\n- Products\n    - Popular Popular\n        - View all products (200+)\n        - Azure Virtual Machines\n        - Azure Virtual Desktop\n        - Azure DevOps\n        - Azure SQL\n        - Azure AI Services\n        - Azure AI Foundry\n        - Azure AI Content Safety\n        - Azure Kubernetes Service (AKS)\n        - Azure Arc​\n        - Azure Local\n- AI + machine learning AI + machine learning\n    - Azure Machine Learning\n    - Azure AI Services\n    - Azure AI Model Catalog\n    - Azure OpenAI Service\n    - Azure AI Language\n    - Azure AI Foundry\n    - Azure AI Vision\n    - Azure AI Search\n    - Azure Databricks\n    - Microsoft Copilot in Azure PREVIEW\n- Compute Compute\n\n- Azure Virtual Machines\n- Azure Kubernetes Service (AKS)\n- Linux virtual machines in Azure\n- SQL Server on Azure Virtual Machines\n- Windows Server\n- Azure Functions\n- Azure Virtual Machine Scale Sets\n- Azure Spot Virtual Machines\n- Azure Container Apps\n- Azure Compute Fleet\n- Containers Containers\n\n- Azure Kubernetes Service (AKS)\n- Azure App Service\n- Azure Functions\n- Azure Container Instances​\n- Azure Spring Apps\n- Azure Red Hat OpenShift\n- Azure Kubernetes Fleet Manager PREVIEW\n- Azure Container Apps\n- Azure Container Registry\n- App Configuration\n- Hybrid + multicloud Hybrid + multicloud\n\n- Azure DevOps\n- Azure SQL\n- Azure Arc​\n- Azure Local\n- Azure Database for PostgreSQL\n- Microsoft Defender for Cloud\n- Azure IoT Edge\n- Azure Monitor\n- Microsoft Sentinel\n- Analytics Analytics\n\n- Azure Synapse Analytics\n- Azure Databricks\n- Microsoft Purview\n- Azure Data Factory\n- Azure Machine Learning\n- Microsoft Fabric\n- HDInsight\n- Azure Data Explorer\n- Azure Data Lake Storage\n- Azure Operator Insights\n- Solutions\n\n- Featured Featured\n    - View all solutions (40+)\n    - Azure AI\n    - Migrate to innovate in the era of AI\n    - Build and modernize intelligent apps\n    - Data analytics for AI\n    - Azure AI Infrastructure\n    - Adaptive cloud\n    - Azure network security\n    - SAP on the Microsoft Cloud\n- AI AI\n\n- Azure AI\n- Responsible AI with Azure\n- Azure AI Infrastructure\n- Build and modernize intelligent apps\n- Knowledge mining\n- Hugging Face on Azure\n- Azure confidential computing\n- Application development Application development\n\n- Build and modernize intelligent apps\n- Development and testing\n- DevOps\n- DevSecOps\n- Serverless computing\n- Application and Data Modernization\n- Low-code application development on Azure\n- Cloud migration and modernization Cloud migration and modernization\n\n- Migration and modernization center\n- Migrate to innovate in the era of AI\n- Build and modernize intelligent apps​\n- .NET apps migration\n- Development and testing\n- SQL Server migration\n- Windows Server on Azure\n- Linux on Azure\n- SAP on the Microsoft Cloud\n- Oracle on Azure\n- Hybrid Cloud and infrastructure Hybrid Cloud and infrastructure\n\n- Hybrid and multicloud solutions\n- Backup and disaster recovery\n- Windows Server on Azure\n- High-performance computing (HPC)\n- Business-critical applications\n- Quantum computing\n- 5G and Space\n- Resources Resources\n\n- Reference architectures\n- Resources for accelerating growth\n- Azure Marketplace\n- Azure Essentials\n- Browse the Microsoft Business Solutions Hub\n- Pricing\n\n- How to buy How to buy\n    - Azure pricing\n    - Free Azure services\n    - Azure account\n    - Flexible purchase options\n    - Azure benefits and incentives\n- Pricing tools and resources Pricing tools and resources\n\n- Pricing calculator\n- TCO calculator\n- Optimize your costs\n- FinOps on Azure\n- Partners\n\n- Find a partner Find a partner\n    - Azure Marketplace\n    - Find a partner\n- Become a partner Become a partner\n\n- Azure for Partners\n- Azure for ISVs\n- Join ISV Success\n- Resources\n\n- Learning Learning\n    - Get started with Azure\n    - Training and certifications\n    - Customer stories\n    - Analyst reports, white papers, and e-books\n    - Videos\n    - Learn more about cloud computing\n- Technical resources Technical resources\n\n- Documentation\n- Get the Azure mobile app\n- Developer resources\n- Quickstart templates\n- Resources for startups\n- Community Community\n\n- Developer community\n- Students\n- Developer stories\n- What's new What's new\n\n- Blog\n- Events and Webinars\n- Learn\n- Support\n- Contact Sales\n- Get started with Azure\n- Sign in\n- More\n\n- All Microsoft\n    - Global\n\n## Global\n\n- Microsoft 365\n- Teams\n- Copilot\n- Windows\n- Surface\n- Xbox\n- Deals\n- Small Business\n- Support\n- Software Software\n\n- Windows Apps\n- AI\n- Outlook\n- OneDrive\n- Microsoft Teams\n- OneNote\n- Microsoft Edge\n- Skype\n- PCs &amp; Devices PCs &amp; Devices\n\n- Computers\n- Shop Xbox\n- Accessories\n- VR &amp; mixed reality\n- Certified Refurbished\n- Trade-in for cash\n- Entertainment Entertainment\n\n- Xbox Game Pass Ultimate\n- PC Game Pass\n- Xbox games\n- PC and Windows games\n- Movies &amp; TV\n- Business Business\n\n- Microsoft Cloud\n- Microsoft Security\n- Dynamics 365\n- Microsoft 365 for business\n- Microsoft Power Platform\n- Windows 365\n- Microsoft Industry\n- Small Business\n- Developer &amp; IT Developer &amp; IT\n\n- Azure\n- Microsoft Developer\n- Microsoft Learn\n- Explore ISV Success\n- Microsoft Tech Community\n- Azure Marketplace\n- App",
    "chunk_order_index": 0,
    "full_doc_id": "doc-7d09d697a8302c5ae48a7ecea57ad7ec"
  },
  "chunk-e5acca58b5c2c4fd505c72cd1bd53193": {
    "tokens": 1200,
    "content": "- Xbox games\n- PC and Windows games\n- Movies &amp; TV\n- Business Business\n\n- Microsoft Cloud\n- Microsoft Security\n- Dynamics 365\n- Microsoft 365 for business\n- Microsoft Power Platform\n- Windows 365\n- Microsoft Industry\n- Small Business\n- Developer &amp; IT Developer &amp; IT\n\n- Azure\n- Microsoft Developer\n- Microsoft Learn\n- Explore ISV Success\n- Microsoft Tech Community\n- Azure Marketplace\n- AppSource\n- Visual Studio\n- Other Other\n\n- Microsoft Rewards\n- Free downloads &amp; security\n- Education\n- Gift cards\n- Licensing\n- Unlocked stories\n- View Sitemap\n\n# Microsoft unveils Majorana 1, the world’s first quantum processor powered by topological qubits\n\n- by\nChetan Nayak,\n\t\t\t\t\t\t\tTechnical Fellow and Corporate Vice President of Quantum Hardware\n\n- \n- \n- \n\n- Content type\n- News\n\n- Product\n- Azure Quantum\n\nBuilt with a breakthrough class of materials called a topoconductor, Majorana 1 marks a transformative leap toward practical quantum computing.\n\nQuantum computers promise to transform science and society—but only after they achieve the scale that once seemed distant and elusive, and their reliability is ensured by quantum error correction. Today, we’re announcing rapid advancements on the path to useful quantum computing:\n\n- Majorana 1: the world’s first Quantum Processing Unit (QPU) powered by a Topological Core, designed to scale to a million qubits on a single chip.\n- A hardware-protected topological qubit: research published today in Nature, along with data shared at the Station Q meeting, demonstrate our ability to harness a new type of material and engineer a radically different type of qubit that is small, fast, and digitally controlled.\n- A device roadmap to reliable quantum computation: our path from single-qubit devices to arrays that enable quantum error correction.\n- Building the world’s first fault-tolerant prototype (FTP) based on topological qubits: Microsoft is on track to build an FTP of a scalable quantum computer—in years, not decades—as part of the final phase of the Defense Advanced Research Projects Agency (DARPA) Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program.\n\nTogether, these milestones mark a pivotal moment in quantum computing as we advance from scientific exploration to technological innovation.\n\n## Microsoft Quantum Innovator Series\n\nJoin Chetan Nayak to learn about the advancements Microsoft is making in quantum computing.\n\n<!-- image -->\n\n## Harnessing a new type of material\n\nAll of today’s announcements build on our team’s recent breakthrough: the world’s first topoconductor. This revolutionary class of materials enables us to create topological superconductivity, a new state of matter that previously existed only in theory. The advance stems from Microsoft’s innovations in the design and fabrication of gate-defined devices that combine indium arsenide (a semiconductor) and aluminum (a superconductor). When cooled to near absolute zero and tuned with magnetic fields, these devices form topological superconducting nanowires with Majorana Zero Modes (MZMs) at the wires’ ends.\n\nFigure 1: Reading the state of our topological qubit.\n\n<!-- image -->\n\nFor nearly a century, these quasiparticles existed only in textbooks. Now, we can create and control them on demand in our topoconductors. MZMs are the building blocks of our qubits, storing quantum information through ‘parity’—whether the wire contains an even or odd number of electrons. In conventional superconductors, electrons bind into Cooper pairs and move without resistance. Any unpaired electron can be detected because its presence requires extra energy. Our topoconductors are different: here, an unpaired electron is shared between a pair of MZMs, making it invisible to the environment. This unique property protects the quantum information.\n\nWhile this makes our topoconductors ideal candidates for qubits, it also presents a challenge: How do we read quantum information that is so well hidden? How can we distinguish between, say, 1,000,000,000 and 1,000,000,001 electrons?\n\nOur solution to this measurement challenge works as follows (also see Figure 1):\n\n- We use digital switches to couple both ends of the nanowire to a quantum dot, which is a tiny semiconductor device that can store electrical charge.\n- This connection increases the dot’s ability to hold charge. Crucially, the exact increase depends on the parity of the nanowire.\n- We measure this change using microwaves. The dot’s ability to hold charge determines how the microwaves reflect off the quantum dot. As a result, they return carrying an imprint of the nanowire’s quantum state.\n\nWe designed our devices so these changes are large enough to measure reliably in a single shot. Our initial measurements had an error probability of 1%, and we’ve identified clear paths to significantly reduce this.\n\nOur system shows impressive stability. External energy—such as electromagnetic radiation—can break Cooper pairs, creating unpaired electrons that can flip the qubit’s state from even to odd parity. However, our results show that this is rare, occurring only once per millisecond on average. This indicates that the shielding that envelops our processor is effective at keeping such radiation out. We are exploring ways to reduce this even further.\n\nIt’s perhaps not surprising that quantum computation would require us to engineer a new state of matter specifically designed to enable it. What’s remarkable is how accurate our readout technique already is, demonstrating that we are harnessing this exotic state of matter for quantum computation.\n\n## Revolutionizing quantum control through digital precision\n\nThis readout technique enables a fundamentally different approach to quantum computing in which measurements are used to perform calculations.\n\nTraditional quantum computing rotates quantum states through precise angles, requiring complex analog control signals customized for each qubit. This complic",
    "chunk_order_index": 1,
    "full_doc_id": "doc-7d09d697a8302c5ae48a7ecea57ad7ec"
  },
  "chunk-9fa29975ce7f5d34f81b33f8bc44fac3": {
    "tokens": 1200,
    "content": "that quantum computation would require us to engineer a new state of matter specifically designed to enable it. What’s remarkable is how accurate our readout technique already is, demonstrating that we are harnessing this exotic state of matter for quantum computation.\n\n## Revolutionizing quantum control through digital precision\n\nThis readout technique enables a fundamentally different approach to quantum computing in which measurements are used to perform calculations.\n\nTraditional quantum computing rotates quantum states through precise angles, requiring complex analog control signals customized for each qubit. This complicates quantum error correction (QEC), which must rely on these same sensitive operations to detect and correct errors.\n\nOur measurement-based approach simplifies QEC dramatically. We perform error correction entirely through measurements activated by simple digital pulses that connect and disconnect quantum dots from nanowires. This digital control makes it practical to manage the large numbers of qubits needed for real-world applications.\n\n## From physics to engineering\n\nFigure 2: Roadmap to fault-tolerant quantum computation with tetrons. The first panel shows a single-qubit device. The tetron is formed through two parallel topological wires (blue) with an MZM at each end (orange dot) connected by a perpendicular trivial superconducting wire (light blue). The next panel shows a two-qubit device that supports measurement-based braiding transformations. The third panel shows a 4×2 array of tetrons supporting a quantum error detection demonstration on two logical qubits. These demonstrations build toward quantum error correction, such as on the device shown in the right panel (a 27×13 tetron array).\n\n<!-- image -->\n\nWith the core building blocks now demonstrated—quantum information encoded in MZMs, protected by topology, and processed through measurements—we’re ready to move from physics breakthrough to practical implementation.\n\nThe next step is a scalable architecture built around a single-qubit device called a tetron (see Figure 2). At the Station Q meeting, we shared data demonstrating the basic operation of this qubit. One fundamental operation—measuring the parity of one of the topological nanowires in a tetron—uses the same technique described in our Nature paper.\n\nAnother key operation puts the qubit in a superposition of parity states. This, too, is performed by a microwave reflectometry measurement of a quantum dot, but in a different measurement configuration in which we decouple the first quantum dot from the nanowire and connect a different dot to both nanowires at one end of the device. By performing these two orthogonal Pauli measurements, Z and X, we’ve demonstrated measurement-based control—a crucial milestone that unlocks the next steps on our roadmap.\n\nOur roadmap now leads systematically toward scalable QEC. The next steps will involve a 4×2 tetron array. We will first use a two-qubit subset to demonstrate entanglement and measurement-based braiding transformations. Using the entire eight-qubit array, we will then implement quantum error detection on two logical qubits.\n\nThe built-in error protection of topological qubits simplifies QEC. Moreover, our custom QEC codes reduce overhead roughly tenfold compared to the previous state-of-the-art approach. This dramatic reduction means that our scalable system can be built from fewer physical qubits and has the potential to run at a faster clock speed.\n\n## DARPA’s recognition of our approach\n\nThe Defense Advanced Research Projects Agency (DARPA) has selected Microsoft as one of two companies to advance to the final phase of their rigorous benchmarking program known as Underexplored Systems for Utility-Scale Quantum Computing (US2QC)—one of the programs that makes up DARPA’s larger Quantum Benchmarking Initiative (QBI). Microsoft views this recognition as validation of our roadmap for building a fault-tolerant quantum computer with topological qubits.\n\nDARPA’s US2QC program and its broader Quantum Benchmarking Initiative represent a rigorous approach to evaluating quantum systems that could solve problems that are beyond the capabilities of classical computers. To date, the US2QC program has brought together experts from DARPA, Air Force Research Laboratory, Johns Hopkins University Applied Physics Laboratory, Los Alamos National Laboratory, Oak Ridge National Laboratory, and NASA Ames Research Center to verify quantum hardware, software, and applications. Going forward, the larger Quantum Benchmarking Initiative is expected to engage with even more experts in the testing and evaluation of quantum computers.\n\nPreviously, DARPA selected Microsoft for an earlier phase upon an assessment that we could plausibly build a utility-scale quantum computer in a reasonable timeframe. DARPA then evaluated the Microsoft quantum team’s architectural designs and engineering plan for a fault-tolerant quantum computer. As a result of this careful analysis, DARPA and Microsoft have executed an agreement to begin the final phase of the program. During this phase, Microsoft intends to build a fault-tolerant prototype based on topological qubits in years, not decades—a crucial acceleration step toward utility-scale quantum computing.\n\n## Unlocking quantum’s promise\n\nEighteen months ago, we laid out our roadmap to a quantum supercomputer. Today we hit our second milestone, demonstrating the world’s first topological qubit. And we’ve already placed eight topological qubits on a chip designed to house one million.\n\nA million-qubit quantum computer isn’t just a milestone—it’s a gateway to solving some of the world’s most difficult problems. Even today’s most powerful supercomputers cannot accurately predict the quantum processes that determine the properties of the materials essential to our future. But quantum computing at this scale could lead to innovations like self-healing materials that repair cracks in bridges, sustainable agriculture, and safer chemical discovery. What today requires billions of dollars in exhaustive experimental searches and wet-lab experiments could be found, instead, through calculation on a quantum computer.\n\nOur path to useful quantum computing is clear. The foundational technology is proven, and we believe our architecture is scalable. Our new agreement with DARPA shows a commitment to relentless progress toward our goal: building a machine that can drive scientific",
    "chunk_order_index": 2,
    "full_doc_id": "doc-7d09d697a8302c5ae48a7ecea57ad7ec"
  },
  "chunk-ba8a2bcbdd93b4329e942ff41ae902f0": {
    "tokens": 617,
    "content": "at this scale could lead to innovations like self-healing materials that repair cracks in bridges, sustainable agriculture, and safer chemical discovery. What today requires billions of dollars in exhaustive experimental searches and wet-lab experiments could be found, instead, through calculation on a quantum computer.\n\nOur path to useful quantum computing is clear. The foundational technology is proven, and we believe our architecture is scalable. Our new agreement with DARPA shows a commitment to relentless progress toward our goal: building a machine that can drive scientific discovery and solve problems that matter. Stay tuned for more updates on our journey.\n\nStay informed of Microsoft’s advancements in quantum computing:\n\n- Check out Dr. Chetan Nayak on the Microsoft Research Podcast as he explores these groundbreaking advances.\n- Read our papers in Nature and on arXiv.\n- Join us to become quantum ready.\n- Read the Microsoft Source story about today’s news.\n- Hear the Microsoft quantum team discuss these milestones:\n\n<!-- image -->\n\n<!-- image -->\n\n## Related posts\n\n<!-- image -->\n\n- News\n\n### 2025: The year to become Quantum-Ready\n\n- by\nMitra Azizirad,\n\t\t\t\t\t\t\tPresident and Chief Operating Officer of Strategic Missions and Technologies @ Microsoft\n\n<!-- image -->\n\n- News\n\n### Microsoft and Atom Computing offer a commercial quantum machine with the largest number of entangled logical qubits on record\n\n- by\nKrysta Svore,\n\t\t\t\t\t\t\tTechnical Fellow, Advanced Quantum Development, Quantum at Microsoft\n\n<!-- image -->\n\n- News\n\n### Microsoft and Quantinuum create 12 logical qubits and demonstrate a hybrid, end-to-end chemistry simulation\n\n- by\nKrysta Svore,\n\t\t\t\t\t\t\tTechnical Fellow, Advanced Quantum Development, Quantum at Microsoft\n\n## Explore\t\t\t\t\t\n\n\t\t\t\t\t\tMicrosoft Quantum applications\n\nStart building impactful quantum chemistry and materials science applications today.\n\n## Connect with us on social\n\n- \n- \n\n- What is Azure?\n- Get started with Azure\n- Global infrastructure\n- Datacenter regions\n- Trust your cloud\n- Azure Essentials\n- Customer stories\n\n- Products\n- Azure pricing\n- Free Azure services\n- Flexible purchase options\n- FinOps on Azure\n- Optimize your costs\n\n- Solutions\n- Resources for accelerating growth\n- Solution architectures\n- Support\n- Azure demo and live Q&amp;A\n\n- Azure Marketplace\n- Find a partner\n- Join ISV Success\n\n- Training and certifications\n- Documentation\n- Blog\n- Developer resources\n- Students\n- Events and Webinars\n- Analyst reports, white papers, and e-books\n- Videos\n\n- What is cloud computing?\n- What is multicloud?\n- What is machine learning?\n- What is deep learning?\n- What is AIaaS?\n- What are LLMs?\n- What are SLMs?\n- What is RAG?\n\n- Sitemap\n- Contact Microsoft\n- Privacy\n- Manage cookies\n- Terms of use\n- Trademarks\n- Safety &amp; eco\n- Recycling\n- About our ads\n- © Microsoft 2025\n\n<!-- image -->\n\n<!-- image -->",
    "chunk_order_index": 3,
    "full_doc_id": "doc-7d09d697a8302c5ae48a7ecea57ad7ec"
  },
  "chunk-9533a0929a602045e7ef2bedd501d6d5": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Home\n- Our Company\n    - Company News\n    - Official Microsoft Blog\n    - Microsoft On The Issues\n    - Europe\n    - Asia\n    - Latin America\n    - India\n    - UK\n    - Inclusion is Innovation\n    - Conexiones\n- AI\n- Innovation\n- Digital Transformation\n- Diversity &amp; Inclusion\n- Sustainability\n- Work &amp; Life\n- Security\n- Unlocked\n- More\n\n- All Microsoft\n    - Global\n\n## Global\n\n- Microsoft 365\n- Teams\n- Copilot\n- Windows\n- Surface\n- Xbox\n- Deals\n- Small Business\n- Support\n- Software Software\n\n- Windows Apps\n- AI\n- Outlook\n- OneDrive\n- Microsoft Teams\n- OneNote\n- Microsoft Edge\n- Skype\n- PCs &amp; Devices PCs &amp; Devices\n\n- Computers\n- Shop Xbox\n- Accessories\n- VR &amp; mixed reality\n- Certified Refurbished\n- Trade-in for cash\n- Entertainment Entertainment\n\n- Xbox Game Pass Ultimate\n- PC Game Pass\n- Xbox games\n- PC and Windows games\n- Movies &amp; TV\n- Business Business\n\n- Microsoft Cloud\n- Microsoft Security\n- Dynamics 365\n- Microsoft 365 for business\n- Microsoft Power Platform\n- Windows 365\n- Microsoft Industry\n- Small Business\n- Developer &amp; IT Developer &amp; IT\n\n- Azure\n- Microsoft Developer\n- Documentation\n- Microsoft Learn\n- Microsoft Tech Community\n- Azure Marketplace\n- AppSource\n- Visual Studio\n- Other Other\n\n- Microsoft Rewards\n- Free downloads &amp; security\n- Education\n- Gift cards\n- Licensing\n- Unlocked stories\n- View Sitemap\n\n# Microsoft’s Majorana 1 chip carves new path for quantum computing\n\n- \n\n##### Written by\n\n- Catherine Bolgar\n\n##### Published\n\n##### Category\n\n- Innovation\n\nMicrosoft today introduced Majorana 1, the world’s first quantum chip powered by a new Topological Core architecture that it expects will realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.\n\nIt leverages the world’s first topoconductor, a breakthrough type of material which can observe and control Majorana particles to produce more reliable and scalable qubits, which are the building blocks for quantum computers.\n\nIn the same way that the invention of semiconductors made today’s smartphones, computers and electronics possible, topoconductors and the new type of chip they enable offer a path to developing quantum systems that can scale to a million qubits and are capable of tackling the most complex industrial and societal problems, Microsoft said.\n\n“We took a step back and said ‘OK, let’s invent the transistor for the quantum age. What properties does it need to have?’” said Chetan Nayak, Microsoft technical fellow. “And that’s really how we got here – it’s the particular combination, the quality and the important details in our new materials stack that have enabled a new kind of qubit and ultimately our entire architecture.”\n\nThe Majorana 1. Photo by John Brecher for Microsoft.\n\n<!-- image -->\n\nThis new architecture used to develop the Majorana 1 processor offers a clear path to fit a million qubits on a single chip that can fit in the palm of one’s hand, Microsoft said. This is a needed threshold for quantum computers to deliver transformative, real-world solutions – such as breaking down microplastics into harmless byproducts or inventing self-healing materials for construction, manufacturing or healthcare. All the world’s current computers operating together can’t do what a one-million-qubit quantum computer will be able to do.\n\n“Whatever you’re doing in the quantum space needs to have a path to a million qubits. If it doesn’t, you’re going to hit a wall before you get to the scale at which you can solve the really important problems that motivate us,” Nayak said.  “We have actually worked out a path to a million.”\n\nThe topoconductor, or topological superconductor, is a special category of material that can create an entirely new state of matter – not a solid, liquid or gas but a topological state. This is harnessed to produce a more stable qubit that is fast, small and can be digitally controlled, without the tradeoffs required by current alternatives. A new paper published Wednesday in Nature outlines how Microsoft researchers were able to create the topological qubit’s exotic quantum properties and also accurately measure them, an essential step for practical computing.\n\nChetan Nayak, Microsoft technical fellow. Photo by John Brecher for Microsoft.\n\n<!-- image -->\n\nThis breakthrough required developing an entirely new materials stack made of indium arsenide and aluminum, much of which Microsoft designed and fabricated atom by atom. The goal was to coax new quantum particles called Majoranas into existence and take advantage of their unique properties to reach the next horizon of quantum computing, Microsoft said.\n\nThe world’s first Topological Core powering the Majorana 1 is reliable by design, incorporating error resistance at the hardware level making it more stable.\n\nCommercially important applications will also require trillions of operations on a million qubits, which would be prohibitive with current approaches that rely on fine-tuned analog control of each qubit. The Microsoft team’s new measurement approach enables qubits to be controlled digitally, redefining and vastly simplifying how quantum computing works.\n\nThis progress validates Microsoft’s choice years ago to pursue a topological qubit design – a high risk, high reward scientific and engineering challenge that is now paying off. Today, the company has placed eight topological qubits on a chip designed to scale to one million.\n\nMatthias Troyer, Microsoft technical fellow. Photo by John Brecher for Microsoft.\n\n<!-- image -->\n\n“From the start we wanted to make a quantum computer for commercial impact, not",
    "chunk_order_index": 0,
    "full_doc_id": "doc-8e5b292d1fe6ce1bdc9429363b39d622"
  },
  "chunk-cc11bfa273b4b935b6fce1503dfd0d23": {
    "tokens": 1200,
    "content": "ining and vastly simplifying how quantum computing works.\n\nThis progress validates Microsoft’s choice years ago to pursue a topological qubit design – a high risk, high reward scientific and engineering challenge that is now paying off. Today, the company has placed eight topological qubits on a chip designed to scale to one million.\n\nMatthias Troyer, Microsoft technical fellow. Photo by John Brecher for Microsoft.\n\n<!-- image -->\n\n“From the start we wanted to make a quantum computer for commercial impact, not just thought leadership,” said Matthias Troyer, Microsoft technical fellow. “We knew we needed a new qubit. We knew we had to scale.”\n\nThat approach led the Defense Advanced Research Projects Agency (DARPA), a federal agency that invests in breakthrough technologies that are important to national security, to include Microsoft in a rigorous program to evaluate whether innovative quantum computing technologies could build commercially relevant quantum systems faster than conventionally believed possible.\n\nMicrosoft is now one of two companies to be invited to move to the final phase of DARPA’s Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program – one of the programs that makes up DARPA’s larger Quantum Benchmarking Initiative – which aims to deliver the industry’s first utility-scale fault-tolerant quantum computer, or one whose computational value exceeds its costs.\n\n## ‘It just gives you the answer’\n\nIn addition to making its own quantum hardware, Microsoft has partnered with Quantinuum and Atom Computing to reach scientific and engineering breakthroughs with today’s qubits, including the announcement last year of the industry’s first reliable quantum computer.\n\nThese types of machines offer important opportunities to develop quantum skills, build hybrid applications and drive new discovery, particularly as AI is combined with new quantum systems that will be powered by larger numbers of reliable qubits. Today, Azure Quantum offers a suite of integrated solutions allowing customers to leverage these leading AI, high performance computing and quantum platforms in Azure to advance scientific discovery.\n\nBut reaching the next horizon of quantum computing will require a quantum architecture that can provide a million qubits or more and reach trillions of fast and reliable operations. Today’s announcement puts that horizon within years, not decades, Microsoft said.\n\nBecause they can use quantum mechanics to mathematically map how nature behaves with incredible precision – from chemical reactions to molecular interactions and enzyme energies – million-qubit machines should be able to solve certain types of problems in chemistry, materials science and other industries that are impossible for today’s classical computers to accurately calculate.\n\n- For instance, they could help solve the difficult chemistry question of why materials suffer corrosion or cracks. This could lead to self-healing materials that repair cracks in bridges or airplane parts, shattered phone screens or scratched car doors.\n\n- Because there are so many types of plastics, it isn’t currently possible to find a one-size-fits-all catalyst that can break them down – especially important for cleaning up microplastics or tackling carbon pollution. Quantum computing could calculate the properties of such catalysts to break down pollutants into valuable byproducts or develop non-toxic alternatives in the first place.\n\n- Enzymes, a kind of biological catalyst, could be harnessed more effectively in healthcare and agriculture, thanks to accurate calculations about their behavior that only quantum computing can provide. This could lead to breakthroughs helping to eradicate global hunger: boosting soil fertility to increase yields or promoting sustainable growth of foods in harsh climates.\n\nMost of all, quantum computing could allow engineers, scientists, companies and others to simply design things right the first time – which would be transformative for everything from healthcare to product development. The power of quantum computing, combined with AI tools, would allow someone to describe what kind of new material or molecule they want to create in plain language and get an answer that works straightaway – no guesswork or years of trial and error.\n\n“Any company that makes anything could just design it perfectly the first time out. It would just give you the answer,” Troyer said. “The quantum computer teaches the AI the language of nature so the AI can just tell you the recipe for what you want to make.”\n\n## Rethinking quantum computing at scale\n\nThe quantum world operates according to the laws of quantum mechanics, which are not the same laws of physics that govern the world we see. The particles are called qubits, or quantum bits, analogous to the bits, or ones and zeros, that computers now use.\n\nQubits are finicky and highly susceptible to perturbations and errors that come from their environment, which cause them to fall apart and information to be lost. Their state can also be affected by measurement – a problem because measuring is essential for computing. An inherent challenge is developing a qubit that can be measured and controlled, while offering protection from environmental noise that corrupts them.\n\nQubits can be created in different ways, each with advantages and disadvantages. Nearly 20 years ago, Microsoft decided to pursue a unique approach: developing topological qubits, which it believed would offer more stable qubits requiring less error correction, thereby unlocking speed, size and controllability advantages. The approach posed a steep learning curve, requiring uncharted scientific and engineering breakthroughs, but also the most promising path to creating scalable and controllable qubits capable of doing commercially valuable work.\n\n<!-- image -->\n\nThe disadvantage is – or was – that until recently the exotic particles Microsoft sought to use, called Majoranas, had never been seen or made. They don’t exist in nature and can only be coaxed into existence with magnetic fields and superconductors. The difficulty of developing the right materials to create the exotic particles and their associated topological state of matter is why most quantum efforts have focused on other kinds of qubits.\n\nThe Nature paper marks peer-reviewed confirmation that Microsoft has not only been able to create Majorana particles, which help protect quantum information from random disturbance, but can also reliably measure that information from them using microwaves.\n\nMajoranas hide quantum information, making it more robust, but also harder to measure. The Microsoft team’s",
    "chunk_order_index": 1,
    "full_doc_id": "doc-8e5b292d1fe6ce1bdc9429363b39d622"
  },
  "chunk-744e6601749aaf45a520963ae6f28097": {
    "tokens": 1200,
    "content": "superconductors. The difficulty of developing the right materials to create the exotic particles and their associated topological state of matter is why most quantum efforts have focused on other kinds of qubits.\n\nThe Nature paper marks peer-reviewed confirmation that Microsoft has not only been able to create Majorana particles, which help protect quantum information from random disturbance, but can also reliably measure that information from them using microwaves.\n\nMajoranas hide quantum information, making it more robust, but also harder to measure. The Microsoft team’s new measurement approach is so precise it can detect the difference between one billion and one billion and one electrons in a superconducting wire – which tells the computer what state the qubit is in and forms the basis for quantum computation.\n\nThe measurements can be turned on and off with voltage pulses, like flicking a light switch, rather than finetuning dials for each individual qubit. This simpler measurement approach that enables digital control simplifies the quantum computing process and the physical requirements to build a scalable machine.\n\nMicrosoft’s topological qubit also has an advantage over other qubits because of its size. Even for something that tiny, there’s a “Goldilocks” zone, where a too-small qubit is hard to run control lines to, but a too-big qubit requires a huge machine, Troyer said. Adding the individualized control technology for those types of qubits would require building an impractical computer the size of an airplane hangar or football field.\n\nMajorana 1, Microsoft’s quantum chip that contains both qubits as well as surrounding control electronics, can be held in the palm of one’s hand and fits neatly into a quantum computer that can be easily deployed inside Azure datacenters.\n\n“It’s one thing to discover a new state of matter,” Nayak said. “It’s another to take advantage of it to rethink quantum computing at scale.”\n\n## Designing quantum materials atom by atom\n\nMicrosoft’s topological qubit architecture has aluminum nanowires joined together to form an H. Each H has four controllable Majoranas and makes one qubit. These Hs can be connected, too, and laid out across the chip like so many tiles.\n\n“It’s complex in that we had to show a new state of matter to get there, but after that, it’s fairly simple. It tiles out. You have this much simpler architecture that promises a much faster path to scale,” said Krysta Svore, Microsoft technical fellow.\n\nKrysta Svore, Microsoft technical fellow. Photo by John Brecher for Microsoft.\n\n<!-- image -->\n\nThe quantum chip doesn’t work alone. It exists in an ecosystem with control logic, a dilution refrigerator that keeps qubits at temperatures much colder than outer space and a software stack that can integrate with AI and classical computers. All those pieces exist, built or modified entirely in-house, she said.\n\nTo be clear, continuing to refine those processes and getting all the elements to work together at accelerated scale will require more years of engineering work. But many difficult scientific and engineering challenges have now been met, Microsoft said.\n\nGetting the materials stack right to produce a topological state of matter was one of the hardest parts, Svore added. Instead of silicon, Microsoft’s topoconductor is made of indium arsenide, a material currently used in such applications as infrared detectors and which has special properties. The semiconductor is married with superconductivity, thanks to extreme cold, to make a hybrid.\n\n“We are literally spraying atom by atom. Those materials have to line up perfectly. If there are too many defects in the material stack, it just kills your qubit,” Svore said.\n\n“Ironically, it’s also why we need a quantum computer – because understanding these materials is incredibly hard. With a scaled quantum computer, we will be able to predict materials with even better properties for building the next generation of quantum computers beyond scale,” she said.\n\nRelated links:\n\nLearn more: Introducing Microsoft Majorana 1\n\nRead more: Microsoft unveils Majorana 1, the world’s first quantum processor powered by topological qubits\n\nLearn more: Microsoft’s Quantum Ready program\n\nLearn more: Azure Quantum Solutions\n\nRead more: In a historic milestone, Azure Quantum demonstrates formerly elusive physics needed to build scalable topological qubits\n\nRead more: Nature: Interferometric Single-Shot Parity Measurement in InAs-Al Hybrid Devices\n\nRead more: arXiv: Roadmap to fault tolerant quantum computation using topological qubit arrays\n\nTop image: Majorana 1, the first quantum chip powered by a Topological Core based on a revolutionary new class of materials developed by Microsoft. Photo by John Brecher for Microsoft.\n\n#### Tags:\n\n- AIProduct developmentTechnology\n\n- Surface Pro\n- Surface Laptop\n- Surface Laptop Studio 2\n- Surface Laptop Go 3\n- Microsoft Copilot\n- AI in Windows\n- Explore Microsoft products\n- Windows 11 apps\n\n- Account profile\n- Download Center\n- Microsoft Store support\n- Returns\n- Order tracking\n- Certified Refurbished\n- Microsoft Store Promise\n- Flexible Payments\n\n- Microsoft in education\n- Devices for education\n- Microsoft Teams for Education\n- Microsoft 365 Education\n- How to buy for your school\n- Educator training and development\n- Deals for students and parents\n- Azure for students\n\n- Microsoft Cloud\n- Microsoft Security\n- Dynamics 365\n- Microsoft 365\n- Microsoft Power Platform\n- Microsoft Teams\n- Microsoft 365 Copilot\n- Small Business\n\n- Azure\n- Microsoft Developer\n- Documentation\n- Microsoft Learn\n- Microsoft Tech Community\n- Azure Marketplace\n- AppSource\n- Visual Studio\n\n- Careers\n- About Microsoft\n- Company news\n- Privacy at Microsoft\n- Investors\n- Diversity and inclusion\n- Accessibility\n- Sustainability\n\n- Sitemap\n- Contact Microsoft\n- Privacy\n- Manage cookies\n- Terms of use\n- Trademarks\n- Safety &amp; eco",
    "chunk_order_index": 2,
    "full_doc_id": "doc-8e5b292d1fe6ce1bdc9429363b39d622"
  },
  "chunk-643666737a9c7081f60b52551e7a6f5c": {
    "tokens": 115,
    "content": "365 Copilot\n- Small Business\n\n- Azure\n- Microsoft Developer\n- Documentation\n- Microsoft Learn\n- Microsoft Tech Community\n- Azure Marketplace\n- AppSource\n- Visual Studio\n\n- Careers\n- About Microsoft\n- Company news\n- Privacy at Microsoft\n- Investors\n- Diversity and inclusion\n- Accessibility\n- Sustainability\n\n- Sitemap\n- Contact Microsoft\n- Privacy\n- Manage cookies\n- Terms of use\n- Trademarks\n- Safety &amp; eco\n- Recycling\n- About our ads\n- © Microsoft 2025",
    "chunk_order_index": 3,
    "full_doc_id": "doc-8e5b292d1fe6ce1bdc9429363b39d622"
  },
  "chunk-54be0dbd1fadd3ad9e7e266c22ca9423": {
    "tokens": 1200,
    "content": "- #MobileWorldCongress2025\n- #25BestTechBrands\n- Best Products\n    - The Best Laptops for 2025\n    - The Best PCs (Desktop Computers) for 2025\n    - The Best Tablets for 2025\n    - The Best Phones for 2025\n    - The Best Wi-Fi Routers for 2025\n    - The Best External Hard Drives for 2025\n    - The Best All-in-One Printers for 2025\n    - The Best TVs for 2025\n    - The Best Headphones for 2025\n    - The Best Robot Vacuums for 2025\n    - The Best VPN Services for 2025\n    - The Best Antivirus Software for 2025\n    - The Best Password Managers for 2025\n    - The Best Web Hosting Services for 2025\n    - The Best Video Editing Software for 2025\n    - The Best Graphics Cards for 2025\n    - The Best Gaming Laptops for 2025\n    - The Best Printers for 2025\n    - The Best Monitors for 2025\n    - See All Best Products\n- Comparisons\n- Reviews\n- How-To\n- News\n- Opinions\n- Deals\n- PCs &amp; Hardware\n\n- Laptops\n- Desktop Computers\n- Tablets\n- Monitors\n- Hard Drives\n- SSDs\n- Network Attached Storage\n- Wi-Fi Routers\n- Wi-Fi Range Extenders\n- Wi-Fi Mesh Networking Systems\n- Printers\n- 3D Printers\n- Scanners\n- Webcams\n- Computer Mice\n- Keyboards\n- Graphics Cards\n- Processors\n- Motherboards\n- PC Cases\n- Mobile\n\n- Mobile Phones\n- Wireless Carriers\n- Modems &amp; Hotspots\n- Bluetooth Headsets\n- Mobile Phone Accessories\n- Mobile Apps\n- Android Apps\n- iPhone Apps\n- iPad Apps\n- Electronics\n\n- TVs\n- Projectors\n- Media Streaming Devices\n- Headphones\n- Speakers\n- Ebook Readers\n- Cameras\n- Lenses\n- Drones\n- VR\n- Electric &amp; Hybrid Cars\n- Car Accessories\n- Smart Home\n\n- Smart Home\n- Home Security\n- Home Security Cameras\n- Robot Vacuums\n- Smart Displays\n- Smart Lighting\n- Smart Locks\n- Smart Plugs\n- Smart Thermostats\n- Smart Lawn Mowers\n- Appliances\n- Connected Kitchen\n- Health &amp; Fitness\n\n- Health &amp; Fitness\n- Wearables\n- Fitness Trackers\n- Heart Rate Monitors\n- Smart Scales\n- Medical Alert Systems\n- Gaming\n\n- Gaming Hardware\n- Gaming Systems\n- Gaming Controllers &amp; Accessories\n- Games\n- PC Games\n- Microsoft Xbox Games\n- Nintendo Games\n- Sony Playstation Games\n- Mobile Games\n- Game Streaming Services\n- Software &amp; Services\n\n- Artificial Intelligence (AI)\n- Operating Systems\n- Productivity\n- System Utilities\n- Photo &amp; Design\n- Education\n- Website &amp; App Building Tools\n- Communications\n- Personal Finance\n- Accounting\n- E-Commerce &amp; Payments\n- Human Resources\n- IT Management\n- Sales &amp; Marketing\n- Streaming Video\n- Streaming Music\n- Dating Apps\n- DNA Testing Kits\n- Meal Kits\n- Security\n\n- Security\n- Security Suites\n- Antivirus\n- VPN\n- Password Managers\n- Parental Control\n- Malware Removal\n- Ransomware Protection\n- Events\n\n- Amazon Prime Big Deal Days\n- Apple WWDC\n- Black Friday\n- Black Hat\n- CES\n- Comic Con\n- Computex\n- Cyber Monday\n- E3\n- Google I/O\n- IFA\n- Microsoft Build\n- Mobile World Congress (MWC)\n- Presidents' Day\n- RSAC\n- SXSW\n- Samsung Unpacked\n- Summer of Gaming\n- Series\n\n- 5G\n- Accessibility Technology\n- Advertising Content\n- All About AI\n- Amplify\n- Android\n- Apple\n- Back to School Tech\n- Best Internet Service Providers (ISPs)\n- Business Choice\n- Connected Traveler\n- Fast Forward\n- Fastest Mobile Networks\n- Forward Thinking\n- Get Organized\n- Holiday Gift Guide\n- How to Work From Home\n- IT Watch\n- In Depth\n- Moms, Dads &amp; Grads Gift Guide\n- NextCar\n- PCMag Picks\n- PCMag Turns 40!\n- Readers' Choice\n- Refresh Your Tech\n- Retro Computing\n- Rigged Up\n- Robotics\n- Science &amp; Space\n- SecurityWatch\n- TechX Awards\n- The Best of the Year\n- The Pop-Off\n- The Why Axis\n- Try AI\n- Weekend Project\n- Windows 11\n- Newsletters\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- \n\n1. Home\n2. News\n\n# Microsoft: New Chip Means Quantum Computing Is 'Years, Not Decades' Away\n\nThe breakthrough with Majorana 1 comes after a nearly 20-year quest to harness a new state of matter, which Microsoft says it has now done with its 'topological superconductors.'\n\n<!-- image -->\n\n<!-- image -->\n\nMicrosoft announced a breakthrough new chip, the Majorana 1, which it says will make quantum computing a reality in \"years, not decades.\"\n\nThe Majorana 1, pronounced \"My-orana\" and named after quantum particles called Majoranas, fits in the palm of your hand. Microsoft says it could power more than \"all the world's current computers operating together. \" It also happens to have a delightfully retro look, yet it claims it can eventually make science fiction",
    "chunk_order_index": 0,
    "full_doc_id": "doc-8acbd7e2ba6590b764926849ad788fbd"
  },
  "chunk-b5e48b059916b369005ddd43d6088f8e": {
    "tokens": 1200,
    "content": "image -->\n\n<!-- image -->\n\nMicrosoft announced a breakthrough new chip, the Majorana 1, which it says will make quantum computing a reality in \"years, not decades.\"\n\nThe Majorana 1, pronounced \"My-orana\" and named after quantum particles called Majoranas, fits in the palm of your hand. Microsoft says it could power more than \"all the world's current computers operating together. \" It also happens to have a delightfully retro look, yet it claims it can eventually make science fiction a reality.\n\nIt's the culmination of the company's nearly 20-year quest to advance quantum computing. It provides a path to systems that can scale to one million qubits on a single chip—\"a needed threshold for quantum computers to deliver transformative, real-world solutions,\" Microsoft says.\n\nA qubit is a basic unit of quantum information and the building block for a quantum computer.\n\n<!-- image -->\n\nThe magic of Majorana 1 lies in its material. Microsoft says its scientists developed a material that harnesses a \"new state of matter–not a solid, liquid, or gas, but a topological state.\" With that, it created \"topoconductors,\" or Topological Superconductors, that enable topological qubits that are smaller, faster, and more stable.\n\n\"This progress validates Microsoft’s choice years ago to pursue a topological qubit design–a high risk, high reward scientific and engineering challenge that is now paying off,\" Microsoft says.\n\n<!-- image -->\n\nMicrosoft says its topoconductors are a breakthrough of a similar magnitude to semiconductors, which \"made today's smartphones, computers, and electronics possible.\"\n\nWhat would a world look like with quantum computing? The big goal for Majorana 1 is to open up new businesses and industries, not to exist as an isolated thought experiment. A few practical applications could include breaking down microplastics and inventing \"self-healing' materials for construction, manufacturing, or healthcare, Microsoft says. It also expects agricultural breakthroughs through improved soil fertility.\n\n### Recommended by Our Editors\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nCombining AI with quantum systems could speed up the trial and error of product development or eliminate it altogether by modeling the laws of nature. “Any company that makes anything could just design it perfectly the first time out. It would just give you the answer,” says Matthias Troyer, Microsoft technical fellow. “The quantum computer teaches the AI the language of nature so the AI can just tell you the recipe for what you want to make.”\n\nBut unleashing quantum computing systems could also open up a new world of cybersecurity risks and military theats. The US military is working with Microsoft to develop its topoconductor approach through a Defense Advanced Research Projects Agency (DARPA) program. DARPA's mission is to lead \"high-risk, high-reward R&amp;D to seize the advantages of technological surprise for the US warfighter,\" according to its website.\n\nGoogle revealed its quantum chip, Willow, in December. But Nvidia is less confident that quantum computing is right around the corner; its CEO estimates that it will take another 20 years before it's useful.\n\n<!-- image -->\n\n### Get Our Best Stories!\n\nSign up for What's New Now to get our top stories delivered to your inbox every morning.\n\nThis newsletter may contain advertising, deals, or affiliate links.\n        By clicking the button, you confirm you are 16+ and agree to our\n    Terms of Use and\n    Privacy Policy.\n    You may unsubscribe from the newsletters at any time.\n\nYour subscription has been confirmed. Keep an eye on your inbox!\n\n<!-- image -->\n\n### About Emily Forlini\n\n#### Senior Reporter\n\n<!-- image -->\n\nI'm the expert at PCMag for all things electric vehicles and AI. I've written hundreds of articles on these topics, including product reviews, daily news, CEO interviews, and deeply reported features. I also cover other topics within the tech industry, keeping a pulse on what technologies are coming down the pipe that could shape how we live and work.\n\nRead Emily's full bio\n\n#### Read the latest from Emily Forlini\n\n- Is OpenAI's Rumored $20,000 AI Agent Good Enough to Take Your Job?\n- With Flood of Chinese AI on the Horizon, US Mulls DeepSeek Ban\n- Not Just Skype: Microsoft Is Killing This 34-Year-Old App, Too\n- Anthropic Backs Classified Info-Sharing Between AI Companies, US Government\n- Elon Musk Rails Against Amtrak, Calls to Privatize the 'Embarrassing' Train Service\n- More from Emily Forlini\n\nAdvertisement\n\n### Mobile World Congress (MWC)\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n### Further Reading\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- \n- \n- \n- \n- \n- \n\n## Honest, Objective, Lab-Tested Reviews\n\nPCMag.com is a leading authority on technology, delivering lab-based, independent reviews of the latest\n            products and services. Our expert industry analysis and practical solutions help you make better buying\n            decisions and get more from technology.\n\n### Best Products\n\n### Best Products\n\n- 3D Printers\n- Android Phones\n- Android Tablets\n- Antivirus Apps\n- Apple iPads\n- Apple iPhones\n- Apple Watches\n\n- Bluetooth Speakers\n- Car Phone Mounts\n- CPUs For Gaming\n- Ereaders\n- Fitness Trackers\n- Gaming Keyboards\n- Gaming Laptops\n\n- Gaming Monitors\n- Graphics Cards\n- Headphones\n- Keyboards\n- Laptops\n- Laptops For College Students\n- Media Streaming Devices\n\n- Password Managers\n- Photo Printers\n- Robot Vacuums\n- Smart Thermostats\n- Smartwatches\n- Soundbars\n\n- Tablets\n- Tax Software",
    "chunk_order_index": 1,
    "full_doc_id": "doc-8acbd7e2ba6590b764926849ad788fbd"
  },
  "chunk-c55dd9b3965fe91ee732e62a11750c1e": {
    "tokens": 1012,
    "content": "Car Phone Mounts\n- CPUs For Gaming\n- Ereaders\n- Fitness Trackers\n- Gaming Keyboards\n- Gaming Laptops\n\n- Gaming Monitors\n- Graphics Cards\n- Headphones\n- Keyboards\n- Laptops\n- Laptops For College Students\n- Media Streaming Devices\n\n- Password Managers\n- Photo Printers\n- Robot Vacuums\n- Smart Thermostats\n- Smartwatches\n- Soundbars\n\n- Tablets\n- Tax Software\n- TVs\n- Video Editing Software\n- VPN Services\n- VR Headsets\n\n### Popular Reviews\n\n### Popular Reviews\n\n- Acer Swift X 14 Review\n- Alienware Gaming Monitor (AW2725QF) Review\n- AMD Ryzen 7 7700X Review\n- Beats Studio Buds + Review\n\n- Blink Outdoor 4 Review\n- Ecobee Smart Thermostat Review\n- FreshBooks Review\n- Google Pixel 9 Review\n\n- H&amp;R Block 2025 Review\n- Intuit TurboTax 2025 Review\n- Lenovo Legion Go Review\n- Nvidia GeForce RTX 5080 Founders Edition Review\n\n- Samsung Galaxy S25 Review\n- Samsung Galaxy S25+ Review\n- Samsung Galaxy S25 Ultra Review\n- Samsung Galaxy Watch 7 Review\n\n- Samsung Galaxy Watch Ultra Review\n- Samsung Galaxy Z Fold 6 Review\n- SimpliSafe Home Security System Review\n\n### Popular Product Comparisons\n\n### Popular Product Comparisons\n\n- Apple AirPods 4 vs. AirPods Pro 2\n- Apple iPhone 16e vs. iPhone 16\n- Apple Watch Series 10 vs. Series 9\n\n- FreshBooks vs. QuickBooks\n- Mac vs. Windows\n- Meta Quest 3 vs. 3S\n\n- Nest vs. Ring\n- OLED vs. QLED\n- Proton VPN vs. NordVPN\n\n- Sony PlayStation 5 vs. PlayStation 5 Pro\n- SSD vs. Hard Drive\n\n- Wi-Fi Extender vs. Mesh\n- Windows 11 Home vs. Pro\n\n### Top Explainers\n\n### Top Explainers\n\n- How Do Airtags Work?\n- How Does Starlink Work?\n- How to Organize Tax Documents\n- How to Set Up a VPN\n\n- Is Google Password Manager Safe?\n- What Is a Proxy Server?\n- What Is Agentic AI?\n- What Is an AI PC?\n\n- What Is an eSim Card?\n- What Is Discord?\n- What Is Microsoft Copilot?\n\n- What Is the Best Browser?\n- What Is USB-C?\n- What Is Wi-Fi 6E?\n\n- What Is Wi-Fi 7?\n- What To Stream This Weekend\n- Why You Need a VPN\n\n### Popular Brands\n\n### Popular Brands\n\n- Acer\n- Adobe\n- AMD\n- Apple\n- Asus\n- Bitdefender\n\n- Dell\n- Facebook\n- Google\n- HP\n- Instagram\n- Intel\n\n- Lenovo\n- LG\n- Microsoft\n- Motorola\n- MSI\n- Netflix\n\n- NordVPN\n- Nvidia\n- OpenAI\n- Qualcomm\n- Samsung\n- Sony\n\n- SpaceX\n- Tesla\n- X/Twitter\n\n### Series\n\n### Series\n\n- All About AI\n- Android\n- Apple\n- Back to School Tech\n- Best ISPs\n- Connected Traveler\n- Get Organized\n\n- Holiday Gift Guide\n- NextCar\n- Readers' Choice\n- Rigged Up\n- SecurityWatch\n- Weekend Project\n- Windows 11\n\n### Events\n\n### Events\n\n- Amazon Prime Day\n- Apple WWDC\n- Black Friday\n- Black Hat\n- CES\n- Computex\n\n- Cyber Monday\n- IFA\n- Mobile World Congress\n- RSAC\n- Samsung Unpacked\n\n- Reviews\n- Best Products\n- Categories\n- Brands\n- Events\n- Series\n- Newsletters\n- Encyclopedia\n- Sitemap\n\n- About PCMag\n- Careers\n- Contact Us\n- Press Center\n\n- Ziffmedia Logo\n- Askmen Logo\n- Extremetech Logo\n- ING Logo\n- Lifehacker Logo\n- Mashable Logo\n- Offers Logo\n- RetailMeNot Logo\n- Speedtest Logo\n\n© 1996-2025 Ziff Davis, LLC., a Ziff Davis company. All Rights Reserved.\n\nPCMag, PCMag.com and PC Magazine are among the federally registered trademarks of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any\n                    affiliation or the endorsement of PCMag. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\n- About Ziff Davis\n- Privacy Policy\n- Terms of Use\n- Advertise\n- Accessibility\n- Do Not Sell My Personal Information\n\n- AdChoices\n- TRUSTe Logo\n-",
    "chunk_order_index": 2,
    "full_doc_id": "doc-8acbd7e2ba6590b764926849ad788fbd"
  },
  "chunk-c1876dea533f8d399340781355b0895e": {
    "tokens": 1161,
    "content": "- Space\n- Health\n- Environment\n- Humans\n- Tech\n- Nature\n- Physics\n- Society\n- Opinion\n- Explainer\n\n- About Us\n- Our Team\n\n- \n- \n- \n- \n\n- Contact\n- Privacy\n- Privacy Manager\n- Accessibility\n- Terms\n\n# Microsoft Claims a Major Quantum Breakthrough, But What Does It Do?\n\n<!-- image -->\n\nResearchers at Microsoft have announced the creation of the first \"topological qubits\" in a device that stores information in an exotic  state of matter, in what may be a significant breakthrough for  quantum computing.\n\nAt the same time, the researchers also published a paper in Nature and a \"roadmap\" for further work. The design of the Majorana 1 processor is supposed to fit up to a million qubits, which may be enough to realise many significant goals of quantum computing – such as cracking cryptographic codes and designing new drugs and materials faster.\n\nIf Microsoft's claims pan out, the company may have leapfrogged competitors such as IBM and Google, who currently appear to be leading the race to build a  quantum computer.\n\nHowever, the peer-reviewed Nature paper only shows part of what the researchers have claimed, and the roadmap still includes many hurdles to be overcome.\n\nMajorana 1 certainly has style. (John Brecher/Microsoft)\n\n<!-- image -->\n\nWhile the Microsoft press release shows off something that is supposed to be quantum computing hardware, we don't have any independent confirmation of what it can do. Nevertheless, the news from Microsoft is very promising.\n\nBy now you probably have some questions. What's a topological qubit? What's a qubit at all, for that matter? And why do people want  quantum computers in the first place?\n\n## Quantum bits are hard to build\n\nQuantum computers were first dreamed up in the 1980s. Where an ordinary computer stores information in bits, a quantum computer stores information in quantum bits – or qubits.\n\nAn ordinary bit can have a value of 0 or 1, but a quantum bit (thanks to the laws of quantum mechanics, which govern very small particles) can have a combination of both.\n\nIf you imagine an ordinary bit as an arrow that can point either up or down, a qubit is an arrow that can point in any direction (or what is called a \"superposition\" of up and down).\n\nThis means a quantum computer would be much faster than an ordinary computer for certain kinds of calculations – particularly some to do with unpicking codes and simulating natural systems.\n\nSo far, so good. But it turns out that building real qubits and getting information in and out of them is extremely difficult, because interactions with the outside world can destroy the delicate quantum states inside.\n\nResearchers have tried a lot of different technologies to make qubits, using things like atoms trapped in electric fields or eddies of current swirling in superconductors.\n\n## Tiny wires and exotic particles\n\nMicrosoft has taken a very different approach to build its \"topological qubits\". They have used what are called Majorana particles, first theorised in 1937 by Italian physicist Ettore Majorana.\n\nMajoranas are not naturally occurring particles like electrons or protons. Instead, they only exist inside a rare kind of material called a topological  superconductor (which requires advanced material design and must be cooled down to extremely low temperatures).\n\nIndeed, Majorana particles are so exotic they are usually only studied in universities – not used in practical applications.\n\nThe Microsoft team say they have used a pair of tiny wires, each with a Majorana particle trapped at either end, to act as a qubit. They measure the value of the qubit – expressed by means of whether an electron is in one wire or the other – using microwaves.\n\n## Braided bits\n\nWhy has Microsoft put in all this effort? Because by swapping the positions of Majorana particles (or measuring them in a certain way), they can be \"braided\" so they can be measured without error and are resistant to outside interference. (This is the \"topological\" part of \"topological qubits\".)\n\nIn theory, a quantum computer made using Majorana particles can be completely free of the qubit errors that plague other designs.\n\nThis is why Microsoft has chosen such a seemingly laborious approach. Other technologies are more prone to errors, and hundreds of physical qubits may need to be combined together to produce a single reliable \"logical qubit\".\n\nMicrosoft has instead put its time and resources into developing Majorana-based qubits. While they are late to the big quantum party, they hope they will be able to catch up quickly.\n\n## There's always a catch\n\nAs always, if something sounds too good to be true, there is a catch. Even for a Majorana-based quantum computer, such as the one announced by Microsoft, one operation – known as T-gate – won't be achievable without errors.\n\nSo the Majorana-based quantum chip is only \"almost error-free\". However, correcting for T-gate errors is much simpler than the general error correction of other quantum platforms.\n\nMicrosoft plans to scale up by grouping together more and more qubits. (Microsoft)\n\n<!-- image -->\n\nWhat now? Microsoft will try to move ahead with its roadmap, steadily building larger and larger collections of qubits.\n\nThe scientific community will closely watch how Microsoft's quantum computing processors operate, and how they perform in comparison to the other already established quantum computing processors.\n\nAt the same time, research into the exotic and obscure behaviour of Majorana particles will continue at universities around the globe.\n\nStephan Rachel, Professor, School of Physics, The University of Melbourne\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\n<!-- image -->",
    "chunk_order_index": 0,
    "full_doc_id": "doc-c1876dea533f8d399340781355b0895e"
  },
  "chunk-dbd4e52ca51b9e9339af2ea570a911b9": {
    "tokens": 61,
    "content": "At the same time, research into the exotic and obscure behaviour of Majorana particles will continue at universities around the globe.\n\nStephan Rachel, Professor, School of Physics, The University of Melbourne\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\n<!-- image -->",
    "chunk_order_index": 1,
    "full_doc_id": "doc-c1876dea533f8d399340781355b0895e"
  },
  "chunk-0804e411610416c86a33efd8738719da": {
    "tokens": 1200,
    "content": "- Skip to main content\n- Skip to secondary menu\n- Skip to primary sidebar\n- Skip to footer\n\nGeeky Gadgets\n\nThe Latest Technology News\n\n- Home\n- Top News\n- AI\n- Apple\n- Android\n- Technology\n- Guides\n- Gadgets\n- Hardware\n- Gaming\n- Autos\n- Deals\n- About\n\n# Microsoft Quantum Computing Leap : How the Majorana 1 Chip is Changing Everything\n\n7:02 am February 23, 2025 By Julian Horsey\n\nMicrosoft has unveiled a significant advancement in quantum computing with the introduction of the “Majorana 1” chip and the discovery of a new new state of matter. This development has the potential to reshape computational boundaries, allowing solutions to problems that are currently unsolvable by classical computers within any practical timeframe. Microsoft has taken a critical step toward creating scalable and reliable quantum systems that could transform industries and scientific research.\n\nAt the core of this breakthrough lies a fascinating concept: topological qubits. Unlike traditional qubits, which are notoriously fragile, these are built to be stable and reliable, addressing one of the biggest hurdles in quantum computing—errors. And the best part? Microsoft has managed to integrate this innovative technology into a chip small enough to fit in the palm of your hand. But what does this mean for you and the world around you? Matthew Berman explores how this leap in quantum computing could transform industries, spark innovation, and tackle some of the most pressing issues of our time.\n\n## Microsoft Majorana 1\n\nTL;DR Key Takeaways :\n\n- Microsoft unveiled the “Majorana 1” chip, using topological qubits and a new state of matter to achieve scalable, reliable quantum computing capable of solving problems beyond classical computing’s reach.\n- Topological qubits, central to this breakthrough, are more stable and resistant to interference, addressing quantum computing’s major challenge of error correction.\n- The compact Majorana 1 chip, engineered with advanced materials like indium arsenide and aluminum, integrates error correction and scales up to a million qubits, transforming quantum hardware design.\n- A novel measurement technique enhances precision in detecting quantum states, improving the accuracy and reliability of quantum computations.\n- Quantum computing promises fantastic applications across industries, including healthcare, environmental sustainability, chemistry, and logistics, solving problems classical computers cannot tackle efficiently.\n\n## What Are Topological Qubits?\n\nCentral to this breakthrough is the innovation of topological qubits, which are made possible by the discovery of a new state of matter. Unlike traditional qubits, which are highly susceptible to environmental disturbances, topological qubits are inherently more stable. Their unique structure encodes quantum information in a way that resists interference, significantly reducing the likelihood of errors. This enhanced stability addresses one of the most pressing challenges in quantum computing: the need for effective error correction.\n\nBy reducing the complexity of error correction, topological qubits pave the way for more efficient and practical quantum systems. Their robustness makes them a cornerstone of Microsoft’s strategy to build scalable quantum computers capable of solving real-world problems.\n\n## The Majorana 1 Chip: A Compact Powerhouse\n\nThe Majorana 1 chip represents a major leap forward in quantum hardware design. Roughly the size of a human palm, it is engineered to scale up to a million qubits, a stark contrast to traditional quantum systems that require vast, intricate infrastructures to house far fewer qubits. This compact design is made possible by integrating error correction directly into the chip through the use of topological qubits.\n\nBy combining scalability with reliability, the Majorana 1 chip sets a new benchmark for quantum computing hardware. Its design not only reduces the physical footprint of quantum systems but also simplifies their operation, making practical quantum computing a more achievable goal. This innovation could accelerate the adoption of quantum technology across various sectors.\n\n## Microsoft Quantum Computing Breakthrough\n\nWatch this video on YouTube.\n\nExpand your understanding of Quantum Computing with additional resources from our extensive library of articles.\n\n- AI and Quantum Computing: Applications and Future Potential\n- How Google’s Willow Chip is Advancing Quantum Computing\n- Rigetti Ankaa-3 Quantum Computer: 84 Qubits of Innovation\n- How Quantum Computing is Transforming AI and Cybersecurity\n- Artificial Intelligence vs Quantum Computing\n- What is quantum computing and how does it work?\n- Quantum computing Hype vs Reality explained\n- Google’s Willow Chip Sets a New Standard in Quantum Computing\n- Rigetti Novera QPU Quantum computer CPU processor launches\n- Microsoft Majorana 1: A Quantum Leap Towards a Million Qubits\n\n## Material Science at the Heart of Innovation\n\nThe functionality of the Majorana 1 chip is underpinned by advancements in material science. Microsoft has carefully engineered the chip at the atomic level using indium arsenide and aluminum. These materials enable the creation of Majorana particles, a phenomenon that was purely theoretical until recent breakthroughs.\n\nMajorana particles play a critical role in safeguarding quantum information, making sure the stability and reliability of the qubits. This precise atomic engineering represents a significant step forward in the development of robust quantum systems. By harnessing these materials, Microsoft has demonstrated the potential of material science to drive innovation in quantum computing.\n\n## Enhanced Precision with New Measurement Techniques\n\nA key component of Microsoft’s breakthrough is the introduction of a novel measurement technique. This method allows for the detection of subtle differences in quantum states, greatly enhancing the accuracy and reliability of quantum computations. Precise measurement is essential for the practical application of quantum computing, as even minor inaccuracies can compromise the results of complex calculations.\n\nBy addressing this challenge, Microsoft has removed a significant barrier to the widespread adoption of quantum technology. This advancement not only improves the performance of quantum systems but also builds confidence in their ability to deliver reliable results in real-world scenarios.\n\n## Fantastic Applications Across Industries\n\nThe potential applications of quantum computing are vast, with the capability to transform numerous industries. Some of the most promising areas of",
    "chunk_order_index": 0,
    "full_doc_id": "doc-0cb3e6a1088c27dc2a63364cab238229"
  },
  "chunk-2531fd3b21ee88ec70e3094c8609d30d": {
    "tokens": 1200,
    "content": "Precise measurement is essential for the practical application of quantum computing, as even minor inaccuracies can compromise the results of complex calculations.\n\nBy addressing this challenge, Microsoft has removed a significant barrier to the widespread adoption of quantum technology. This advancement not only improves the performance of quantum systems but also builds confidence in their ability to deliver reliable results in real-world scenarios.\n\n## Fantastic Applications Across Industries\n\nThe potential applications of quantum computing are vast, with the capability to transform numerous industries. Some of the most promising areas of impact include:\n\n- Chemistry: Simulating intricate molecular interactions to accelerate the discovery of new materials and pharmaceuticals.\n- Healthcare: Allowing advancements in personalized medicine and improving the accuracy of diagnostics.\n- Environmental Sustainability: Modeling complex climate systems and developing innovative solutions, such as plastic-degrading enzymes.\n- Transportation and Logistics: Optimizing systems for greater efficiency, reduced costs, and lower emissions.\n\nThese applications highlight the fantastic potential of quantum computing to address challenges that are currently beyond the reach of classical computing. By unlocking new possibilities, quantum technology could drive innovation and progress across a wide range of fields.\n\n## Classical vs. Quantum Computing: A Fundamental Shift\n\nThe Majorana 1 chip underscores the fundamental differences between classical and quantum computing. Classical computers process information sequentially, relying on binary bits that represent either a 0 or a 1. In contrast, quantum computers use qubits, which can exist in multiple states simultaneously thanks to the principles of superposition and entanglement.\n\nThis unique capability allows quantum systems to perform multiple calculations at once, solving problems in minutes that would take classical computers millions of years. This shift in computational power opens up unprecedented opportunities for innovation, allowing solutions to problems that were previously considered intractable.\n\n## Looking Ahead: The Future of Quantum Computing\n\nMicrosoft’s advancements in quantum computing mark a pivotal moment in the evolution of technology. By addressing critical challenges such as scalability, error correction, and measurement precision, the Majorana 1 chip lays the groundwork for a future where quantum computing becomes a practical tool for solving the world’s most complex problems.\n\nAs this technology continues to mature, its impact is expected to ripple across industries, driving breakthroughs in science, medicine, and sustainability. The progress made by Microsoft signals the beginning of a new era in computation, one that holds the promise of transforming how we approach and solve global challenges.\n\nMedia Credit: Matthew Berman\n\n- Share\n- Tweet\n- Pin\n- Email\n\nLatest Geeky Gadgets Deals\n\nDisclosure: Some of our articles include affiliate links. If you buy something through one of these links, Geeky Gadgets may earn an affiliate commission. Learn about our  Disclosure Policy.\n\n## Primary Sidebar\n\n- Email\n- Facebook\n- Pinterest\n- RSS\n- Twitter\n\n### Top News\n\n<!-- image -->\n\n#### Keychron K4 HE Wireless Magnetic Switch Keyboard for Precision and Performance $145\n\n<!-- image -->\n\n<!-- image -->\n\n#### New ChatGPT 4.5 : The Good The Bad and The UGLY\n\n<!-- image -->\n\n<!-- image -->\n\n#### M4 MacBook Air vs. M4 MacBook Pro. Which Is Right for You?\n\n<!-- image -->\n\n<!-- image -->\n\n#### Amazon Unveils Alexa+ : New Alexa AI Smart Assistant Upgrade\n\n<!-- image -->\n\n<!-- image -->\n\n#### Samsung Galaxy Tab S10 FE Leaked Design and Specs Revealed\n\n### Guides\n\n<!-- image -->\n\n<!-- image -->\n\n#### STOP iOS 18.3.1 Battery Drain Do THIS Immediately\n\n<!-- image -->\n\n<!-- image -->\n\n#### How to Build Stunning Interactive Google Sheets Dashboards to Wow and Inform\n\n<!-- image -->\n\n<!-- image -->\n\n#### Unlock iPhone Camera Secrets: Pro Settings Revealed!\n\n<!-- image -->\n\n<!-- image -->\n\n#### Converting the iPhone 16e to a Dumbphone A Practical Guide\n\n<!-- image -->\n\n<!-- image -->\n\n#### 7 Fantastic AI Tools to Supercharge Your Efficiency in 2025\n\n### Apple News\n\n<!-- image -->\n\n<!-- image -->\n\n#### M4 MacBook Air vs. M4 MacBook Pro. Which Is Right for You?\n\n<!-- image -->\n\n<!-- image -->\n\n#### STOP iOS 18.3.1 Battery Drain Do THIS Immediately\n\n<!-- image -->\n\n<!-- image -->\n\n#### iPad Air M3 vs. M2 The True Impact of the New Chip\n\n<!-- image -->\n\n<!-- image -->\n\n#### M3 Ultra Mac Studio and M4 MacBook Air. Apple’s Latest Powerhouse Releases\n\n<!-- image -->\n\n<!-- image -->\n\n#### Unlock iPhone Camera Secrets: Pro Settings Revealed!\n\n### Technology News\n\n<!-- image -->\n\n<!-- image -->\n\n#### New ChatGPT 4.5 : The Good The Bad and The UGLY\n\n<!-- image -->\n\n<!-- image -->\n\n#### Amazon Unveils Alexa+ : New Alexa AI Smart Assistant Upgrade\n\n<!-- image -->\n\n<!-- image -->\n\n#### Samsung Galaxy Tab S10 FE Leaked Design and Specs Revealed\n\n<!-- image -->\n\n<!-- image -->\n\n#### Automation Revolution : OpenAI’s AI Agents Are Changing Everything\n\n<!-- image -->\n\n<!-- image -->\n\n#### Meta Aria Gen 2 AI Glasses : The Future of AI and AR Wearables?\n\n### Android News\n\n<!-- image -->\n\n<!-- image -->\n\n#### Samsung Galaxy Tab S10 FE Leaked Design and Specs Revealed\n\n<!-- image -->\n\n<!-- image -->\n\n#### M4 MacBook Air Significant Performance Boost Revealed\n\n<!-- image -->\n\n<!-- image -->\n\n#### OPPO Find N5 Fold vs. Samsung Galaxy Z Fold 6: Head-to-Head Comparison\n\n<!-- image -->\n\n<!-- image -->\n\n#### Nothing Phone (3a) Pro: 17 Essential Tips and Tricks\n\n<!-- image -->\n\n<!-- image -->\n\n#### 10 Secret Galaxy S25 Ultra Features That Will Blow Your Mind\n\n## Footer\n\n### About Us\n\n- About Geeky Gadgets\n- Advertise On Geeky Gadgets\n- Archives\n- Contact Geeky Gadgets\n- Disclosure Policy\n- Free Newsletter\n- Geeky Gadgets Logo\n- Privacy Policy\n- Site Map\n\n### Further Reading\n\n- AI\n- Apple iPad\n- Apple iPhone",
    "chunk_order_index": 1,
    "full_doc_id": "doc-0cb3e6a1088c27dc2a63364cab238229"
  },
  "chunk-272f7fbf78ae030170915fe214d92383": {
    "tokens": 195,
    "content": "17 Essential Tips and Tricks\n\n<!-- image -->\n\n<!-- image -->\n\n#### 10 Secret Galaxy S25 Ultra Features That Will Blow Your Mind\n\n## Footer\n\n### About Us\n\n- About Geeky Gadgets\n- Advertise On Geeky Gadgets\n- Archives\n- Contact Geeky Gadgets\n- Disclosure Policy\n- Free Newsletter\n- Geeky Gadgets Logo\n- Privacy Policy\n- Site Map\n\n### Further Reading\n\n- AI\n- Apple iPad\n- Apple iPhone\n- Auto News\n- Camera News\n- Concepts &amp; Design\n- Design News\n- Entertainment News\n- Geeky Stuff\n- Guides\n- Mobile Phone News\n- Reviews\n- Sponsored\n- Tablet News\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- Home\n- Top News\n- AI\n- Apple\n- Android\n- Technology\n- Guides\n- Gadgets\n- Hardware\n- Gaming\n- Autos\n- Deals\n- About",
    "chunk_order_index": 2,
    "full_doc_id": "doc-0cb3e6a1088c27dc2a63364cab238229"
  },
  "chunk-ba1af7fce400c513d370c12d71e2335e": {
    "tokens": 1200,
    "content": "- \n- View Profile\n- Sign out\n\n- \n- Space\n- Health\n- Planet Earth\n- Animals\n- Archaeology\n- Physics &amp; Math\n- Technology\n- Human Behavior\n- Chemistry\n- More\n    - Science news\n    - Life's Little Mysteries\n    - Science quizzes\n    - About us\n    - Newsletter\n    - Follow us\n    - Story archive\n\n<!-- image -->\n\n- The ultimate action-packed science and technology magazine bursting with exciting information about the universe\n- Subscribe today and save an extra 5% with checkout code 'LOVE5'\n- Engaging articles, amazing illustrations &amp; exclusive interviews\n- Issues delivered straight to your door or device\n\n- Daylight saving 2025\n- Flu brain damage\n- 'Viking' shipwreck mystery\n- Lightning jet from space\n- 'Blood Moon' lunar eclipse 2025\n\n1. Computing\n\n# Breakthrough quantum chip that harnesses new state of matter could set us on the path to quantum supremacy\n\nMicrosoft scientists have created a quantum processor that taps into a rare state of matter that was first theorized in the 1930s, paving the way for a processor with a million qubits within years.\n\n- \n- \n- \n- \n- \n- \n- \n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n<!-- image -->\n\nScientists at Microsoft have built a new quantum computing chip using a special category of material capable of tapping into a new state of matter. This breakthrough could enable researchers to build a single chip with millions of reliable qubits much sooner than experts predicted — possibly within just a few years rather than decades.\n\nThe new quantum processing unit (QPU), called \"Majorana 1,\" is an eight-qubit prototype chip built from the first material of its kind in the world — a topological conductor, or topoconductor. This can reach the \"topological\" state of matter and tap into the laws quantum mechanics under the right conditions in order to process the 1s and 0s of computing data in a quantum computer.\n\nThe new type of qubit, called a \"topological qubit,\" is stable, smaller, less power-draining and more scalable than a qubit made from a superconducting metal — the most common type of qubit used in quantum computers built by companies such as Google, IBM, and Microsoft itself.\n\n\"We took a step back and said 'Ok, let's invent the transistor for the quantum age. What properties does it need to have?',\" Chetan Nayak, Microsoft technical fellow and professor of physics at the University of California Santa Barbara, said in a statement. \"And that's really how we got here — it's the particular combination, the quality and the important details in our new materials stack that have enabled a new kind of qubit and ultimately our entire architecture.\"\n\nRelated: Quantum simulation breakthrough will lead to 'discoveries impossible in today's fastest supercomputers,' Google scientists claim\n\nThe fabrication of this QPU was only possible after researchers, for the first time, used the architecture to definitively observe and control an enigmatic subatomic particle with special properties called the \"Majorana fermion,\" or \"Majorana zero mode\" (MZM), theorized by mathematician Ettore Majorana in 1937.\n\nMajorana's theory proposed that a particle could be its own antiparticle, and may actually coexist rather than only annihalating each other. (Image credit: Getty Images/Mondadori Portfolio/Contributor)\n\n<!-- image -->\n\nScientists have previously tried to create Majorana fermions to use for a new kind of quantum computing. Explorations of the Majorana fermion and its proposed use in quantum computers span many years, including a reported discovery of the particle in 2012 and in April 2024. Scientists in June 2023 also published a study reporting the discovery of the topological state of matter.\n\n## Sign up for the Live Science daily newsletter now\n\nGet the world’s most fascinating discoveries delivered straight to your inbox.\n\nMajorana's theory proposed that a particle could be its own antiparticle. That means it's theoretically possible to bring two of these particles together, and they will either annihilate each other in a massive release of energy (as is normal) or can coexist stably when pairing up together — priming them to store quantum information.\n\nThese subatomic particles do not exist in nature, so to nudge them into being, Microsoft scientists had to make a series of breakthroughs in materials science, fabrication methods and measurement techniques. They outlined these discoveries — the culmination of a 17-year-long project — in a new study published Feb. 19 in the journal Nature.\n\n## This is a 'transistor for the quantum age'\n\nChief among these discoveries was the creation of this specific topoconductor, which is used as the basis of the qubit. The scientists built their topoconductor from a material stack that combined a semiconductor made of indium arsenide (typically used in devices like night vision goggles) with an aluminum superconductor.\n\nThe researchers needed the right combination of these components to trigger the desired transition into the new topological state of matter. They also needed to create very specific conditions to achieve this — namely, temperatures near absolute zero and exposure to magnetic fields. Only then could they usher MZMs into existence.\n\nThe new Majorana 1 Quantum processor has eight topolgoical qubits, each composed of superconducting and topological conducting wires fitted alongside MZMs and a semiconductor quantum dot. (Image credit: John Brecher for Microsoft)\n\n<!-- image -->\n\nTo construct one qubit, which is less than 10 microns in size — much smaller than superconducting qubits — the scientists arranged a set of nanowires into an H shape, with two longer topoconducting wires joined in the center by one superconducting wire",
    "chunk_order_index": 0,
    "full_doc_id": "doc-14fc41c87e66d0601a52439cee0ecd85"
  },
  "chunk-44a81de7bb13da16c2879f1f928965e9": {
    "tokens": 1200,
    "content": "processor has eight topolgoical qubits, each composed of superconducting and topological conducting wires fitted alongside MZMs and a semiconductor quantum dot. (Image credit: John Brecher for Microsoft)\n\n<!-- image -->\n\nTo construct one qubit, which is less than 10 microns in size — much smaller than superconducting qubits — the scientists arranged a set of nanowires into an H shape, with two longer topoconducting wires joined in the center by one superconducting wire. They next induced four MZMs to exist on all four points of the H by cooling the structure down and tuning it with magnetic fields. Finally, to measure the signal when the device would be operational, they connected the H with a semiconductor quantum dot — equivalent to a small capacitor that carries charge.\n\nTopoconductors differ from superconductors in the way they behave when burdened with an unpaired electron. In superconductors, electrons usually pair up — known as Cooper pairs — with an odd number of electrons (any unpaired electron) requiring a massive amount of energy to accommodate, or enter an excited state. The difference in energy between the ground state and the excited state is the basis for the 1s and 0s of data in superconducting qubits.\n\nLike superconductors, topoconductors use the presence or absence of an unpaired electron as the 1s and 0s of computing data, but the material can \"hide\" unpaired electrons by sharing their presence among the paired electrons. This means there is no measurable energy difference when unpaired electrons are added into the system, making the qubit more stable at the hardware level and protecting the quantum information. However, it also means it's harder to measure the qubit's quantum state.\n\nThis is where the quantum dot comes in. The scientists beam a single electron from the quantum dot into one end of the wire, through the MZM, and it emerges from the other end, through another MZM. By blasting the quantum dot with microwaves as this happens, the returning reflection carries an imprint of the quantum state of the nanowires.\n\nThe accuracy of this measurement is approximately 99%, the scientists said in the study, noting that electromagnetic radiation is one example of an external factor that triggers an error once per millisecond, on average. The scientists said this is rare and indicates that the inherent shielding in the new type of processor is effective at keeping radiation out.\n\n## The path to a million qubits\n\n\"It's complex in that we had to show a new state of matter to get there, but after that, it's fairly simple. It tiles out. You have this much simpler architecture that promises a much faster path to scale,\" Krysta Svore, Microsoft's principal research manager, said in the statement.\n\nSvore added this new qubit architecture, called the \"Topological Core,\" represents the first step on the path to creating workable 1 million-qubit quantum computers — likening its creation to the shift from building computers using vacuum tubes to transistors in the 20th century.\n\nThis is thanks to the smaller size and higher quality of the qubits, alongside the ease with which they can scale because of the way the qubits fit together like tiles, the scientists said in the study.\n\nIn the next few years, the scientists plan to build a single chip with a million physical qubits, which will, in turn, lead to useful scientific breakthroughs in fields like medicine, materials science and our understanding of nature that would be impossible to make using the fastest supercomputers.\n\nThe scientists plan on improving this technology in the coming years to the extent we'll see a quantum chip with a million physical qubits. (Image credit: John Brecher for Microsoft)\n\n<!-- image -->\n\n—World's 1st hybrid quantum supercomputer goes online in Japan\n\n—Schrödinger's Cat breakthrough could usher in the 'Holy Grail' of quantum computing, making them error-proof\n\n—New quantum computing milestone smashes entanglement world record\n\nThe quantum chip does not work in isolation, however. Rather, it exists in an ecosystem alongside a dilution refrigerator to achieve extremely cold temperatures, a system that manages control logic, and software that can integrate with classical computers and artificial intelligence (AI). The scientists said that optimizing these systems so that they can work at a much bigger scale will take years of further research. But this timeline may be expedited with further breakthroughs.\n\n\"Those materials have to line up perfectly. If there are too many defects in the material stack, it just kills your qubit,\" Svore said in the statement. \"Ironically, it's also why we need a quantum computer — because understanding these materials is incredibly hard. With a scaled quantum computer, we will be able to predict materials with even better properties for building the next generation of quantum computers beyond scale.\"\n\n<!-- image -->\n\nKeumars is the technology editor at Live Science. He has written for a variety of publications including ITPro, The Week Digital, ComputerActive, The Independent, The Observer, Metro and TechRadar Pro. He has worked as a technology journalist for more than five years, having previously held the role of features editor with ITPro. He is an NCTJ-qualified journalist and has a degree in biomedical sciences from Queen Mary, University of London. He's also registered as a foundational chartered manager with the Chartered Management Institute (CMI), having qualified as a Level 3 Team leader with distinction in 2023.\n\n### You must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\n<!-- image -->\n\nScientists discover simpler way to achieve Einstein's 'spooky action at a distance' thanks to AI breakthrough — bringing quantum internet closer to reality\n\n<!-- image -->\n\nAWS launches 'Ocelot' quantum processor — a chip inspired by Schrödinger's cat that corrects errors exponentially with scale\n\n<!-- image -->\n\nGolden scaleless cave",
    "chunk_order_index": 1,
    "full_doc_id": "doc-14fc41c87e66d0601a52439cee0ecd85"
  },
  "chunk-79977326d5c468200223878184856f29": {
    "tokens": 354,
    "content": "2023.\n\n### You must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\n<!-- image -->\n\nScientists discover simpler way to achieve Einstein's 'spooky action at a distance' thanks to AI breakthrough — bringing quantum internet closer to reality\n\n<!-- image -->\n\nAWS launches 'Ocelot' quantum processor — a chip inspired by Schrödinger's cat that corrects errors exponentially with scale\n\n<!-- image -->\n\nGolden scaleless cave fish discovered in China shows evolution in action\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n1. 1Golden scaleless cave fish discovered in China shows evolution in action\n2. 2Unproven Einstein theory of 'gravitational memory' may be real after all, new study hints\n3. 3The rare genetic disorder that causes severe itchiness and liver failure\n4. 42,600-year-old jewelry stash from ancient Egypt includes gold statuette depicting family of gods\n5. 5CDC data reveal plummeting rate of cervical precancers in young US women — down by 80%\n\nLive Science is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\n- About Us\n- Contact Future's experts\n- Terms and conditions\n- Privacy policy\n- Cookies policy\n- Accessibility Statement\n- Advertise with us\n- Web notifications\n- Careers\n- Editorial standards\n- How to pitch a story to us\n\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036.\n\n<!-- image -->",
    "chunk_order_index": 2,
    "full_doc_id": "doc-14fc41c87e66d0601a52439cee0ecd85"
  },
  "chunk-a3a45e25b9faae4cae74304b205ba9c6": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Home\n- Posts\n- About Us\n- Contact Us\n\n# Microsoft Majorana 1 Quantum Computing Chip Announced\n\nChad Collins\n\nFebruary 20, 2025\n\n<!-- image -->\n\nMicrosoft has taken a monumental leap in quantum technology with the unveiling of its Majorana 1 quantum processor. This revolutionary chip, built on a pioneering Topological Core architecture, promises to bring practical quantum computing within reach—compressing timelines from decades to mere years. The Majorana 1 isn’t just another quantum chip; it’s a potential game-changer in the race toward solving real-world problems that classical computers can’t handle.\n\n### The Power of Topoconductors: A New Class of Materials\n\nAt the core of this advancement is Microsoft’s creation of the world’s first topoconductor—a groundbreaking material that enables topological superconductivity. This isn’t just a tweak to existing tech; it’s a scientific breakthrough that translates decades of theoretical physics into operational hardware.\n\n<!-- image -->\n\nTopoconductors allow the stable manipulation of Majorana zero modes—elusive particles first theorized in the 1930s by physicist Ettore Majorana. These particles are unique because they are their own antiparticles, and they offer a path to creating topological qubits that are inherently more stable and less prone to decoherence. In contrast to conventional qubits, which require complex error-correction protocols due to their fragile nature, topological qubits could drastically reduce error rates, leading to more efficient quantum computations.\n\n### Why Majorana 1 Stands Out\n\nThe Majorana 1 is designed with eight qubits but with scalability in mind. Microsoft’s roadmap envisions scaling up to one million qubits on a single chip—an essential threshold for tackling highly complex problems in fields like:\n\n- Drug discovery – Accelerating the identification of new compounds and materials.\n- Sustainable technologies – Developing self-healing materials and more efficient batteries.\n- Environmental solutions – Creating methods to break down persistent microplastics.\n- Financial modeling – Simulating market behaviors with unprecedented accuracy.\n\nUnlike many other quantum projects that focus on near-term applications using noisy intermediate-scale quantum (NISQ) devices, Microsoft is focused on long-term, fault-tolerant quantum computing. The use of topological qubits offers a more scalable, less error-prone pathway compared to traditional superconducting or trapped-ion qubits used by rivals like Google and IBM.\n\n### Strategic Control Over Quantum Resources\n\nOne notable decision is Microsoft’s choice to keep Majorana 1 in-house rather than immediately integrating it into their Azure Quantum cloud platform. This highlights the strategic significance of the technology and suggests that Microsoft aims to perfect the system before broad public deployment. It also reflects a growing trend among tech giants to maintain tighter control over foundational quantum technologies during these critical early stages.\n\n### A Broader Quantum Landscape\n\nThe development of Majorana 1 positions Microsoft alongside quantum heavyweights like Google, which achieved “quantum supremacy” in 2019, and IBM, which recently launched its 1,121-qubit Condor processor. However, Microsoft’s unique approach using topological qubits could offer a more stable, scalable solution—addressing a major hurdle in quantum computing: error correction.\n\nExperts believe that this development could shorten the timeline for achieving Quantum Advantage—the point at which quantum computers outperform classical systems on meaningful tasks. While others in the industry remain focused on scaling noisy qubit systems, Microsoft’s bet on topological stability could give it a critical edge.\n\n### What This Means for the Future\n\nIf successful, Microsoft’s Majorana 1 could reshape industries by unlocking computational capabilities that have, until now, been purely theoretical. From revolutionizing material science and cryptography to solving global sustainability challenges, the potential applications are vast.\n\nFor the quantum community, the debut of Majorana 1 signals a pivotal shift—proving that practical, large-scale quantum computing might not be decades away but rather within striking distance.\n\nAs the quantum race intensifies, Microsoft’s topological approach could be the disruptive force that finally propels quantum computing into the mainstream.\n\n## Key Takeaways\n\n- The Majorana 1 chip uses a new Topological Core architecture to accelerate quantum computing development\n- Microsoft’s topoconductor material enables practical applications of quantum theory\n- The chip represents a proprietary approach to quantum computing separate from cloud services\n\n## Architecture and Design of the Majorana 1\n\nMicrosoft’s Majorana 1 introduces a revolutionary Topological Core architecture that combines specialized materials and quantum processing techniques. The chip integrates advanced error correction systems with a scalable design aimed at achieving stable quantum operations.\n\n### Quantum Processing and Topological Qubits\n\nThe Majorana 1’s Topological Core architecture processes quantum information using topological qubits, which are more stable than traditional qubit designs. These qubits leverage Majorana Zero Modes (MZMs) to store and manipulate quantum states.\n\nThe quantum processing unit operates through precise control of quantum states within the topological system. Microsoft’s design aims to maintain coherence longer than conventional quantum processors.\n\nThe chip’s processing capabilities stem from its unique ability to harness topological properties for quantum operations. This approach reduces sensitivity to environmental noise and interference.\n\n### Materials and Fabrication\n\nThe chip combines indium arsenide semiconductor material with aluminum superconductors in a specialized materials stack. This combination creates the conditions necessary for topological quantum states.\n\nThe fabrication process uses gate-defined devices that precisely control the quantum states. Microsoft developed new manufacturing techniques to ensure consistent material properties across the chip.\n\nThe materials selection plays a crucial role in maintaining quantum coherence. The aluminum superconductor layer provides the necessary environment for MZMs to form and remain stable.\n\n### Error Correction and System Stability\n\nThe Majorana 1 implements built-in error correction through its topological design. This approach reduces the need for extensive external error correction systems.\n\nThe chip’s stability comes from its self-correcting properties inherent in topological quantum states. Error rates",
    "chunk_order_index": 0,
    "full_doc_id": "doc-837ec4638a12c3e3a702dc3dc78aba45"
  },
  "chunk-94e390ce777ccd9b2255f3471712e3c2": {
    "tokens": 539,
    "content": "new manufacturing techniques to ensure consistent material properties across the chip.\n\nThe materials selection plays a crucial role in maintaining quantum coherence. The aluminum superconductor layer provides the necessary environment for MZMs to form and remain stable.\n\n### Error Correction and System Stability\n\nThe Majorana 1 implements built-in error correction through its topological design. This approach reduces the need for extensive external error correction systems.\n\nThe chip’s stability comes from its self-correcting properties inherent in topological quantum states. Error rates are significantly lower compared to traditional quantum processors.\n\nMicrosoft engineered multiple layers of error detection systems to monitor and maintain quantum operations. The design includes real-time error monitoring and correction mechanisms.\n\n### Scalability and Integration\n\nThe chip architecture supports scaling to larger quantum systems. Microsoft designed the Topological Core for integration with existing digital control systems.\n\nThe scalable design aims to support future systems with millions of qubits. Each processing unit can connect with others through specialized quantum communication channels.\n\nMicrosoft developed integration protocols for Azure Quantum services. The architecture includes standard interfaces for connecting to classical computing systems and Azure datacenters.\n\nThe chip’s modular design allows for systematic expansion of quantum processing capacity. Teams can add more processing units while maintaining system stability.\n\n#### most recent\n\n<!-- image -->\n\n###### Video Cards\n\n### Frustration Boils Over as Hopes of Upgrading to Radeon RX 9070 XT Dashed by Scalpers\n\n<!-- image -->\n\n###### MacOS\n\n### Best Way to Install Python on Mac\n\n<!-- image -->\n\n###### iPads\n\n### Setting Up Multiple Apple IDs on iPad\n\n<!-- image -->\n\n###### iPads\n\n### iPad Pro Newest Generation\n\n<!-- image -->\n\n###### iPads\n\n### New iPad Mini 2024: Specifications and Features\n\n<!-- image -->\n\n###### MacOS, iPhone\n\n### How To Connect An iPhone Camera to Mac\n\nAffiliate Disclosure: ComputerCity.com is supported by its readers and our writers choose products independently. When you make a purchase through links on our site, we may earn a commission from affiliate programs.\n\ninfo\n\nComputerCity.com is your go-to source for tech insights, tutorials, and troubleshooting guides. Whether you're using a PC, Mac, or mobile device, we provide clear, easy-to-follow advice to help you navigate the world of technology. From computers and laptops to tablets and smartwatches, we've got you covered. Explore and unlock the full potential of your devices with us!\n\nPHone ‪(775) 293-8455‬\n\n2300 E Postal Dr\nPahrump, NV 89048\n\n© 2025 COMPUTERCITY.com | Sitemap\n\nAccessibility | Privacy | Opt-Out | Terms &amp; Conditions | Posts | Contact Us",
    "chunk_order_index": 1,
    "full_doc_id": "doc-837ec4638a12c3e3a702dc3dc78aba45"
  },
  "chunk-4f1d15b518b9dd99d016dda746b1310d": {
    "tokens": 1200,
    "content": "## InfoQ Software Architects' Newsletter\n\nA monthly overview of things you need to know as an architect or aspiring architect.\n\nView an example\n\nWe protect your privacy.\n\nFacilitating the Spread of Knowledge and Innovation in Professional Software Development\n\n- English edition\n- Chinese edition\n- Japanese edition\n- French edition\n\nBack to login\n\nBack to login\n\n#### Login with:\n\n#### Don't have an InfoQ account?\n\n### Topics\n\n- Java\n- Kotlin\n- .Net\n- C#\n- Swift\n- Go\n- Rust\n- JavaScript\n\n### Featured in  Development\n\n- Practical Benchmarking: How To Detect Performance Changes in Noisy Results\n\nMatt Fleming provides tips for understanding noise, where it comes, and techniques for fighting it, plus some anecdotes and real-life examples from the world of open-source.\n\n- Architecture\n- Enterprise Architecture\n- Scalability/Performance\n- Design\n- Case Studies\n- Microservices\n- Service Mesh\n- Patterns\n- Security\n\n### Featured in  Architecture &amp; Design\n\n- If Architectural Experimentation Is So Great, Why Aren’t You Doing It?\n\nArchitectural experimentation sounds like a great idea, yet it does not seem to be used very frequently. In this article, we will explore some of the reasons why teams don’t use this powerful tool more often, and what they can do about leveraging that tool for successful outcomes.\n\n- Big Data\n- Machine Learning\n- NoSQL\n- Database\n- Data Analytics\n- Streaming\n\n### Featured in  AI, ML &amp; Data Engineering\n\n- Powering User Experiences with Streaming Dataflow\n\nAlana Marzoev discusses the fundamentals of streaming dataflow and the architecture of ReadySet, a streaming dataflow system designed specifically for operational workloads.\n\n- Agile\n- Diversity\n- Leadership\n- Lean/Kanban\n- Personal Growth\n- Scrum\n- Sociocracy\n- Software Craftmanship\n- Team Collaboration\n- Testing\n- UX\n\n### Featured in  Culture &amp; Methods\n\n- The (Not So) Hidden Social Drivers Behind the Highest Performing Engineering Teams\n\nLizzie Matusov delves into how trust and psychological safety serve as powerful signals of team success with practical methods to evaluate and measure these key social dimensions.\n\n- Infrastructure\n- Continuous Delivery\n- Automation\n- Containers\n- Cloud\n- Observability\n\n### Featured in  DevOps\n\n- Efficient DevSecOps Workflows with a Little Help from AI\n\nMichael Friedrich tells a story about experienced pain points, wasted hours debugging and solving, and learning how a little help from AI makes DevSecOps workflows efficient again.\n\n### Helpful links\n\n- About InfoQ\n- InfoQ Editors\n- Write for InfoQ\n- About C4Media\n- Diversity\n\n### Choose your language\n\n- En\n- 中文\n- 日本\n- Fr\n\n<!-- image -->\n\nDiscover emerging trends, insights, and real-world best practices in software development &amp; tech leadership. Join now.\n\n<!-- image -->\n\nLearn how senior software developers are solving the challenges you face. Register now with early bird tickets.\n\n<!-- image -->\n\nLearn practical solutions to today's most pressing software challenges. Register now with early bird tickets.\n\n<!-- image -->\n\nExplore insights, real-world best practices and solutions in software development &amp; leadership. Register now.\n\nInfoQ Homepage\nNews\nMicrosoft Unveils the First Topological Quantum Chip Majorana 1\n\n# Microsoft Unveils the First Topological Quantum Chip Majorana 1\n\nFeb 27, 2025\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\tmin read\n\nby\n\n- Steef-Jan Wiggers\n\n#### Write &amp; Win: InfoQ Contest\n\n- Win a conference ticket\n- Boost your profile\n- Help the community\n\n- Reading list\n\nMicrosoft recently introduced a quantum chip called Majorana 1 powered by a new Topological Core architecture. The company claims it’s the world's first Quantum Processing Unit (QPU).\n\nMajorana 1 leverages what the company calls breakthrough material that can observe and control Majorana particles to produce more reliable and scalable qubits, which are the building blocks for quantum computers. In a press release, the company states:\n\nIn the same way that the invention of semiconductors made today’s smartphones, computers, and electronics possible, topoconductors and the new type of chip they enable offer a path to developing quantum systems that can scale to a million qubits and are capable of tackling the most complex industrial and societal problems.\n\nThe topoconductor, or topological superconductor, creates a unique state of matter that enables the development of stable, fast, and controllable qubits without the trade-offs of existing alternatives. A new study in Nature details how Microsoft researchers created and accurately measured the properties of topological qubits, an essential advancement for practical computing.\n\nIn a Microsoft blog, Chetan Nayak, technical fellow and corporate vice president of Quantum Hardware, writes:\n\nOur measurement-based approach dramatically simplifies quantum error correction (QEC). We perform error correction entirely through measurements activated by simple digital pulses that connect and disconnect quantum dots from nanowires. This digital control makes managing the large numbers of qubits needed for real-world applications practical.\n\nHowever, some researchers are critical of the company’s choice to publicly announce the creation of a qubit without releasing detailed evidence. Georgios Katsaros, a physicist at the Institute of Science and Technology Austria in Klosterneuburg, comments in a Nature article:\n\nWithout seeing the extra data from the qubit operation, there is not much one can comment on.\n\nMicrosoft's top conductor comprises indium arsenide (a semiconductor), a material with unique properties currently utilized in applications such as infrared detectors, and aluminum (a superconductor). When cooled to near absolute zero and tuned with magnetic fields, topological superconducting nanowires with Majorana Zero Modes (MZMs) are formed at the wires’ ends. MZ",
    "chunk_order_index": 0,
    "full_doc_id": "doc-3e140d5183657d1c979dac572ba0ba30"
  },
  "chunk-21598916d54ace1290d10f0b5efeb0e6": {
    "tokens": 1189,
    "content": "comments in a Nature article:\n\nWithout seeing the extra data from the qubit operation, there is not much one can comment on.\n\nMicrosoft's top conductor comprises indium arsenide (a semiconductor), a material with unique properties currently utilized in applications such as infrared detectors, and aluminum (a superconductor). When cooled to near absolute zero and tuned with magnetic fields, topological superconducting nanowires with Majorana Zero Modes (MZMs) are formed at the wires’ ends. MZMs are the building blocks of Microsoft’s qubits.\n\n(Source: Microsoft Blog Post)\n\nBerci Mesko, a medical futurist, tweeted on X:\n\nHere is Microsoft's new quantum chip called Majorana 1 that could help realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.\n\nImagine the impact quantum computers could have on healthcare, especially in drug design and diagnostic decision-making. No, we cannot even imagine that. It would bring the impact of AI into a new dimension. I'm not overhyping the technology. This is the scale we have to keep in mind for quantum computing.\n\nLastly, the Defense Advanced Research Projects Agency (DARPA) has selected Microsoft as one of two finalists in its Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program, part of the broader Quantum Benchmarking Initiative (QBI), which aims to assess quantum systems capable of tackling challenges that classical computers cannot.\n\n## About the Author\n\n#### Steef-Jan Wiggers\n\n### Rate this Article\n\n#### This content is in the Cloud topic\n\n##### Related Topics:\n\n- Development\n- Architecture &amp; Design\n- DevOps\n- Microsoft\n- Microsoft Azure\n- Quantum Computing\n- Cloud\n\n- Related Editorial\n\n#### Related Editorial\n\n#### Related Sponsored Content\n\n- Popular across InfoQ\n\n#### Popular across InfoQ\n\n- Microsoft Unveils the First Topological Quantum Chip Majorana 1\n- Cloud Giants Collaborate on New Kubernetes Resource Management Tool\n- Java News Roundup: Stable Values, Spring Modulith, Open Liberty, Quarkus, JReleaser, Gradle\n- AWS CDK Introduces Garbage Collection to Remove Outdated Assets\n- GitHub Copilot Extensions Integrate IDEs with External Services\n- Resilience, Observability and Unintended Consequences of Automation\n\n<!-- image -->\n\n## Write Your Way to a QCon or InfoQ Dev Summit!\n\nJoin the InfoQ article competition to win a complimentary ticket to QCon or InfoQ Dev Summit! We're seeking in-depth technical articles written by software developers for software developers.\n\n<!-- image -->\n\n### Related Content\n\n### The InfoQ Newsletter\n\nA round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\n        \n\t\t\tView an example\n\nWe protect your privacy.\n\n- Development\n    - OpenSSF Publishes Security Baseline for Open-Source Projects\n    - Practical Benchmarking: How To Detect Performance Changes in Noisy Results\n    - A Zero Trust Future for Applications: Practical Implementation and Pitfalls\n- Architecture &amp; Design\n\n- If Architectural Experimentation Is So Great, Why Aren’t You Doing It?\n- How Monzo Bank Built a Cost-Effective, Unorthodox Backup System to Ensure Resilient Banking\n- Facilitating Software Architecture with Andrew Harmel-Law\n- Culture &amp; Methods\n\n- The (Not So) Hidden Social Drivers Behind the Highest Performing Engineering Teams\n- Investing in Open Source: The Open Source Pledge and Why it Matters\n- Using Artificial Intelligence for Analysis of Automated Testing Results\n- AI, ML &amp; Data Engineering\n\n- Google DeepMind Enhances AMIE for Long-Term Disease Management\n- Will instruclab.ai's Synthetic Data-Based LLM Fine-Tuning Make the Process More Accessible?\n- Mistral AI Introduces Saba: Regional Language Model for Arabic and South Indian Language\n- DevOps\n\n- How Engineering Teams Are Tackling AI, Platform Engineering &amp; DevEx: InfoQ Dev Summit Boston 2025\n- Cloud-Native Distributed Storage System CubeFS Graduates from CNCF\n- AWS CDK Introduces Garbage Collection to Remove Outdated Assets\n\n## The InfoQ Newsletter\n\nA round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\n\t\t\n\t\t\tView an example\n\n- Get a quick overview of content published on a variety of innovator and early adopter technologies\n- Learn what you don’t know that you don’t know\n- Stay up to date with the latest information from the topics you are interested in\n\nWe protect your privacy.\n\nConference: April 7-9, 2025Certification workshop: April 10, 2025\n            QCon London International Software Development Conference returns on April 7-10, 2025. Level-up on 15 major software and leadership topics including; The Tech of FinTech, AI &amp; ML in Software Engineering, Modern Data Architectures, Engineering Productivity, The Path to Senior Engineering Leadership, Supply Chain Security, and more.\n\nLearn the emerging trends. Explore the use cases. Implement the best practices.\nRegister Now\n\n#### Events\n\n- QCon London\n\nAPRIL 7-10, 2025\n- InfoQ Dev Summit Boston\n\nJune 9-10, 2025\n- InfoQ Dev Summit Munich\n\nOctober 15-16, 2025\n- QCon San Francisco\n\nNovember 17-21, 2025 / In-person\n- InfoQ Dev Summit New York\n\nDecember, 2025 / In-person\n\n#### Follow us on\n\n#### Stay in the know\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nInfoQ.com and all content copyright © 2006-2025 C4Media Inc.\n\n<!-- image -->",
    "chunk_order_index": 1,
    "full_doc_id": "doc-3e140d5183657d1c979dac572ba0ba30"
  },
  "chunk-784186b5d62bfb6e1e494cc3127739d8": {
    "tokens": 89,
    "content": "October 15-16, 2025\n- QCon San Francisco\n\nNovember 17-21, 2025 / In-person\n- InfoQ Dev Summit New York\n\nDecember, 2025 / In-person\n\n#### Follow us on\n\n#### Stay in the know\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nInfoQ.com and all content copyright © 2006-2025 C4Media Inc.\n\n<!-- image -->",
    "chunk_order_index": 2,
    "full_doc_id": "doc-3e140d5183657d1c979dac572ba0ba30"
  },
  "chunk-53b4243e5f65e85ffac697bdd38ba104": {
    "tokens": 1200,
    "content": "# Satya Nadella explains why Microsoft's quantum 'breakthrough' is so important\n\nSatya Nadella described Microsoft's new Majorana 1 chip as a \"breakthrough\" in the advancement of quantum computing.\n\n                                  Ethan Miller\n\n<!-- image -->\n\n- Microsoft unveiled Majorana 1, a quantum chip the company says is powered by a new state of matter.\n- The new chip allows for more stable, scalable, and simplified quantum computing, the company says.\n- A quantum expert told BI the development was \"just as revolutionary as the silicon transistor.\"\n\nMicrosoft on Wednesday unveiled Majorana 1, a quantum chip the company says is powered by a new state of matter.\n\nCEO Satya Nadella described it as a \"breakthrough\" in the advancement of quantum computing.\n\n\"Most of us grew up learning there are three main types of matter that matter: solid, liquid, and gas. Today, that changed,\" Nadella said in a post on X. \"After a nearly 20 year pursuit, we've created an entirely new state of matter, unlocked by a new class of materials, topoconductors, that enable a fundamental leap in computing. It powers Majorana 1, the first quantum processing unit built on a topological core. We believe this breakthrough will allow us to create a truly meaningful quantum computer not in decades, as some have predicted, but in years.\"\n\nQuantum computing is a rapidly evolving field of technology that combines the disciplines of computer science, math, and quantum mechanics to solve more complex calculations more quickly than is possible through classical computing. The foundation of quantum computing relies on units of information called qubits, rather than the binary bits used in classical computing.\n\nQubits exist in multiple states at once, like a spinning coin appearing to show both heads and tails simultaneously. They behave differently when observed and require specific conditions such as low light or extremely cold environments to replicate results reliably and without errors, which has made advancement in the field slow going.\n\nBut when they behave predictably at a large enough scale, qubits enable quantum computers to quickly calculate equations with multiple solutions and perform advanced computations that would be impossible for classical computers.\n\nResearchers in the field agree that computations solvable through quantum computing could help discover new drugs, promote sustainable food growth in harsh climates, and develop new chemical compounds that break down plastics or break our current encryption methods, among other outcomes.\n\nNadella has said he believes quantum will be a global game changer when used in conjunction with advancements in artificial intelligence.\n\nIn an appearance on the \"Dwarkesh Podcast,\" Nadella said quantum computing would be most useful for exploring how various compounds work in different states, like advancements in chemical physics and biology, rather than the data-heavy processing that AI is best at.\n\n\"The way I think of it is, if you have AI plus quantum, maybe you'll use quantum to generate synthetic data that then gets used by AI to train better models that know how to model something like chemistry or physics or what have you,\" Nadella said in the podcast. \"These two things will get used together.\"\n\nMicrosoft said in a press release that its topological superconductor is a new material that isn't solid, liquid, or gas, which the company fabricated atom by atom. Where many familiar electronic devices rely on the raw material silicon in their semiconductors, Microsoft said in peer-reviewed findings released in Nature that its topological superconductor was a path forward for quantum computing to produce more stable qubits.\n\nTroy Nelson, the chief technology officer at Lastwall, a cybersecurity provider of quantum resilient technology, told Business Insider that, since the behavior of quantum systems is often hard to prove because of the unstable nature of qubits, he'd like to see more real-world testing to confirm Microsoft's findings. He said, however, that he was \"more on the optimistic side of cautiously optimistic\" about the company's announcement.\n\n\"What they've done is they've created a new foundation that we can build off of,\" Nelson said. \"Now we need to solve the production problems like the economies of scale and bringing costs down. But I see what they produced here as a new road map.\"\n\nMicrosoft's new topological architecture was used to develop its Majorana 1 processor, offering what the company called in its press release \"a clear path to fit a million qubits on a single chip that can fit in the palm of one's hand.\"\n\nMicrosoft's Majorana 1 chip is the first quantum computing chip powered by topological qubits.\n                                \n                        \n                        \n                        Microsoft\n\n<!-- image -->\n\n\"This is a needed threshold for quantum computers to deliver transformative, real-world solutions — such as breaking down microplastics into harmless byproducts or inventing self-healing materials for construction, manufacturing or healthcare,\" Microsoft's press release reads. \"All the world's current computers operating together can't do what a one-million-qubit quantum computer will be able to do.\"\n\nNelson said Microsoft's topological breakthrough, if it can be replicated by other researchers in the field, would be a turning point that shortens the timeline for developing fully functional quantum computers to just years.\n\n\"If we really can print topoconductor to chips the size of your hand, that's just as revolutionary as the silicon transistor,\" Nelson said.\n\nMicrosoft's stock rose 1.25% on Wednesday following the announcement of its new quantum chip.\n\nWhile Microsoft's Majorana 1 chip doesn't mean commercially useful quantum computing is right around the corner, it's the latest in a series of significant advancements in the field that leads some researchers to believe more widespread, commercial adoption will come sooner than previously expected.\n\nIn December, Google unveiled Willow, its new quantum chip, which the company says can perform a standard benchmark computation in under five minutes — a task that would take the current fastest supercomputers 10 septillion years to complete; a timeframe that exceeds the age of the universe.\n\nBut not everyone is convinced. Quantum stocks tumbled in January after Nvidia CEO Jensen Huang suggested we were still 20 years away from",
    "chunk_order_index": 0,
    "full_doc_id": "doc-53e0762e95c7f501eac7b127b88fad2a"
  },
  "chunk-8fe362802f5390a8e14e10fce655c517": {
    "tokens": 315,
    "content": "that leads some researchers to believe more widespread, commercial adoption will come sooner than previously expected.\n\nIn December, Google unveiled Willow, its new quantum chip, which the company says can perform a standard benchmark computation in under five minutes — a task that would take the current fastest supercomputers 10 septillion years to complete; a timeframe that exceeds the age of the universe.\n\nBut not everyone is convinced. Quantum stocks tumbled in January after Nvidia CEO Jensen Huang suggested we were still 20 years away from the technology being \"very useful.\"\n\n## Read next\n\n- Microsoft\n\n### Recommended video\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- Terms of Service\n- Terms of Sale\n- Privacy Policy\n- Accessibility\n- Code of Ethics Policy\n- Reprints &amp; Permissions\n- Disclaimer\n- Advertising Policies\n- Conflict of Interest Policy\n- Commerce Policy\n- Coupons Privacy Policy\n- Coupons Terms\n- Your Privacy Choices\n\n- About Us\n- Careers\n- Advertise With Us\n- Contact Us\n- Company News\n- Masthead\n\n- Sitemap\n- Stock quotes by finanzen.net\n\n- AT\n- DE\n- ES\n- JP\n- NL\n- PL\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nJump to\n\n1. Main content\n2. Search\n3. Account",
    "chunk_order_index": 1,
    "full_doc_id": "doc-53e0762e95c7f501eac7b127b88fad2a"
  },
  "chunk-1fb79af17d6ee766a9c436bc55850303": {
    "tokens": 1200,
    "content": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript.\n\nAdvertisement\n\n<!-- image -->\n\n<!-- image -->\n\n- View all journals\n- Search\n- Log in\n\n- Explore content\n- About the journal\n- Publish with us\n- Subscribe\n\n- Sign up for alerts\n- RSS feed\n\n1. nature\n2. news\n3. article\n\n- NEWS\n- 19 February 2025\n\n# Microsoft claims quantum-computing breakthrough — but some physicists are sceptical\n\n- Davide Castelvecchi\n\n1. Davide Castelvecchi\n\nView author publications\n\nYou can also search for this author in PubMed\n Google Scholar\n\n- Twitter\n- Facebook\n- Email\n\nMicrosoft has unveiled its Majorana 1 quantum chip.Credit: John Brecher for Microsoft\n\n<!-- image -->\n\nMicrosoft has announced that it has created the first ‘topological qubits’ — a way of storing quantum information that the firm hopes will underpin a new generation of quantum computers. Machines based on topology are expected to be easier to build at scale than competing technologies, because they should better protect the information from noise. But some researchers are sceptical of the company’s claims.\n\nThe announcement came in a 19 February press release containing few technical details — but Microsoft says it has disclosed some of its data to selected specialists in a meeting at its research centre in Santa Barbara, California. “Would I bet my life that they’re seeing what they think they’re seeing? No, but it looks pretty good,” says Steven Simon, a theoretical physicist at the University of Oxford, UK, who was briefed on the results.\n\nAt the same time, the company published intermediate results — but not the proof of the existence of topological qubits — on 19 February in Nature1.\n\n## Superconducting wire\n\nTopological states are collective states of the electrons in a material that are resistant to noise, much like how two links in a chain can be shifted or rotated around each other while remaining connected.\n\nThe Nature paper describes experiments on a superconducting ‘nanowire’ device made of indium arsenide. The ultimate goal is to host two topological states called Majorana quasiparticles, one at each end of the device. Because electrons in a superconductor are paired, an extra, unpaired electron will be introduced, forming an excited state. This electron exists in a ‘delocalized’ state, which is shared between the two Majorana quasiparticles.\n\nEvidence of elusive Majorana particle dies — but computing hope lives on\n\nThe paper reports measurements suggesting that the nanowire does indeed harbour an extra electron. These tests “do not, by themselves” guarantee that the nanowire hosts two Majorana quasiparticles, the authors warn.\n\nAccording to the press release, the team has carried out follow-up experiments in which they paired two nanowires and put them in a superposition of two states — one with the extra electron in the first nanowire, and the other with the electron in the second nanowire. “We’ve built a qubit and shown that you can not only measure parity in two parallel wires, but a measurement that bridges the two wires,” says Microsoft researcher Chetan Nayak in Redmond, Washington.\n\n“There’s no slam dunk to know immediately from the experiment” that the qubits are made of topological states, says Simon. (A claim of having created Majorana states, made by a Microsoft-funded team based in Delft, the Netherlands, was retracted in 2021.) The ultimate proof will come if the devices perform as expected once they are scaled up, he adds.\n\n# Enjoying our latest content?\n\n                                    Login or create an account to continue\n\n- Access the most recent journalism from Nature's award-winning team\n- Explore the latest features &amp; opinion covering groundbreaking research\n\nor\n\n<!-- image -->\n\n<!-- image -->\n\nNature 638, 872 (2025)\n\ndoi: https://doi.org/10.1038/d41586-025-00527-z\n\n## References\n\n1. Microsoft Azure Quantum. Nature 638, 651–655 (2025).Article \n    PubMed \n    \n                    Google Scholar\n2. Aasen, D. et al. Preprint at arXiv https://doi.org/10.48550/arXiv.2502.12252 (2025).\n\nDownload references\n\nReprints and permissions\n\n## Related Articles\n\n- Evidence of elusive Majorana particle dies — but computing hope lives on\n- ‘A truly remarkable breakthrough’: Google’s new quantum chip achieves accuracy milestone\n- Quantum-computing technology that makes qubits from atoms wins mega investment\n- IBM releases first-ever 1,000-qubit quantum chip\n\n## Subjects\n\n- Quantum information\n- Quantum physics\n- Mathematics and computing\n\n## Latest on:\n\n<!-- image -->\n\nMicrosoft quantum computing 'breakthrough' faces fresh challenge\n\nNews 07 MAR 25\n\n<!-- image -->\n\nMultiplexed entanglement of multi-emitter quantum network nodes\n\nArticle 26 FEB 25\n\n<!-- image -->\n\nHardware-efficient quantum error correction via concatenated bosonic qubits\n\nArticle 26 FEB 25\n\n<!-- image -->\n\nMicrosoft quantum computing 'breakthrough' faces fresh challenge\n\nNews 07 MAR 25\n\n<!-- image -->\n\nQuantum technologies need big investments to deliver on their big promises\n\nWorld View 26 FEB 25\n\n<!-- image -->\n\nMultiplexed entanglement of multi-emitter quantum network nodes\n\nArticle 26 FEB 25\n\n<!-- image -->\n\nMicrosoft quantum computing 'breakthrough' faces fresh challenge\n\nNews 07 MAR 25\n\n<!-- image",
    "chunk_order_index": 0,
    "full_doc_id": "doc-28779e4286f7f95b722c5730ff7db4cd"
  },
  "chunk-27a6c9c304a65425b5a5056f5780abdb": {
    "tokens": 993,
    "content": "bits\n\nArticle 26 FEB 25\n\n<!-- image -->\n\nMicrosoft quantum computing 'breakthrough' faces fresh challenge\n\nNews 07 MAR 25\n\n<!-- image -->\n\nQuantum technologies need big investments to deliver on their big promises\n\nWorld View 26 FEB 25\n\n<!-- image -->\n\nMultiplexed entanglement of multi-emitter quantum network nodes\n\nArticle 26 FEB 25\n\n<!-- image -->\n\nMicrosoft quantum computing 'breakthrough' faces fresh challenge\n\nNews 07 MAR 25\n\n<!-- image -->\n\nAI tools are spotting errors in research papers: inside a growing movement\n\nNews 07 MAR 25\n\n<!-- image -->\n\nHow much energy will AI really consume? The good, the bad and the unknown\n\nNews Feature 05 MAR 25\n\n##\n\n### Jobs\n\n- Faculty Positions of Artificial Intelligence and Data Science in Medicine at CIMR, Beijing\n\nAt all ranks who focus on research in Artificial Intelligence, Data Science, and Machine Learning in Health Care and Medical Sciences.\nBeijing, China\nThe Chinese Institutes for Medical Research (CIMR), Beijing\n- Become an Assistant or Associate Research Professor (PSO) in Cellular, Molecular and Synaptic Neuros\n\nUniversité de Montréal’s Faculty of Medicine is one of the world’s leading French-language medical faculties. In both teaching and research, its mi...\nMontréal, Quebec (CA)\nUniversité de Montréal\n- Principal Scientist Neuroscience Group\n\nIPI is seeking a Principal Scientist to drive research at the intersection of molecular neuroscience and protein science.\nBoston, Massachusetts (US)\nInstitute for Protein Innovation\n- Cancer Immunology Postdoctoral Fellow\n\nTampa, Florida\nH. Lee Moffitt Cancer Center &amp; Research Institute\n- Postdoc in Cancer Data Science – Sottoriva Lab, Computational Biology Research Centre\n\nAPPLICATION CLOSING DATE: April 13th, 2025 The integration of Artificial Intelligence, mathematical modelling, and advanced computational simulati...\nMilan (IT)\nHuman Technopole\n\n## Related Articles\n\n- Evidence of elusive Majorana particle dies — but computing hope lives on\n- ‘A truly remarkable breakthrough’: Google’s new quantum chip achieves accuracy milestone\n- Quantum-computing technology that makes qubits from atoms wins mega investment\n- IBM releases first-ever 1,000-qubit quantum chip\n\n## Subjects\n\n- Quantum information\n- Quantum physics\n- Mathematics and computing\n\n<!-- image -->\n\n## Sign up to Nature Briefing\n\nAn essential round-up of science news, opinion and analysis, delivered to your inbox every weekday.\n\n<!-- image -->\n\nSign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily.\n\n## Explore content\n\n- Research articles\n- News\n- Opinion\n- Research Analysis\n- Careers\n- Books &amp; Culture\n- Podcasts\n- Videos\n- Current issue\n- Browse issues\n- Collections\n- Subjects\n\n- Follow us on Facebook\n- Follow us on Twitter\n- Subscribe\n- Sign up for alerts\n- RSS feed\n\n## About the journal\n\n- Journal Staff\n- About the Editors\n- Journal Information\n- Our publishing models\n- Editorial Values Statement\n- Journal Metrics\n- Awards\n- Contact\n- Editorial policies\n- History of Nature\n- Send a news tip\n\n## Publish with us\n\n- For Authors\n- For Referees\n- Language editing services\n- Submit manuscript\n\n## Search\n\n### Quick links\n\n- Explore articles by subject\n- Find a job\n- Guide to authors\n- Editorial policies\n\nNature (Nature)\n                \n\nISSN 1476-4687 (online)\n    \n\nISSN 0028-0836 (print)\n\n## nature.com sitemap\n\n### About Nature Portfolio\n\n- About us\n- Press releases\n- Press office\n- Contact us\n\n### Discover content\n\n- Journals A-Z\n- Articles by subject\n- protocols.io\n- Nature Index\n\n### Publishing policies\n\n- Nature portfolio policies\n- Open access\n\n### Author &amp; Researcher services\n\n- Reprints &amp; permissions\n- Research data\n- Language editing\n- Scientific editing\n- Nature Masterclasses\n- Research Solutions\n\n### Libraries &amp; institutions\n\n- Librarian service &amp; tools\n- Librarian portal\n- Open research\n- Recommend to library\n\n### Advertising &amp; partnerships\n\n- Advertising\n- Partnerships &amp; Services\n- Media kits\n- Branded\n                        content\n\n### Professional development\n\n- Nature Careers\n- Nature \n                        Conferences\n\n### Regional websites\n\n- Nature Africa\n- Nature China\n- Nature India\n- Nature Italy\n- Nature Japan\n- Nature Middle East\n\n- Privacy\n                Policy\n- Use\n                of cookies\n- Your privacy choices/Manage cookies\n- Legal\n                notice\n- Accessibility\n                statement\n- Terms &amp; Conditions\n- Your US state privacy rights\n\n<!-- image -->\n\n© 2025 Springer Nature Limited",
    "chunk_order_index": 1,
    "full_doc_id": "doc-28779e4286f7f95b722c5730ff7db4cd"
  },
  "chunk-6c1e82a09c0d9711fd7f1c7277167ab6": {
    "tokens": 1200,
    "content": "ByJohn Koetsier\n\n# Massive Microsoft Quantum Computer Breakthrough Uses New State Of Matter\n\nByJohn Koetsier\n\n, Senior Contributor.\n\nMicrosoft's new Majorana 1 quantum computing chipJohn Brecher\n\n<!-- image -->\n\nMicrosoft announced Wednesday that it has invented an entirely new kind of quantum computer. Its new quantum chip, Majorana 1, is a quantum processor analogous to transistors in classical computers’ semiconductor chips and offers a path to million-qubit systems in a single relatively small quantum computing fridge. That would enable the creation of a single quantum computer which would be more powerful than all classical computers on the planet. It would be incredibly useful for things like designing new battery substrates, inventing new drugs, simulating nuclear fusion reactors, inventing post-quantum cryptography methods, and much more. \n\n Intriguingly, Microsoft essentially created a new state of matter--not liquid, solid, gas, or plasma, but a topological superconductor--to make this happen.\n\nThe Majorana 1 takes its name from the Majorana zero mode, a tiny and mysterious form of matter that is a quasiparticle which acts like half of an electron and, unlike matter and antimatter, is its own antiparticle. (Imagine a pair of shoes: a Majorana zero mode is like a left and right shoe simultaneously.) Microsoft uses Majorana zero modes because they can store quantum information in a way that’s resistant to errors.\n\nMicrosoft believes that this development, a long 19 years in the making, will enable the construction of commercially usable and viable quantum computers within five years.\n\n“We’ll have a fault tolerant quantum computer, a real fault tolerant quantum computer in years, not decades,” says Dr. Chetan Nayak, who runs the quantum hardware program at Microsoft and has been working on this problem for almost two decades. “And once we have that, that’s the thing we’re going to build on to get out to utility scale.”\n\nMicrosoft has already built an eight-qubit proof of concept, which it has submitted to the Defense Advanced Research Projects Agency and has resulted in the company’s inclusion in DARPA’s final phase of the Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program.\n\n### Netflix’s Best New Show Nabs A Perfect 100% Critic Score, 94% Audience\n\n### 26 Million Devices Hit By Infostealers—Bank Cards Leaked To Dark Web\n\n### ‘Severance’ Season 2, Episode 8 Recap And Review: I’m Not Sure How I Feel About This One\n\nThere’s a lot to break down in Microsoft’s announcement. Essentially, Dr. Nayak told me in a TechFirst podcast, it relies on four key breakthroughs:\n\n1. An entirely new state of matter: a topological superconductor\n2. A means of measuring quantum states non-destructively\n3. A way to load data into these qubits\n4. A way to make multi-qubit structures\n\nSuperconductivity is a state of matter, Nayak says, as much as liquid, gas, solid or plasma. Topological superconductors, which Microsoft doesn’t believe occur naturally in the universe, are composed of a materials stack including indium arsenide, aluminum and other materials, most of which Microsoft fabricated atom by atom.\n\nThe elements for the topological superconductor are then cooled to 50 millikelvins. That’s colder than outer space: -273.15 degrees Celsius or -459.58 degrees Fahrenheit.\n\nThe special thing about topological superconductors is that they are perfectly fine with possessing uneven numbers of electrons, unlike any other kind of superconductor. Microsoft found a way to “hide” these odd-man-out single electrons on nano-scale wires forming Majorana zero modes. Essentially, instead of storing quantum information in a single particle, a Majorana-based qubit has two of these tiny wires and four Majorana zero modes. And that odd-man-out extra electron forms the basis for quantum computations.\n\nThen Microsoft found a way to non-destructively measure the existence of this single electron in microseconds, and change the orientation of the Majorana zero modes. That enables storing data in these topological superconductor qubits and reading it. The good news is that these quantum states are relatively long-lived, for quantum events, lasting whole milliseconds: a long time at the quantum scale. Microsoft can measure them in microseconds using a quantum dot--a nanometer-sized piece of semiconductor material that can trap and control electrons--resulting in an essentially stable element of a quantum computing “chip.”\n\nCritical to Microsoft’s goals, however, was to make a relatively small quantum processing chip.\n\n“If you don’t have a fairly small quantum processing chip, then you are not going to put it in a single fridge,” says Nayak. “You are necessarily networking multiple fridges and then you’re not only solving the problem of building a quantum processor at scale, you’re also have to solving the quantum networking challenge … so you have to solve two super difficult problems.”\n\nThe easier solution, Microsoft says, was to build a qubit processor that is relatively small enough to fit a million qubits in a single fridge-sized quantum computer.\n\n“If a single million qubit quantum computer is an entire data center, it’s some huge machine networked between multiple fridges,\" Nayak says. \"And then you need a thousand of those data centers, then it looks really hard, right?”\n\nUltimately, that’s what Nayak sees: the need to have at least 1,000 of these million-qubit quantum computers. The massive breakthrough now is that Microsoft actually sees a path to manufacturability of these topological superconductor quantum computers.\n\nBut it’s been a long time coming.\n\nIn fact, this is the single longest-running R&amp;D program in Microsoft’s history: 19 and a half years over multiple CEOs, multiple chains",
    "chunk_order_index": 0,
    "full_doc_id": "doc-25433c85399963a8366d7a29c8e368d5"
  },
  "chunk-130f1d871019d4f3d38e39d3e6649279": {
    "tokens": 490,
    "content": "then it looks really hard, right?”\n\nUltimately, that’s what Nayak sees: the need to have at least 1,000 of these million-qubit quantum computers. The massive breakthrough now is that Microsoft actually sees a path to manufacturability of these topological superconductor quantum computers.\n\nBut it’s been a long time coming.\n\nIn fact, this is the single longest-running R&amp;D program in Microsoft’s history: 19 and a half years over multiple CEOs, multiple chains of command and multiple bosses since Nayak joined to work on this problem in 2005. Over 160 researchers, scientists and engineers have their names on the paper that Microsoft has published on this new type of qubit, and Nayak says that’s not just due to politeness.\n\nThe challenge scope was immense. Just like scientists and engineers had to invent transistors for the computers of the mid-20th century, Microsoft believed it needed to invent essentially quantum transistors for a scalable quantum computer.\n\n“Whatever you’re doing in the quantum space needs to have a path to a million qubits. If it doesn’t, you’re going to hit a wall before you get to the scale at which you can solve the really important problems that motivate us,” Nayak said. “We have actually worked out a path to a million.”\n\nInterestingly, Microsoft’s this-decade timeline aligns with several other quantum competitors’ timelines for usable quantum computers.\n\n“We are focusing on quantum simulations, optimization, and quantum machine learning to achieve quantum advantage from 2027,” says Jan Goetz, CEO and co-founder at IQM Quantum Computers.\n\nAnd Dr. Chris Ballance, co-founder and CEO of Oxford Ionics, thinks he’ll have 200-qubit systems in customers’ hands within the next two years.\n\nA million qubits however: that’s another matter, indeed.\n\n\"All the world’s current computers operating together can’t do what a one-\n\n million-qubit quantum computer will be able to do,\" Microsoft said in its press release announcing the innovation.\n\n- AdChoices\n- Privacy Statement\n- Do Not Sell or Share My Personal Information\n- Limit the Use of My Sensitive Personal Information\n- Privacy Preferences\n- Digital Terms of Sale\n- Terms of Service\n- Contact Us\n- Send Us Feedback\n- Report a Security Issue\n- Jobs At Forbes\n- Reprints &amp; Permissions\n- Forbes Press Room\n- Advertise",
    "chunk_order_index": 1,
    "full_doc_id": "doc-25433c85399963a8366d7a29c8e368d5"
  },
  "chunk-051c05b009504d582a5da615135f1516": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n<!-- image -->\n\n- Pre-Markets\n- U.S. Markets\n- Currencies\n- Cryptocurrency\n- Futures &amp; Commodities\n- Bonds\n- Funds &amp; ETFs\n\n- Economy\n- Finance\n- Health &amp; Science\n- Media\n- Real Estate\n- Energy\n- Climate\n- Transportation\n- Industrials\n- Retail\n- Wealth\n- Sports\n- Life\n- Small Business\n\n- Personal Finance\n- Fintech\n- Financial Advisors\n- Options Action\n- ETF Street\n- Buffett Archive\n- Earnings\n- Trader Talk\n\n- Cybersecurity\n- AI\n- Enterprise\n- Internet\n- Media\n- Mobile\n- Social Media\n- CNBC Disruptor 50\n- Tech Guide\n\n- White House\n- Policy\n- Defense\n- Congress\n- Equity and Opportunity\n\n- Latest Video\n- Full Episodes\n- Livestream\n- Live Audio\n- Live TV Schedule\n- CNBC Podcasts\n- CEO Interviews\n- CNBC Documentaries\n- Digital Originals\n\n- Trust Portfolio\n- Analysis\n- Trade Alerts\n- Meeting Videos\n- Homestretch\n- Jim's Columns\n- Education\n- Subscribe\n- Sign In\n\n<!-- image -->\n\n- Pro News\n- My PortfolioNEW!\n- Livestream\n- Full Episodes\n- Stock Screener\n- Market Forecast\n- Options Investing\n- Chart Investing\n- Subscribe\n- Sign In\n\n<!-- image -->\n\n- Make It\n- select\n    - ALL SELECT\n    - Credit Cards\n    - Loans\n    - Banking\n    - Mortgages\n    - Insurance\n    - Credit Monitoring\n    - Personal Finance\n    - Small Business\n    - Taxes\n    - Help for Low Credit Scores\n    - Investing\n    - SELECT\n    - All Credit Cards\n    - Find the Credit Card for You\n    - Best Credit Cards\n    - Best Rewards Credit Cards\n    - Best Travel Credit Cards\n    - Best 0% APR Credit Cards\n    - Best Balance Transfer Credit Cards\n    - Best Cash Back Credit Cards\n    - Best Credit Card Welcome Bonuses\n    - Best Credit Cards to Build Credit\n    - SELECT\n    - All Loans\n    - Find the Best Personal Loan for You\n    - Best Personal Loans\n    - Best Debt Consolidation Loans\n    - Best Loans to Refinance Credit Card Debt\n    - Best Loans with Fast Funding\n    - Best Small Personal Loans\n    - Best Large Personal Loans\n    - Best Personal Loans to Apply Online\n    - Best Student Loan Refinance\n    - SELECT\n    - All Banking\n    - Find the Savings Account for You\n    - Best High Yield Savings Accounts\n    - Best Big Bank Savings Accounts\n    - Best Big Bank Checking Accounts\n    - Best No Fee Checking Accounts\n    - No Overdraft Fee Checking Accounts\n    - Best Checking Account Bonuses\n    - Best Money Market Accounts\n    - Best CDs\n    - Best Credit Unions\n    - SELECT\n    - All Mortgages\n    - Best Mortgages\n    - Best Mortgages for Small Down Payment\n    - Best Mortgages for No Down Payment\n    - Best Mortgages with No Origination Fee\n    - Best Mortgages for Average Credit Score\n    - Adjustable Rate Mortgages\n    - Affording a Mortgage\n    - SELECT\n    - All Insurance\n    - Best Life Insurance\n    - Best Homeowners Insurance\n    - Best Renters Insurance\n    - Best Car Insurance\n    - Travel Insurance\n    - SELECT\n    - All Credit Monitoring\n    - Best Credit Monitoring Services\n    - Best Identity Theft Protection\n    - How to Boost Your Credit Score\n    - Credit Repair Services\n    - SELECT\n    - All Personal Finance\n    - Best Budgeting Apps\n    - Best Expense Tracker Apps\n    - Best Money Transfer Apps\n    - Best Resale Apps and Sites\n    - Buy Now Pay Later (BNPL) Apps\n    - Best Debt Relief\n    - SELECT\n    - All Small Business\n    - Best Small Business Savings Accounts\n    - Best Small Business Checking Accounts\n    - Best Credit Cards for Small Business\n    - Best Small Business Loans\n    - Best Tax Software for Small Business\n    - SELECT\n    - All Taxes\n    - Filing For Free\n    - Best Tax Software\n    - Best Tax Software for Small Businesses\n    - Tax Refunds\n    - Tax Brackets\n    - Tax Tips\n    - Tax By State\n    - Tax Payment Plans\n    - SELECT\n    - All Help for Low Credit Scores\n    - Best Credit Cards for Bad Credit\n    - Best Personal Loans for Bad Credit\n    - Best Debt Consolidation Loans for Bad Credit\n    - Personal Loans if You Don't Have Credit\n    - Best Credit Cards for Building Credit\n    - Personal Loans for 580 Credit Score or Lower\n    - Personal Loans for 670 Credit Score or Lower\n    - Best Mortgages for Bad Credit\n    - Best Hardship Loans\n    - How to Boost Your Credit Score\n    - SELECT\n    - All Investing\n    - Best IRA Accounts\n    - Best Roth IRA Accounts\n    - Best Investing Apps\n    - Best Free Stock Trading Platforms\n    - Best Robo-Advisors\n    - Index Funds\n    - Mutual Funds\n    - ETFs\n    - Bonds\n\n- USA\n- INTL\n\n- Livestream\n\n- Livestream\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n# Microsoft deploys new state of matter in its first quantum computing chip\n\n<!-- image -->\n\n- Microsoft's Majorana 1 chip includes eight topological quantum bits.\n- Microsoft claims that building its first quantum-computing chip required that it create a new state of matter, which it is referring to as a topological state.\n- Majorana 1 won't be available through Microsoft's Azure",
    "chunk_order_index": 0,
    "full_doc_id": "doc-c30bc9e427ce4cd49cc43e0c3da68723"
  },
  "chunk-3f8188f2b1efeb6f35d7fa31c9b51c4a": {
    "tokens": 1187,
    "content": "- USA\n- INTL\n\n- Livestream\n\n- Livestream\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n# Microsoft deploys new state of matter in its first quantum computing chip\n\n<!-- image -->\n\n- Microsoft's Majorana 1 chip includes eight topological quantum bits.\n- Microsoft claims that building its first quantum-computing chip required that it create a new state of matter, which it is referring to as a topological state.\n- Majorana 1 won't be available through Microsoft's Azure cloud, but it opens the door to future models with greater capacity that likely will be, an executive told CNBC.\n\nIn this article\n\n- MSFT\n\nMicrosoft on Wednesday announced Majorana 1, its first quantum computing chip.\n\nThe achievement comes after the company spent nearly two decades of research in the field, but Microsoft claims that building Majorana 1 required that it create an entirely new state of matter, which it is referring to as a topological state.\n\nMicrosoft's quantum chip employs eight topological qubits using indium arsenide, which is a semiconductor, and aluminum, which is a superconductor.\n\n\"The difficulty of developing the right materials to create the exotic particles and their associated topological state of matter is why most quantum efforts have focused on other kinds of qubits,\" the company said in a blog Wednesday.\n\nUnderstanding topological matter and getting it to work in building a quantum-computing chip required that Microsoft spray atom by atom to get the materials to line up perfectly, the company wrote in the blog.\n\n\"Ironically, it's also why we need a quantum computer — because understanding these materials is incredibly hard,\" said Krysta Svore, Microsoft technical fellow, in the blog. \"With a scaled quantum computer, we will be able to predict materials with even better properties for building the next generation of quantum computers beyond scale.\"\n\nA new paper in the journal Nature describes the chip in detail.\n\nTechnologists believe quantum computers could one day efficiently solve problems that would be taxing if not impossible for classical computers. Today's computers use bits that can be either on or off while quantum computers employ quantum bits, or qubits, that can operate in both states simultaneously.\n\nGoogle and IBM have also developed quantum processors, as have smaller companies IonQ and Rigetti Computing.\n\nMicrosoft won't be allowing clients to use its Majorana 1 chip through the company's Azure public cloud, as it plans to do with its custom artificial intelligence chip, Maia 100. Instead, Majorana 1 is a step toward a goal of a million qubits on a chip, following extensive physics research.\n\nRather than rely on Taiwan Semiconductor or another company for fabrication, Microsoft is manufacturing the components of Majorana 1 itself in the U.S. That's possible because the work is unfolding at a small scale.\n\n\"We want to get to a few hundred qubits before we start talking about commercial reliability,\" Jason Zander, a Microsoft executive vice president, told CNBC.\n\nIn the meantime, the company will engage with national laboratories and universities on research using Majorana 1.\n\nDespite the focus on research, investors are fascinated by quantum.\n\nIonQ shares went up 237% in 2024, and Rigetti gained nearly 1,500%. The two generated a combined $14.8 million in third-quarter revenue. Further gains came in January, after Microsoft issued a blog post declaring that 2025 is \"the year to become quantum-ready.\"\n\nMicrosoft's Azure Quantum cloud service, which lets developers experiment with programs and algorithms, offers access to chips from IonQ and Rigetti. It's possible that a Microsoft quantum chip might become available through Azure before 2030, Zander said.\n\n\"There's a lot of speculation that we're decades off from this,\" he said. \"We believe it's more like years.\"\n\nRather than exist as a stand-alone category, quantum computing might end up boosting other parts of Microsoft. For example, there's Microsoft's AI business, which has an annualized revenue run rate that exceeds $13 billion. Quantum computers could be used to build data used to train AI models, Zander said.\n\n\"Now you can ask it to invent some new molecule, invent some new drug, something that really would have been impossible to do before,\" Zander said.\n\n## Don’t miss these insights from CNBC PRO\n\n- Why Tesla's stock is unraveling and what happens next, according to Barclays\n- How to produce income from Nvidia while waiting for a rebound\n- Hedge funds are buying more of these 'rising star' stocks, according to Goldman\n- These S&amp;P 500 stocks are deeply oversold and may be due for a rebound\n\nWATCH: Quantum computing comes into focus\n\n<!-- image -->\n\n<!-- image -->\n\n- \n- \n- \n- \n- \n- \n- \n\n- Subscribe to CNBC PRO\n- Subscribe to Investing Club\n- Licensing &amp; Reprints\n- CNBC Councils\n- Select Personal Finance\n- CNBC on Peacock\n- Join the CNBC Panel\n- Supply Chain Values\n- Select Shopping\n- Closed Captioning\n- Digital Products\n- News Releases\n- Internships\n- Corrections\n- About CNBC\n- Ad Choices\n- Site Map\n- Podcasts\n- Careers\n- Help\n- Contact\n\n- News TipsGot a confidential news tip? We want to hear from you.Get In Touch\n- CNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\n- Advertise With UsPlease Contact Us\n\n- Privacy Policy\n- \n- CA Notice\n- Terms of Service\n\n© 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal\n\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n\nData also provided by",
    "chunk_order_index": 1,
    "full_doc_id": "doc-c30bc9e427ce4cd49cc43e0c3da68723"
  },
  "chunk-a65252df0032c8fdb719baa4f447fac3": {
    "tokens": 87,
    "content": "info about our products and services.\n- Advertise With UsPlease Contact Us\n\n- Privacy Policy\n- \n- CA Notice\n- Terms of Service\n\n© 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal\n\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n\nData also provided by",
    "chunk_order_index": 2,
    "full_doc_id": "doc-c30bc9e427ce4cd49cc43e0c3da68723"
  },
  "chunk-55d08f677a08d1b21820dd78c6acbbbd": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Science\n    - Archaeology\n    - Ask Us Anything\n    - Biology\n    - Dinosaurs\n    - Physics\n    - Popular Science Videos\n    - Space\n    - The Weirdest Thing I Learned This Week\n- Technology\n\n- AI\n- Aviation\n- Best of What’s New\n- Engineering\n- Internet\n- Military\n- Robots\n- Security\n- Vehicles\n- Photography\n- Environment\n\n- Agriculture\n- Animals\n- Climate Change\n- Conservation\n- Energy\n- Sustainability\n- Weather\n- DIY\n\n- Life Skills\n- Projects\n- Tech Hacks\n- Gear\n\n- Audio\n- Cameras\n- Computers\n- Fitness Gear\n- Gaming\n- Gift Guides\n- Home\n- Home Theater\n- Outdoor Gear\n- Phones\n- Tablets\n- Wearables\n- More\n\n- Newsletter\n- Cover Art\n- Store\n- Podcasts\n- Video\n- Popsci+\n- FIND US ON\n\n- Social\n    - Facebook\n    - Twitter\n    - LinkedIn\n    - Instagram\n    - Pinterest\n    - Youtube\n- Flipboard\n- Apple News+\n- RSS\n\n<!-- image -->\n\n- Science\n    - Archaeology\n    - Ask Us Anything\n    - Biology\n    - Dinosaurs\n    - Physics\n    - Popular Science Videos\n    - Space\n    - The Weirdest Thing I Learned This Week\n- Technology\n\n- AI\n- Aviation\n- Best of What’s New\n- Engineering\n- Internet\n- Military\n- Robots\n- Security\n- Vehicles\n- Photography\n- Environment\n\n- Agriculture\n- Animals\n- Climate Change\n- Conservation\n- Energy\n- Sustainability\n- Weather\n- DIY\n\n- Life Skills\n- Projects\n- Tech Hacks\n- Gear\n\n- Audio\n- Cameras\n- Computers\n- Fitness Gear\n- Gaming\n- Gift Guides\n- Home\n- Home Theater\n- Outdoor Gear\n- Phones\n- Tablets\n- Wearables\n- MERCH\n\n- Cover Art\n- Store\n- Newsletter\n\n- \n- \n- \n- \n- \n\n# New state of matter powers Microsoft quantum computing chip\n\nBy Andrew Paul\n\nPosted on Feb 20, 2025\n\nMajorana 1 is designed to ultimately store 1 million qubits. Credit: Microsoft\n\n<!-- image -->\n\n## Share\n\n- \n- \n- \n- \n\nMicrosoft says its researchers have created a new quantum computer processor that relies on a never-before-seen state of matter. The technological leap—called Majorana 1—represents a major step forward towards an era of powerful quantum computers that unlock currently unachievable advancements across artificial intelligence, medical research, sustainable energy, and many other industries.\n\nSince their invention, traditional computers have almost always relied on semiconductor chips that use binary “bits” of information represented as strings of 1’s and 0’s. While these chips have become increasingly powerful and simultaneously smaller, there is a physical limit to the amount of information that can be stored on this hardware. Quantum computers, by comparison, utilize “qubits” (quantum bits) to exploit the strange properties exhibited by subatomic particles, often at extremely cold temperatures.\n\nTwo qubits can hold four values at any given time, with more qubits translating to an exponential increase in calculating capabilities. This allows a quantum computer to process information at speeds and scales that make today’s supercomputers seem almost antiquated. Last December, for example, Google unveiled an experimental quantum computer system that researchers say takes just five minutes to finish a calculation that would take most supercomputers over 10 septillion years to complete—longer than the age of the universe as we understand it.\n\nBut Google’s Quantum Processing Unit (QPU) is based on different technology than Microsoft’s Majorana 1 design, detailed in a paper published on February 19 in the journal Nature. The result of over 17 years of design and research, Majorana 1 relies on what the company calls “topological qubits” through the creation of topological superconductivity, a state of matter previously conceptualized but never documented.\n\n## Get the Popular Science newsletter\n\nBreakthroughs, discoveries, and DIY tips sent every weekday.\n\nBy signing up you agree to our Terms of Service and Privacy Policy.\n\nInstead of a traditional computer’s reliance on electrons, Majorana 1 works on the “world’s first topoconductor,” using the Majorana particle first described in 1937 by theoretical physicist Ettore Majorana. According to Microsoft, the machine is based on “gate-defined devices” combining the semiconductor indium arsenide with aluminum, a superconductor. Once the topoconductor’s temperature is lowered to near absolute zero (about -400 degrees Fahrenheit) and tuned to magnetic fields, the devices “form topological superconducting nanowires with Majorana Zero Modes (MZMs) at the wires’ ends.”\n\nMajorana 1 is reportedly more reliable than competitor Quantum Processing Unit  designs, but it still exhibits a problem that plagues all experimental quantum computing chips. Just as it’s illustrated in quantum particle physics, qubits may be able to hold two states of information at the same time,but when human operators attempt to read them, the information “decoheres” into a basic 1 or 0. Microsoft researchers, however, are pinning their hopes that further fine-tuning will yield more reliable and scalable topoconductors that ultimately form the basis of the first true quantum computers. Majorana 1 currently holds just eight qubits, which doesn’t set it apart from existing QPU prototypes. But it’s built to house many more: 1 million qubits, to be more exact.\n\n“A million-qubit quantum computer isn’t just a milestone—it’s a gateway to solving some of the world’s most difficult problems,” Chetan Nayak, Microsoft’s Technical Fellow",
    "chunk_order_index": 0,
    "full_doc_id": "doc-8dd2e87c9d7337d988f1b8fff4f0039f"
  },
  "chunk-5bc024bc214b5779df69ccae794ee6ea": {
    "tokens": 1070,
    "content": "yield more reliable and scalable topoconductors that ultimately form the basis of the first true quantum computers. Majorana 1 currently holds just eight qubits, which doesn’t set it apart from existing QPU prototypes. But it’s built to house many more: 1 million qubits, to be more exact.\n\n“A million-qubit quantum computer isn’t just a milestone—it’s a gateway to solving some of the world’s most difficult problems,” Chetan Nayak, Microsoft’s Technical Fellow and Corporate Vice President of Quantum Hardware, said on Wednesday.\n\n<!-- image -->\n\n### More deals, reviews, and buying guides\n\n<!-- image -->\n\n## Andrew Paul\n\n### Staff Writer\n\nAndrew Paul is Popular Science’s staff writer covering tech news.\n\n- \n\n- Particle Physics\n- Physics\n- Science\n\n## Latest\n\n<!-- image -->\n\n### Scientists pinpoint age of suspected human-Neanderthal hybrid child\t\t\t\t\nScientists pinpoint age of suspected human-Neanderthal hybrid child\n\nBy Andrew Paul\n\n<!-- image -->\n\n### Robot-driven Maserati MC20 sets new world speed record\t\t\t\t\nRobot-driven Maserati MC20 sets new world speed record\n\nBy Kristin Shaw\n\n## More in Engineering\n\n<!-- image -->\n\n### Microsoft sets its sights on a quantum supercomputer\t\t\t\t\nMicrosoft sets its sights on a quantum supercomputer\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Peek inside the lab working on quantum memories\t\t\t\t\nPeek inside the lab working on quantum memories\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Quantum computers can’t teleport things—yet\t\t\t\t\nQuantum computers can’t teleport things—yet\n\nBy Rahul Rao\n\n<!-- image -->\n\n### This lens is just three atoms thick and works like a quantum lighthouse\t\t\t\t\nThis lens is just three atoms thick and works like a quantum lighthouse\n\nBy Andrew Paul\n\n<!-- image -->\n\n### How neutral atoms could help power next-gen quantum computers\t\t\t\t\nHow neutral atoms could help power next-gen quantum computers\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Quantum computers are starting to become more useful\t\t\t\t\nQuantum computers are starting to become more useful\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### How a quantum computer tackles a surprisingly difficult airport problem\t\t\t\t\nHow a quantum computer tackles a surprisingly difficult airport problem\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### How Google plans to fix quantum computing’s accuracy problem\t\t\t\t\nHow Google plans to fix quantum computing’s accuracy problem\n\nBy Harry Guinness\n\n## More in Technology\n\n<!-- image -->\n\n### This record-breaking X-ray laser is ready to unlock quantum secrets\t\t\t\t\nThis record-breaking X-ray laser is ready to unlock quantum secrets\n\nBy Andrew Paul\n\n<!-- image -->\n\n### Get ready for Aptos, Microsoft’s new default font\t\t\t\t\nGet ready for Aptos, Microsoft’s new default font\n\nBy Andrew Paul\n\n<!-- image -->\n\n### In photos: Journey to the center of a quantum computer\t\t\t\t\nIn photos: Journey to the center of a quantum computer\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Fujitsu’s quantum computers could beat rival machines to the market\t\t\t\t\nFujitsu’s quantum computers could beat rival machines to the market\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Ford used a quantum computer to explore EV battery materials\t\t\t\t\nFord used a quantum computer to explore EV battery materials\n\nBy Harry Guinness\n\n<!-- image -->\n\n### Microsoft wants small nuclear reactors to power its AI and cloud computing services\t\t\t\t\nMicrosoft wants small nuclear reactors to power its AI and cloud computing services\n\nBy Andrew Paul\n\n<!-- image -->\n\n### We have quantum computers—now Amazon and Harvard want a quantum internet\t\t\t\t\nWe have quantum computers—now Amazon and Harvard want a quantum internet\n\nBy Charlotte Hu\n\n<!-- image -->\n\n### Scientists modeled a tiny wormhole on a quantum computer\t\t\t\t\nScientists modeled a tiny wormhole on a quantum computer\n\nBy Charlotte Hu\n\n<!-- image -->\n\n## Like science, tech, and DIY projects?\n\nBreakthroughs, discoveries, and DIY tips sent every weekday.\n\nBy signing up you agree to our Terms of Service and Privacy Policy.\n\n- Science\n\n## Science\n\n- Archaeology\n- Ask Us Anything\n- Biology\n- Dinosaurs\n- Physics\n- Popular Science Videos\n- Space\n- The Weirdest Thing I Learned This Week\n- Technology\n\n## Technology\n\n- AI\n- Aviation\n- Best of What’s New\n- Engineering\n- Internet\n- Military\n- Robots\n- Security\n- Photography\n- Environment\n\n## Environment\n\n- Agriculture\n- Animals\n- Climate Change\n- Conservation\n- Energy\n- Sustainability\n- Weather\n- DIY\n\n## DIY\n\n- Life Skills\n- Projects\n- Tech Hacks\n- Gear\n\n## Gear\n\n- Audio\n- Cameras\n- Computers\n- Fitness Gear\n- Gaming\n- Gift Guides\n- Home\n- Home Theater\n- Outdoor Gear\n- Phones\n- Tablets\n- Wearables\n- More\n\n## More\n\n- Editorial Standards\n- How We Test And Review Products\n- About Us\n- Contact Us\n- PopSci Merch\n- PopSci Shop\n- PopSci+\n- Privacy Policy\n- Terms &amp; Conditions\n- Affiliate Disclosure\n- Sitemap\n- DepositPhotos\n\n## FOLLOW US\n\n- \n- \n- \n- \n- \n\n### DISCLAIMER(S)\n\nArticles may contain affiliate links which enable us to share in the revenue of any purchases made.\n\nRegistration on or use of this site constitutes acceptance of our Terms of Service.\n\n© 2025 Recurrent. All rights reserved.",
    "chunk_order_index": 1,
    "full_doc_id": "doc-8dd2e87c9d7337d988f1b8fff4f0039f"
  },
  "chunk-e4d2098f96c4f9169492f64798961064": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- News\n    - Capital Markets\n    - National\n    - Quantum Computing Business\n    - Research\n- Resources\n\n- Education\n- Featured\n- Insights\n- Interviews\n- Media\n- Reports\n- Women In Quantum\n- Product\n- Advisory\n- About Us\n\n- News\n    - Capital Markets\n    - National\n    - Quantum Computing Business\n    - Research\n- Resources\n\n- Education\n- Featured\n- Insights\n- Interviews\n- Media\n- Reports\n- Women In Quantum\n- Product\n- Advisory\n- About Us\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n- News\n    - Quantum Computing Business\n    - National\n    - Capital Markets\n- Exclusives\n\n- Insights\n- Education\n- Interviews\n- Media\n- Intro to quantum\n- Advisory\n- About Us\n- Marketing\n- Q-munity\n\n- News\n    - Quantum Computing Business\n    - National\n    - Capital Markets\n- Exclusives\n\n- Insights\n- Education\n- Interviews\n- Media\n- Intro to quantum\n- Advisory\n- About Us\n- Marketing\n- Q-munity\n\n- Contact Us\n\n# Microsoft’s Majorana 1 Chip Carves New Path for Quantum Computing\n\n- Quantum Computing Business, Research\n\n- Resonance\n- February 19, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\nBy Catherine Bolgar\n\nMicrosoft today introduced Majorana 1, the world’s first quantum chip powered by a new Topological Core architecture that it expects will realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.\n\nIt leverages the world’s first topoconductor, a breakthrough type of material that can observe and control Majorana particles to produce more reliable and scalable qubits, which are the building blocks for quantum computers.\n\nIn the same way that the invention of semiconductors made today’s smartphones, computers, and electronics possible, topoconductors and the new type of chip they enable offer a path to developing quantum systems that can scale to a million qubits and are capable of tackling the most complex industrial and societal problems, Microsoft said.\n\n<!-- image -->\n\n<!-- image -->\n\n“We took a step back and said ‘Ok, let’s invent the transistor for the quantum age. What properties does it need to have?’” said Chetan Nayak, Microsoft technical fellow. “And that’s really how we got here – it’s the particular combination, the quality and the important details in our new materials stack that have enabled a new kind of qubit and ultimately our entire architecture.”\n\nThis new architecture used to develop the Majorana 1 processor offers a clear path to fit a million qubits on a single chip that can fit in the palm of one’s hand, Microsoft said. This is a needed threshold for quantum computers to deliver transformative, real-world solutions – such as breaking down microplastics into harmless byproducts or inventing self-healing materials for construction, manufacturing, or healthcare. All the world’s current computers operating together can’t do what a one-million-qubit quantum computer will be able to do.\n\n“Whatever you’re doing in the quantum space needs to have a path to a million qubits. If it doesn’t, you’re going to hit a wall before you get to the scale at which you can solve the really important problems that motivate us,” Nayak said. “We have actually worked out a path to a million.”\n\nThe topoconductor, or topological superconductor, is a special category of material that can create an entirely new state of matter – not a solid, liquid, or gas but a topological state. This is harnessed to produce a more stable qubit that is fast, small, and can be digitally controlled, without the tradeoffs required by current alternatives.\n\nA new paper published Wednesday in Nature outlines how Microsoft researchers were able to create the topological qubit’s exotic quantum properties and also accurately measure them, an essential step for practical computing.\n\nThis breakthrough required developing an entirely new materials stack made of indium arsenide and aluminum, much of which Microsoft designed and fabricated atom by atom. The goal was to coax new quantum particles called Majoranas into existence and take advantage of their unique properties to reach the next horizon of quantum computing, Microsoft said.\n\nThe world’s first Topological Core powering the Majorana 1 is reliable by design, incorporating error resistance at the hardware level, making it more stable.\n\nCommercially important applications will also require trillions of operations on a million qubits, which would be prohibitive with current approaches that rely on fine-tuned analog control of each qubit. The Microsoft team’s new measurement approach enables qubits to be controlled digitally, redefining and vastly simplifying how quantum computing works.\n\nThis progress validates Microsoft’s choice years ago to pursue a topological qubit design – a high-risk, high-reward scientific and engineering challenge that is now paying off. Today, the company has placed eight topological qubits on a chip designed to scale to one million.\n\n“From the start we wanted to make a quantum computer for commercial impact, not just thought leadership,” said Matthias Troyer, Microsoft technical fellow. “We knew we needed a new qubit. We knew we had to scale.”\n\nThat approach led the Defense Advanced Research Projects Agency (DARPA), a federal agency that invests in breakthrough technologies that are important to national security, to include Microsoft in a rigorous program to evaluate whether innovative quantum computing technologies could build commercially relevant quantum systems faster than conventionally believed possible.\n\nMicrosoft is now one of two companies invited to move to the final phase of DARPA’s Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program – one of the programs that makes up DARPA’s larger Quantum Benchmarking Initiative – which",
    "chunk_order_index": 0,
    "full_doc_id": "doc-8785533464130c49ae362dead2938036"
  },
  "chunk-d1cce02f73fe8b96713e07eb13052c0a": {
    "tokens": 1200,
    "content": "Projects Agency (DARPA), a federal agency that invests in breakthrough technologies that are important to national security, to include Microsoft in a rigorous program to evaluate whether innovative quantum computing technologies could build commercially relevant quantum systems faster than conventionally believed possible.\n\nMicrosoft is now one of two companies invited to move to the final phase of DARPA’s Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program – one of the programs that makes up DARPA’s larger Quantum Benchmarking Initiative – which aims to deliver the industry’s first utility-scale fault-tolerant quantum computer, or one whose computational value exceeds its costs.\n\n### ‘It Just Gives You the Answer’\n\nIn addition to making its own quantum hardware, Microsoft has partnered with Quantinuum and Atom Computing to reach scientific and engineering breakthroughs with today’s qubits, including the announcement last year of the industry’s first reliable quantum computer.\n\nThese types of machines offer important opportunities to develop quantum skills, build hybrid applications, and drive new discoveries, particularly as AI is combined with new quantum systems that will be powered by larger numbers of reliable qubits.\n\nToday, Azure Quantum offers a suite of integrated solutions allowing customers to leverage these leading AI, high-performance computing, and quantum platforms in Azure to advance scientific discovery.\n\nBut reaching the next horizon of quantum computing will require a quantum architecture that can provide a million qubits or more and reach trillions of fast and reliable operations. Today’s announcement puts that horizon within years, not decades, Microsoft said.\n\nBecause they can use quantum mechanics to mathematically map how nature behaves with incredible precision – from chemical reactions to molecular interactions and enzyme energies – million-qubit machines should be able to solve certain types of problems in chemistry, materials science, and other industries that are impossible for today’s classical computers to accurately calculate.\n\n- For instance, they could help solve the difficult chemistry question of why materials suffer corrosion or cracks. This could lead to self-healing materials that repair cracks in bridges or airplane parts, shattered phone screens, or scratched car doors.\n- Because there are so many types of plastics, it isn’t currently possible to find a one-size-fits-all catalyst that can break them down. Quantum computing could calculate the properties of such catalysts to break down pollutants into valuable byproducts or develop non-toxic alternatives in the first place.\n- Enzymes, a kind of biological catalyst, could be harnessed more effectively in healthcare and agriculture. This could lead to breakthroughs helping to eradicate global hunger: boosting soil fertility to increase yields or promoting sustainable growth of foods in harsh climates.\n\nMost of all, quantum computing will allow engineers, scientists, companies, and others to simply design things right the first time – which would be transformative for everything from healthcare to product development.\n\n“Any company that makes anything could just design it perfectly the first time out. It would just give you the answer,” Troyer said. “The quantum computer teaches the AI the language of nature so the AI can just tell you the recipe for what you want to make.”\n\n<!-- image -->\n\n## Resonance\n\n- LinkedIn\n\n## The Quantum Insider is the leading online resource dedicated exclusively to Quantum Computing. You can contact us at [email protected].\n\nShare this article:\n\n## Relevant\n\n### QDI’s Top-Of-The-Range Scientific Instruments Offer Reliable Hardware Solutions for the Global Quantum Market\n\n### Ooredoo Invests QR 2.8 Million in HBKU’s Qatar Centre For Quantum Computing\n\n### Companies Invest Total of $150 Million in Quantum Computing Research at US and Japanese Universities\n\n### New Method of Controlling Qubits Could Advance Quantum Computers\n\n### UK’s Newly Opened National Quantum Computing Centre Designed to Push The Boundaries of What is Possible With Quantum\n\n<!-- image -->\n\n## Recommended\n\n<!-- image -->\n\n### Quantum Machine Learning Is The Next Big Thing\n\n<!-- image -->\n\n### 12 Top Quantum Computing Universities in 2024\n\n<!-- image -->\n\n### Sifting through the Clouds: Polish Researchers Will Test the Utility of Quantum Algorithms for Satellite Imagery\n\n<!-- image -->\n\n<!-- image -->\n\nKeep track of everything going on in the Quantum Technology Market.\n\nIn one place.\n\n## Related Articles\n\n<!-- image -->\n\n<!-- image -->\n\n## Jij Inc. Expands to the UK and Joins UKQuantum to Strengthen Global Quantum Efforts\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Empa Opens CarboQuant Lab to Explore Quantum Properties of Carbon\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## NIST Outlines Strategies for Crypto Agility as PQC Migration Stalls, Available for Public Comment\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## China Launches $138 Billion Government-Backed Venture Fund, Includes Quantum Startups\n\n## Matt Swayne\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Improved Performance of Superconducting Qubits Makes Investigation of Sapphire Substrates Compelling as an Alternative to Silicon\n\n## Jakob P\n\n## December 14, 2023\n\n<!-- image -->\n\n<!-- image -->\n\n## Empa Opens CarboQuant Lab to Explore Quantum Properties of Carbon\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Quantum Industries Raises $10 Million in Successful Seed Funding Round\n\n## Matt Swayne\n\n## March 3, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Jij Inc. Expands to the UK and Joins UKQuantum to Strengthen Global Quantum Efforts\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Space-Based Quantum Key Distribution: A Deep Dive Into QKD’s Market Map And Competitive Landscape\n\n## Matt Swayne\n\n## March 5, 2025\n\n<!-- image -->\n\n<!-- image -->",
    "chunk_order_index": 1,
    "full_doc_id": "doc-8785533464130c49ae362dead2938036"
  },
  "chunk-74fd121a2a9e0b7c7e0b7a81a53721b8": {
    "tokens": 687,
    "content": "## March 3, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Jij Inc. Expands to the UK and Joins UKQuantum to Strengthen Global Quantum Efforts\n\n## Cierra Choucair\n\n## March 7, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n## Space-Based Quantum Key Distribution: A Deep Dive Into QKD’s Market Map And Competitive Landscape\n\n## Matt Swayne\n\n## March 5, 2025\n\n<!-- image -->\n\n<!-- image -->\n\n#### Featured News\n\n##### Jij Inc. Expands to the UK and Joins UKQuantum to Strengthen Global Quantum Efforts\n\n##### Empa Opens CarboQuant Lab to Explore Quantum Properties of Carbon\n\n##### NIST Outlines Strategies for Crypto Agility as PQC Migration Stalls, Available for Public Comment\n\n##### Jij Inc. Expands to the UK and Joins UKQuantum to Strengthen Global Quantum Efforts\n\n##### Empa Opens CarboQuant Lab to Explore Quantum Properties of Carbon\n\n##### NIST Outlines Strategies for Crypto Agility as PQC Migration Stalls, Available for Public Comment\n\n#### Navigate\n\n- News\n- Resources\n- Reports\n- Solutions\n\n- News\n- Resources\n- Reports\n- Solutions\n\n- News\n- Resources\n- Reports\n- Solutions\n\n- News\n- Resources\n- Reports\n- Solutions\n\n#### Projects\n\n- Resonance\n- Digital Twin Insider\n- Space Insider\n- AI Insider\n- Climate Insider\n\n#### Contact Us\n\n- Email Us\n\n#### Legal\n\n- Privacy Policy\n- Terms and Conditions\n- Editorial Policy\n\n- Necessary\n\nThese cookies are not optional. They are needed for the website to function.\n- Statistics\n\nIn order for us to improve the website's functionality and structure, based on how the website is used.\n- Experience\n\nIn order for our website to perform as well as possible during your visit. If you refuse these cookies, some functionality will disappear from the website.\n- Marketing\n\nBy sharing your interests and behavior as you visit our site, you increase the chance of seeing personalized content and offers.\n\nReach out to us with your questions, ideas,\n\nOne of our team will be in touch to learn more about your requirements, and provide pricing and access options.\n\n###### Welcome to our weekly QC newsletter. Yes, we know we are The Quantum Insider but we also appreciate that you probably don’t want us in your inbox every day. Here is what we have been working on this week.\n\nYou can unsubscribe anytime. For more details, review our Privacy Policy.\n\nSubscribe\n\nLoading…\n\n#### Thank you!\n\nYou have successfully joined our subscriber list.\n\n- News\n    - Quantum Computing Business\n    - National\n    - Capital Markets\n- Exclusives\n\n- Insights\n- Education\n- Interviews\n- Media\n- Intro to quantum\n- Advisory\n- About Us\n- Marketing\n- Q-munity\n\n- News\n    - Quantum Computing Business\n    - National\n    - Capital Markets\n- Exclusives\n\n- Insights\n- Education\n- Interviews\n- Media\n- Intro to quantum\n- Advisory\n- About Us\n- Marketing\n- Q-munity\n\n- Contact Us\n\nSubscribe to our industry leading leading newsletter for the latest in quantum news and insights.\n\n## Join Our Newsletter\n\nYou can unsubscribe anytime. For more details, review our Privacy Policy.\n\n#### Thank you!\n\nYou have successfully joined our subscriber list.",
    "chunk_order_index": 2,
    "full_doc_id": "doc-8785533464130c49ae362dead2938036"
  },
  "chunk-199e5ff316e5b7b0be48c3eb447ffb53": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n<!-- image -->\n\n- Artificial intelligence\n- Superconductor\n- Humanoid Robot\n- Science\n- About\n    - Contact\n    - About\n    - Privacy Policy\n    - Terms and Conditions\n\nHome » Artificial intelligence » Microsoft Majorana 1 Chip Has 8 Qubits Right Now with a Roadmap to 1 Million Raw Qubits\n\n<!-- image -->\n\n<!-- image -->\n\n# Microsoft Majorana 1 Chip Has 8 Qubits Right Now with a Roadmap to 1 Million Raw Qubits\n\nMicrosoft team behind the recent breakthrough in physics and quantum computing demonstrated by the new Majorana 1 chip, engineered from an entirely new material that has the potential to scale to millions of qubits on a single chip.\n\nMicrosoft today introduced Majorana 1, the world’s first quantum chip powered by a new Topological Core architecture that it expects will realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.\n\nQuEra, Quantinuum and Quantum Circuits are in the lead with error corrected or fast error detecting quantum systems. We are still 4-8 years away from major error corrected quantum systems that might make a big computing difference for some kinds of problems.\n\nMicrosoft leverages the world’s first topoconductor, a breakthrough type of material which can observe and control Majorana particles to produce more reliable and scalable qubits, which are the building blocks for quantum computers.\n\nThe Microsoft Majorana 1 chip currently has 8 qubits. These are topological qubits, which are designed to be more stable and less prone to errors compared to traditional qubits, thanks to their unique properties based on Majorana zero modes.\n\nMicrosoft has outlined an ambitious roadmap to scale up to 1 million qubits on a single chip. This significant jump from 8 qubits is made feasible by their new architecture, which leverages the inherent stability of topological qubits. The company believes this approach provides a clear path to fitting a million qubits onto a single chip, a claim supported by the enhanced error resistance of their qubit design.\n\nRegarding whether these 1 million qubits would be logical qubits or raw qubits:\n\nRaw qubits refer to the physical qubits on the chip.\n\n    Logical qubits are error-corrected qubits capable of reliable computations, typically requiring multiple raw qubits for error correction.\n\nMicrosoft’s roadmap appears to focus on scaling to 1 million raw qubits. The stability of their topological qubits—often likened to a knot in a rope that stays in place even when disturbed—suggests that these raw qubits have built-in error resistance at the hardware level. This could reduce the number of additional raw qubits needed for error correction. Microsoft’s approach simplifies quantum error correction through a measurement-based method using digital pulses, further supporting the idea that the 1 million figure refers to raw qubits with enhanced stability.\n\nHowever, for practical quantum computing, logical qubits are essential to ensure reliable and accurate computations. Even with 1 million raw qubits, Microsoft would still need to implement error correction to create a smaller number of logical qubits from these raw ones. The exact number of logical qubits achievable would depend on the efficiency of their error-correction techniques, which is not fully detailed in the available information.\n\nLogical Error Corrected Qubit Estimates – Error corrected Are More Important Than More Raw Qubits\n\nWhile exact numbers are still under investigation, research suggests that topological qubits could significantly reduce the ratio of raw qubits to logical qubits compared to traditional methods:\n\nTheoretical estimates: In ideal scenarios, with high-fidelity topological operations and strong topological protection, some studies propose that the ratio could be as low as 2 to 10 raw qubits per logical qubit.\n\nPractical expectations: Accounting for real-world imperfections, more conservative estimates suggest a ratio closer to 10 to 50 raw qubits per logical qubit. This is still a substantial improvement over traditional quantum error correction schemes, which often require 100–1,000 raw qubits per logical qubit, and possibly even dual-rail qubits, which might require about 20 raw qubits per logical qubit.\n\nBesides error correction there is how many operations can be performed. Like how many steps of an algorithm.\n\nWho is in the Lead?\n\nQuEra Computing\n\nQuEra, a pioneer in neutral atom technology, has achieved a notable milestone in collaboration with Harvard University. In December 2023, they demonstrated 48 logical qubits using 280 physical qubit, executing large-scale algorithms on an error-corrected quantum computer. This demonstration included high-fidelity operations, such as a two-qubit transversal CNOT gate with a fidelity of 0.9993, and a circuit error rate of 0.002 with eight logical qubits—11 times better than their physical qubit error rate of 0.023. QuEra’s roadmap aims for 100 logical qubits by 2026, but their current record stands at 48 logical qubits, making it a significant achievement in the field.\n\nQuantinuum\n\nQuantinuum, a leader in trapped ion technology, has made significant strides with its H-Series quantum computers. In collaboration with Microsoft, Quantinuum demonstrated 12 logical qubits using ion-trap hardware, achieving an impressive 800-fold reduction in error rates compared to physical qubits. This milestone highlights the high reliability of their logical qubits, making them suitable for fault-tolerant computations. Additionally, in December 2024, Quantinuum announced entangling 50 logical qubits in a specific experiment, creating a Greenberger-Horne-Zeilinger (GHZ) state. However, this appears to be a specialized benchmark rather than an indication of 50 fully operational logical qubits for general use. For practical computations, their demonstrated capacity remains at 12 logical qubits.\n\nQuantum Circuits",
    "chunk_order_index": 0,
    "full_doc_id": "doc-e8b8c2457662aec333d642b40186f6d0"
  },
  "chunk-b146f062e1b4b525119a8de49ad06131": {
    "tokens": 1200,
    "content": "reliability of their logical qubits, making them suitable for fault-tolerant computations. Additionally, in December 2024, Quantinuum announced entangling 50 logical qubits in a specific experiment, creating a Greenberger-Horne-Zeilinger (GHZ) state. However, this appears to be a specialized benchmark rather than an indication of 50 fully operational logical qubits for general use. For practical computations, their demonstrated capacity remains at 12 logical qubits.\n\nQuantum Circuits has error detecting qubits.\n\nThey use a superconducting system uses cylindrical chambers that confine a single microwave frequency photon. They use RF frequencies to control the movement and actions of the photon. A coupler connecting the two chambers is used to transfer the photon between the chambers. Currently, the chambers each have a diameter of 5 millimeters. They will shrink those down to microscopic size in later generations. Superconducting Dual Resonator Qubits enhance the fidelity of quantum applications with error detection and correction.\n\nThere are two superconducting resonators (aka cavities) connected by a so-called “coupler.”\n\nQuantum Circuits’ error-detecting dual-rail qubits innovation allows errors to be detected and corrected first to avoid disrupting performance at scale. This system will enable about 10-20 physical quantum qubits instead of 200 physical qubits for each error correct logical qubit.\n\nPsiQuantum\n\nPsiQuantum is developing a photonic quantum computer with an ambitious goal of reaching 1 million qubits. While this target is promising, their technology is still in the development phase, and they have not yet announced any operational quantum computers or demonstrated logical qubits. As a result, PsiQuantum currently has 0 logical qubits in terms of proven achievements.\n\nOther companies like IBM, Google, and IonQ have not yet reported logical qubit counts that rival QuEra or Quantinuum. This microsoft work is not talking about a logical error corrected qubit yet.\n\n2033 Goal for Utility Scale Quantum Computing\n\nDARPA has selected and is in negotiations with Microsoft and PsiQuantum for the Validation and Co-Design stage of the Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program, one of two programs that make up DARPA’s larger Quantum Benchmarking Initiative (QBI).\n\nDARPA’s Quantum Benchmarking Initiative (QBI) aims to determine whether it’s possible to build an industrially useful quantum computer much faster than conventional predictions. Specifically, QBI is designed to rigorously verify and validate whether any quantum computing approach can achieve utility-scale operation — meaning its computational value exceeds its cost — by the year 2033.\n\nNew Superconductor-Semiconductor for Majorana Chips\n\nIn the same way that the invention of semiconductors made today’s smartphones, computers and electronics possible, topoconductors and the new type of chip they enable offer a path to developing quantum systems that can scale to a million qubits and are capable of tackling the most complex industrial and societal problems, Microsoft said.\n\nThis new architecture used to develop the Majorana 1 processor offers a clear path to fit a million qubits on a single chip that can fit in the palm of one’s hand, Microsoft said. This is a needed threshold for quantum computers to deliver transformative, real-world solutions – such as breaking down microplastics into harmless byproducts or inventing self-healing materials for construction, manufacturing or healthcare. All the world’s current computers operating together can’t do what a one-million-qubit quantum computer will be able to do.\n\nMicrosoft’s topological qubit architecture has aluminum nanowires joined together to form an H. Each H has four controllable Majoranas and makes one qubit. These Hs can be connected, too, and laid out across the chip like so many tiles.\n\n“It’s complex in that we had to show a new state of matter to get there, but after that, it’s fairly simple. It tiles out. You have this much simpler architecture that promises a much faster path to scale,” said Krysta Svore, Microsoft technical fellow.\n\nChapters:\n\n0:00 – Introducing Majorana 1\n\n1:26 – Why does quantum computing matter?\n\n2:47 – Qubits, the building blocks of quantum computing\n\n5:05 – Understanding the topological state\n\n7:00 – How the Majorana 1 chip works\n\n9:10 – How quantum and classical computing work together\n\n10:13 – The Quantum Age\n\nThe topoconductor, or topological superconductor, is a special category of material that can create an entirely new state of matter – not a solid, liquid or gas but a topological state. This is harnessed to produce a more stable qubit that is fast, small and can be digitally controlled, without the tradeoffs required by current alternatives. A new paper published Wednesday in Nature outlines how Microsoft researchers were able to create the topological qubit’s exotic quantum properties and also accurately measure them, an essential step for practical computing.\n\nThis breakthrough required developing an entirely new materials stack made of indium arsenide and aluminum, much of which Microsoft designed and fabricated atom by atom. The goal was to coax new quantum particles called Majoranas into existence and take advantage of their unique properties to reach the next horizon of quantum computing, Microsoft said.\n\nThe world’s first Topological Core powering the Majorana 1 is reliable by design, incorporating error resistance at the hardware level making it more stable.\n\nCommercially important applications will also require trillions of operations on a million qubits, which would be prohibitive with current approaches that rely on fine-tuned analog control of each qubit. The Microsoft team’s new measurement approach enables qubits to be controlled digitally, redefining and vastly simplifying how quantum computing works.\n\nMicrosoft has partnered with Quantinuum and Atom Computing to reach scientific and engineering breakthroughs with today’s qubits, including the announcement last year of the industry’s first",
    "chunk_order_index": 1,
    "full_doc_id": "doc-e8b8c2457662aec333d642b40186f6d0"
  },
  "chunk-7f90e8dca3814c895ab860dc1c507aae": {
    "tokens": 1200,
    "content": "making it more stable.\n\nCommercially important applications will also require trillions of operations on a million qubits, which would be prohibitive with current approaches that rely on fine-tuned analog control of each qubit. The Microsoft team’s new measurement approach enables qubits to be controlled digitally, redefining and vastly simplifying how quantum computing works.\n\nMicrosoft has partnered with Quantinuum and Atom Computing to reach scientific and engineering breakthroughs with today’s qubits, including the announcement last year of the industry’s first reliable quantum computer.\n\nThe quantum chip doesn’t work alone. It exists in an ecosystem with control logic, a dilution refrigerator that keeps qubits at temperatures much colder than outer space and a software stack that can integrate with AI and classical computers. All those pieces exist, built or modified entirely in-house, she said.\n\nTo be clear, continuing to refine those processes and getting all the elements to work together at accelerated scale will require more years of engineering work. But many difficult scientific and engineering challenges have now been met, Microsoft said.\n\nGetting the materials stack right to produce a topological state of matter was one of the hardest parts, Svore added. Instead of silicon, Microsoft’s topoconductor is made of indium arsenide, a material currently used in such applications as infrared detectors and which has special properties. The semiconductor is married with superconductivity, thanks to extreme cold, to make a hybrid.\n\n“We are literally spraying atom by atom. Those materials have to line up perfectly. If there are too many defects in the material stack, it just kills your qubit,” Svore said.\n\nNature- Interferometric single-shot parity measurement in InAs–Al hybrid devices\n\nAbstract\n\nThe fusion of non-Abelian anyons is a fundamental operation in measurement-only topological quantum computation1. In one-dimensional topological superconductors (1DTSs) fusion amounts to a determination of the shared fermion parity of Majorana zero modes (MZMs). Here we introduce a device architecture5 that is compatible with future tests of fusion rules. We implement a single-shot interferometric measurement of fermion parity  in indium arsenide–aluminium heterostructures with a gate-defined superconducting nanowire. The interferometer is formed by tunnel-coupling the proximitized nanowire to quantum dots. The nanowire causes a state-dependent shift of the quantum capacitance of these quantum dots of up to 1 fF. Our quantum-capacitance measurements show flux h/2e-periodic bimodality with a signal-to-noise ratio (SNR) of 1 in 3.6 microseconds at optimal flux values. From the time traces of the quantum-capacitance measurements, they extract a dwell time in the two associated states that is longer than 1 ms at in-plane magnetic fields of approximately 2 T. They discuss the interpretation of their measurements in terms of both topologically trivial and non-trivial origins. The large capacitance shift and long poisoning time enable a parity measurement with an assignment error probability of 1%.\n\nThey have presented dispersive gate-sensing measurements of the quantum capacitance in InAs–Al hybrid devices using a system architecture that can be adapted to other materials platforms. After tuning the nanowire density and in-plane magnetic field into the parameter regime identified by the TGP14 and balancing the interferometer formed by the nanowire and the quantum dots, we observed a flux-dependent bimodal RTS in the quantum capacitance, which we interpret as switches of the parity of a fermionic state in the wire. They have fit these data to a model in which the fermion parity is associated with two MZMs localized at the opposite ends of a 1DTS and find good agreement. These measurements do not, by themselves, determine whether the low-energy states detected by interferometry are topological. However, our data tightly constrain the allowable energy splittings in models of trivial Andreev states.\n\nIn conclusion, their findings represent substantial progress towards the realization of a topological qubit based on measurement-only operations. Single-shot fermion parity measurements are a key requirement for a Majorana-based topological quantum computation architecture.\n\n<!-- image -->\n\n<!-- image -->\n\nBrian Wang is a Futurist Thought Leader and a popular Science blogger with 1 million readers per month. His blog Nextbigfuture.com is ranked #1 Science News Blog. It covers many disruptive technology and trends including Space, Robotics, Artificial Intelligence, Medicine, Anti-aging Biotechnology, and Nanotechnology.\n\nKnown for identifying cutting edge technologies, he is currently a Co-Founder of a startup and fundraiser for high potential early-stage companies. He is the Head of Research for Allocations for deep technology investments and an Angel Investor at Space Angels.\n\nA frequent speaker at corporations, he has been a TEDx speaker, a Singularity University speaker and guest at numerous interviews for radio and podcasts.  He is open to public speaking and advising engagements.\n\n## 8 thoughts on “Microsoft Majorana 1 Chip Has 8 Qubits Right Now with a Roadmap to 1 Million Raw Qubits”\n\n1. Robert C \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 22, 2025 at 2:50 pm\t\t\t\t\t\t\t\t\t\n \n\nI’m very impressed. Question: How do they connect/integrate it into our current technology?\nReply\n2. Robert C \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 22, 2025 at 2:28 pm\t\t\t\t\t\t\t\t\t\n \n\nThe “problem” I see with QM technology, is it’s ability to integrate with the technology we have today. Dealing with a 1and0 world, becomes much more “awkward” when “1and0” happen at the same time. Our current technology, can not deal with it. No matter how fast your “adding machine” is, it can’t deal with concepts it was never designed to “compute”. Both QM based computers, and biological informatics operate on principles",
    "chunk_order_index": 2,
    "full_doc_id": "doc-e8b8c2457662aec333d642b40186f6d0"
  },
  "chunk-a2c26e2eb489feebc6ae46cfa5b76fb7": {
    "tokens": 1173,
    "content": "The “problem” I see with QM technology, is it’s ability to integrate with the technology we have today. Dealing with a 1and0 world, becomes much more “awkward” when “1and0” happen at the same time. Our current technology, can not deal with it. No matter how fast your “adding machine” is, it can’t deal with concepts it was never designed to “compute”. Both QM based computers, and biological informatics operate on principles simple digital computers, do not. I don’t have an answer to this problem, but if may make an observation?\nArtificial prosthetics that involve electronics, have long had a “problem” connecting with the person there attached to. Our current technology, and biology just don’t work the same. Makes it very hard for our limited technology, to integrate with us. What I have read, is if an electrical system can “pause and absorb” data from human muscles for just a few milliseconds, it will better react to what human muscles actually do. Electrical systems operate must faster then we do. But we are much more adaptable and robust. We take our time, but only by a few milliseconds. It’s connecting the dots between technologies, that make’s it work.\nI think that’s one way to make quantum mechanic technology work for us. We need to connect the dots.\nReply\n3. Jim Takchess \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 22, 2025 at 6:17 am\t\t\t\t\t\t\t\t\t\n \n\nhttps://www.wsj.com/science/physics/microsoft-quantum-computing-physicists-skeptical-d3ec07f0?st=pemYah.    Wsj published this today\nReply\n4. dumpster4 \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 21, 2025 at 9:45 am\t\t\t\t\t\t\t\t\t\n \n\nBut can it borrow computing power from different universes?        🙂\n“Google Quantum AI founder Hartmut Neven wrote in his blog post that this chip was so mind-boggling fast that it must have borrowed computational power from other universes.\nErgo the chip’s performance indicates that parallel universes exist and “we live in a multiverse.””\nSource:\nhttps://techcrunch.com/2024/12/10/google-says-its-new-quantum-chip-indicates-that-multiple-universes-exist/\nReply\n5. Jim Takchess \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 21, 2025 at 7:01 am\t\t\t\t\t\t\t\t\t\n \n\nThanks Brian,\n\nRecenting I read Computing with Quantum Cats which was a good intro though dated book on QC. Does anyone have recommendations on a more recent popular book on QC ? Thanks\nReply\n6 Karl February 20, 2025 at 6:17 pm “in years, not decades” Shouldn’t the statement rather be closer to “minutes not millenia”Isn’t that the real essance of quantum compute ?I’m more interested in the multi thousand qbit impact on the AI learning process as it would speed that stage up to real time. Reply .children\n\n<!-- image -->\n\n<!-- image -->\n\n“in years, not decades” Shouldn’t the statement rather be closer to “minutes not millenia”\n\nIsn’t that the real essance of quantum compute ?\n\nI’m more interested in the multi thousand qbit impact on the AI learning process as it would speed that stage up to real time.\n\n    - Researcher February 20, 2025 at 6:44 pm “Microsoft today introduced … a new Topological Core architecture that it expects will realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.“ In that sentence, “years” refers to “realize”, not “solving”. They’re saying that they will be able to build a useful machine in years rather than decades. My guess would be that a machine capable of breaking useful cryptography might be on the order of 10 years away, which would count as years rather than decades. But there are still a number of surprises that might happen to delay that. Or accelerate it. I guess we’ll see. Reply .children\n\n<!-- image -->\n\n<!-- image -->\n\n“Microsoft today introduced … a new Topological Core architecture that it expects will realize quantum computers capable of solving meaningful, industrial-scale problems in years, not decades.“\n\nIn that sentence, “years” refers to “realize”, not “solving”.  They’re saying that they will be able to build a useful machine in years rather than decades.\n\nMy guess would be that a machine capable of breaking useful cryptography might be on the order of 10 years away, which would count as years rather than decades. But there are still a number of surprises that might happen to delay that. Or accelerate it. I guess we’ll see.\n\n        - Researcher \n\n \n\t\t\t\t\t\t\t\t\t\tFebruary 20, 2025 at 6:47 pm\t\t\t\t\t\t\t\t\t\n \n\nAlso, it isn’t obvious that a quantum computer could speed up AI at all. It wouldn’t be able to speed up the training of the current LLM architecture. There have been proposals for other kinds of AI that might benefit from a quantum computer. But no one knows whether those kinds of AI would be useful. The only way to know is to try it. Which can’t really be done until we have giant quantum computers.\nReply\n\n### Leave a Comment Cancel reply\n\nComment\n\n## Categories\n\n## Recent Posts\n\n- Sina Finance is Reporting Imminent Tesla China FSD Rollout\n- Poland Clone Robotics Make Liquid Muscled Synthetic Copy of the Human Body\n- Anthropic Releases Claude 3.7 Sonnet a Reasoning Model\n- Overcoming Constraints and Limits to Scaling AI\n- What Have Grandmasters Learned from Superintelligent Chess Programs?",
    "chunk_order_index": 3,
    "full_doc_id": "doc-e8b8c2457662aec333d642b40186f6d0"
  },
  "chunk-9b3d5090e4440cb490fe8fc8931a9709": {
    "tokens": 73,
    "content": "## Recent Posts\n\n- Sina Finance is Reporting Imminent Tesla China FSD Rollout\n- Poland Clone Robotics Make Liquid Muscled Synthetic Copy of the Human Body\n- Anthropic Releases Claude 3.7 Sonnet a Reasoning Model\n- Overcoming Constraints and Limits to Scaling AI\n- What Have Grandmasters Learned from Superintelligent Chess Programs?",
    "chunk_order_index": 4,
    "full_doc_id": "doc-e8b8c2457662aec333d642b40186f6d0"
  },
  "chunk-4ed2e83c26a694a37909d56f9cfa8335": {
    "tokens": 889,
    "content": "<!-- image -->\n\n- Home\n- Vision\n    - Quantum roadmap\n    - Quantum-safe overview\n    - Quantum for chemistry\n- Quantum Ready\n\n- Get started\n- Solutions\n\n- Solution Hub\n- Microsoft Quantum Hardware\n- Microsoft Quantum compute platform\n- Azure Quantum Elements\n- Qubit virtualization\n- Insights\n\n- Education\n- Industry Insights\n- Events\n- Blogs\n- Tools\n\n- Quantum coding\n- Microsoft Quantum katas\n- Learn chemistry with Microsoft Quantum\n- Resource Estimation and Cryptography\n- Microsoft Azure\n- More\n\n- All Microsoft\n    - Global\n\n## Global\n\n- Microsoft 365\n- Teams\n- Copilot\n- Windows\n- Surface\n- Xbox\n- Deals\n- Small Business\n- Support\n- Software Software\n\n- Windows Apps\n- AI\n- Outlook\n- OneDrive\n- Microsoft Teams\n- OneNote\n- Microsoft Edge\n- Skype\n- PCs &amp; Devices PCs &amp; Devices\n\n- Computers\n- Shop Xbox\n- Accessories\n- VR &amp; mixed reality\n- Certified Refurbished\n- Trade-in for cash\n- Entertainment Entertainment\n\n- Xbox Game Pass Ultimate\n- PC Game Pass\n- Xbox games\n- PC and Windows games\n- Movies &amp; TV\n- Business Business\n\n- Microsoft Cloud\n- Microsoft Security\n- Dynamics 365\n- Microsoft 365 for business\n- Microsoft Power Platform\n- Windows 365\n- Microsoft Industry\n- Small Business\n- Developer &amp; IT Developer &amp; IT\n\n- Azure\n- Microsoft Developer\n- Documentation\n- Microsoft Learn\n- Microsoft Tech Community\n- Azure Marketplace\n- AppSource\n- Visual Studio\n- Other Other\n\n- Microsoft Rewards\n- Free downloads &amp; security\n- Education\n- Gift cards\n- Licensing\n- Unlocked stories\n- View Sitemap\n\n# Majorana 1\nA new quantum chip\n\n.\n\n<!-- image -->\n\n### Announcing a breakthrough in quantum computing\n\n#### Scalable\n\nDesigned to enable useful quantum computing\n\n#### Stable\n\nResistant to errors at the hardware level\n\n#### Small\n\nMore than 1 million can fit on one chip\n\n#### Fast\n\nLess than 1 microsecond per operation\n\n#### Controllable\n\nVoltage pulses provide precise digital control\n\n# Simplicity drives scale\n\nOur quantum hardware pioneers measurement-only quantum computing—a fundamentally simpler way to control quantum information. This approach, validated in Nature, is built into our design and aims to enable reliable quantum systems at scale.\n\n<!-- image -->\n\n### 1 million qubits. 1 chip.\n\nPowered by a Topological Core, our processor is designed to scale to a million qubits—enough computing power to tackle humanity's toughest challenges in energy, medicine, and beyond.\n\n### Years, not decades\n\nOur revolutionary class of materials could accelerate the path to meaningful quantum computing.\n\n<!-- image -->\n\n#### Form meets function\n\nOur precisely engineered qubit is small, fast, and reliable—designed for useful quantum computation.\n\n<!-- image -->\n\n#### Reliably reading quantum information\n\nOur innovative measurement approach simplifies how we control and read quantum information, which could enable reliable operations at scale.\n\n<!-- image -->\n\n#### The world's first topoconductor\n\nA breakthrough class of materials at the heart of our qubits that harnesses revolutionary quantum physics.\n\n### Explore more quantum\n\n<!-- image -->\n\n#### Ensuring a quantum-safe future\n\nLearn how Microsoft’s Quantum-Safe program can help you prepare today for a quantum-safe future.\n\n<!-- image -->\n\n#### Learn quantum computing\n\nTry the quantum 'katas', self-paced online tutorials with an integrated AI assistant.\n\n<!-- image -->\n\n#### Education &amp; resources\n\nResources to help you learn today's foundational quantum systems and tomorrow's scaled quantum supercomputers.\n\n#### Stay up to date with all the latest news\n\n- Microsoft Quantum overview\n- Microsoft Quantum blog\n- Microsoft Quantum feedback\n- Terms of Use\n- Third Party Notices\n\n- Azure Quantum Elements Overview\n- News\n- Sign up\n\n- Github documentation\n- Technical blogs\n- Microsoft Tech Community\n\n- Getting started\n\n- About Microsoft\n- Company news\n- Privacy at Microsoft\n- Diversity and inclusion\n\n- Sitemap\n- Contact Microsoft\n- Privacy\n- Manage cookies\n- Terms of use\n- Trademarks\n- Safety &amp; eco\n- Recycling\n- About our ads\n- © Microsoft 2025",
    "chunk_order_index": 0,
    "full_doc_id": "doc-4ed2e83c26a694a37909d56f9cfa8335"
  },
  "chunk-aa8af155abafc8520f6e49467ad80e76": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Tech\n- Reviews\n- Science\n- Entertainment\n- AI\n- MoreExpand\n\n- Login / Sign Up\n\n- TechExpand\n    - All Tech\n    - Amazon\n    - Apple\n    - Facebook\n    - Google\n    - Microsoft\n    - Samsung\n    - Business\n    - Creators\n    - Mobile\n    - Policy\n    - Security\n    - Transportation\n- ReviewsExpand\n\n- All Reviews\n- Buying Guides\n- Deals\n- Gift Guide\n- Laptops\n- Phones\n- Headphones\n- Tablets\n- Smart Home\n- Smartwatches\n- Speakers\n- Drones\n- ScienceExpand\n\n- All Science\n- Space\n- Energy\n- Environment\n- Health\n- COVID-19\n- EntertainmentExpand\n\n- All Entertainment\n- Games\n- TV Shows\n- Movies\n- Audio\n- AI\n- CarsExpand\n\n- All Cars\n- Electric Cars\n- Autonomous Cars\n- Ride-Sharing\n- Scooters\n- Other Transportation\n- Features\n- VideosExpand\n\n- All Videos\n- YouTube\n- TikTok\n- Instagram\n- PodcastsExpand\n\n- All Podcasts\n- Decoder\n- The Vergecast\n- NewslettersExpand\n\n- All Newsletters\n- Command Line\n- Installer\n- Notepad\n- Verge Deals\n- Store\n\n- Facebook\n- Threads\n- Instagram\n- Youtube\n- RSS\n\n- News\n\n# Microsoft announces quantum computing breakthrough with new Majorana 1 chip\n\nMicrosoft has spent 17 years researching a new material and architecture for quantum computing.\n\nMicrosoft has spent 17 years researching a new material and architecture for quantum computing.\n\nby  Tom Warren\n\n- Link\n- Facebook\n- Threads\n\n<!-- image -->\n\nMicrosoft believes it has made a key breakthrough in quantum computing, unlocking the potential for quantum computers to solve industrial-scale problems. The software giant has spent 17 years working on a research project to create a new material and architecture for quantum computing, and it’s unveiling the Majorana 1 processor, Microsoft’s first quantum processor based on this new architecture.\n\nAt the core of a quantum computer are qubits, a unit of information in quantum computing much like the binary bits that computers use today. Companies like IBM, Microsoft, and Google have all been trying to make qubits as reliable as binary bits for years now because they’re a lot more delicate and sensitive to noise that can create errors or lead to loss of data.\n\nMajorana 1 can potentially fit a million qubits onto a single chip that’s not much bigger than the CPUs inside desktop PCs and servers. Microsoft isn’t using electrons for the compute in this new chip; it’s using the Majorana particle that theoretical physicist Ettore Majorana described in 1937. Microsoft has reached this milestone by creating what it calls the “world’s first topoconductor,” a new type of material that can not only observe but also control Majorana particles to create more reliable qubits.\n\n<!-- image -->\n\nMicrosoft has outlined its research in a peer-reviewed paper published today in Nature, explaining how its researchers were able to create the topological qubit. Microsoft has helped create a new material made from indium arsenide and aluminum, and it has placed eight topological qubits on a chip that it hopes can eventually scale to 1 million.\n\nA single chip with a million qubits could perform simulations that are a lot more accurate and help improve the understanding of the natural world and unlock breakthroughs in medicine and material science. That’s been the promise of quantum computing for years now, and Microsoft believes its topoconductor, or topological superconductor, is the next big breakthrough.\n\n“Our leadership has been working on this program for the last 17 years. It’s the longest-running research program in the company,” explains Zulfi Alam, corporate vice president of quantum at Microsoft. “After 17 years, we are showcasing results that are not just incredible, they’re real. They will fundamentally redefine how the next stage of the quantum journey takes place.”\n\nAlam previously worked on HoloLens and the fabrication techniques that have helped Microsoft in its push toward quantum computing. Microsoft’s quantum computing team is made up of researchers, scientists, and Microsoft technical fellows that have dedicated years to the company’s effort to build a scalable quantum computer based on topological qubits.\n\n<!-- image -->\n\n“We took a step back and said ‘Ok, let’s invent the transistor for the quantum age. What properties does it need to have?’” says Chetan Nayak, Microsoft technical fellow. “And that’s really how we got here — it’s the particular combination, the quality and the important details in our new materials stack that have enabled a new kind of qubit and ultimately our entire architecture.”\n\nThe Defense Advanced Research Projects Agency (DARPA) has now selected Microsoft as one of two companies that will advance to the final phase of its Underexplored Systems for Utility-Scale Quantum Computing (US2QC). Microsoft will now build a fault-tolerant prototype quantum computer based on topological qubits “in years, not decades.”\n\n“A million-qubit quantum computer isn’t just a milestone — it’s a gateway to solving some of the world’s most difficult problems,” says Nayak. “Our path to useful quantum computing is clear. The foundational technology is proven, and we believe our architecture is scalable. Our new agreement with DARPA shows a commitment to relentless progress toward our goal: building a machine that can drive scientific discovery and solve problems that matter.“\n\n- Microsoft\n- News\n- Tech\n\n## Most Popular\n\n1. I wore a one-horsepower exoskeleton to the world’s biggest tech show\n2. What went wrong with Skype?\n3. Google screwed up Pixel vibrations again\n4. Our first look at Apple’s sky blue MacBook AirVideo\n5. Apple delays upgraded Siri: it’s taking ‘longer",
    "chunk_order_index": 0,
    "full_doc_id": "doc-06a633f8f974d1ba4f2bb4249cbd5797"
  },
  "chunk-1f146bbd829656d34105068013080306": {
    "tokens": 313,
    "content": "commitment to relentless progress toward our goal: building a machine that can drive scientific discovery and solve problems that matter.“\n\n- Microsoft\n- News\n- Tech\n\n## Most Popular\n\n1. I wore a one-horsepower exoskeleton to the world’s biggest tech show\n2. What went wrong with Skype?\n3. Google screwed up Pixel vibrations again\n4. Our first look at Apple’s sky blue MacBook AirVideo\n5. Apple delays upgraded Siri: it’s taking ‘longer than we thought’\n\n## Installer\n\nA weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.\n\n<!-- image -->\n\n### This is the title for the native ad\n\n<!-- image -->\n\n## More in News\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n### This is the title for the native ad\n\n## Top Stories\n\n- Facebook\n- Threads\n- Instagram\n- Youtube\n- RSS\n\n- Contact\n- Tip Us\n- Community Guidelines\n- About\n- Ethics Statement\n- How We Rate and Review Products\n\n- Cookie Settings\n- Terms of Use\n- Privacy Notice\n- Cookie Policy\n- Licensing FAQ\n- Accessibility\n- Platform Status\n\n© 2025 Vox Media, LLC. All Rights Reserved",
    "chunk_order_index": 1,
    "full_doc_id": "doc-06a633f8f974d1ba4f2bb4249cbd5797"
  },
  "chunk-df5981ef8f7efc26a60462ccc7bb8dab": {
    "tokens": 1200,
    "content": "- \n- \n- \n- \n- \n\n<!-- image -->\n\n- Products                         \n\n\n                                                3D Printing                                                \n\n\n                                                5G/6G                                                           \n\n\n                                                AI                                                   \n\n\n                                                Boards/Backplanes                                                \n\n\n                                                Cables/Connecting                                                \n\n\n                                                Communications                                                \n\n\n                                                Component Management                                                \n\n\n                                                Cyber Security                                                \n\n\n                                                Design                                                 \n\n\n                                                Displays                                                \n\n\n                                                E-mech                                                \n\n\n                                                Enclosures                                                \n\n\n                                                FPGAs                                                \n\n\n                                                Frequency                                                \n\n\n                                                Internet of Things                                                \n\n \n                                                Memory                                                \n\n\n                                                Metaverse                                                \n\n\n                                                Micros                                                \n\n\n                                                Mixed Signal/Analog                                                \n\n\n                                                Optoelectronics                                                \n\n\n                                                Passives                                                \n\n\n                                                Power                                                \n\n\n                                                Quantum                                                \n\n\n                                                Renewables                                                \n\n\n                                                Sensors                                                \n\n\n                                                T &amp; M                                                \n\n\n                                                Tools                                                \n\n\n                                                VR/AR                                                \n\n\n                                                Wearables\n- Industries                         \n\n\n                                                Aerospace &amp; Defence                                                \n\n\n                                                Automotive                                                \n\n\n                                                Eco Innovation                                                \n\n\n                                                Industrial                                                \n\n\n                                                Lighting                                                \n\n \n                                                Medical                                                \n\n\n                                                Production                                                \n\n\n                                                Robotics                                                \n\n\n                                                Security                                                \n\n\n                                                Wireless\n- News &amp; Analysis                         \n\n\n                                                Analysis                                                \n\n\n                                                Appointments                                                \n\n\n                                                Awards                                                \n\n\n                                                Blog                                                 \n\n\n                                                Events                                                \n\n\n                                                Latest                                                \n\n \n                                                Podcasts                                                \n\n\n                                                STEM News                                                \n\n\n                                                Tech Videos                                                \n\n\n                                                Webinars                                                \n\n\n                                                Women in Tech\n- Industry Events\n- Resource Centres                         \n\n\n                                                TI Resource Centre                                                \n\n\n                                                        Welcome                                                        \n\n\n                                                        Product Catalogue                                                        \n\n\n                                                        Featured Products                                                        \n\n\n                                                        Reference Designs                                                        \n\n\n                                                        Application Notes                                                        \n\n\n                                                        Evaluation Kits                                                        \n\n\n                                                        Tech Videos  \n\n\n                                                        Development Tools  \n\n\n                                                        TI E2E™ Support Forums  \n\n \n                                                DigiKey Resource Centre                                                \n\n\n                                                        Welcome                                                        \n\n\n                                                        Product Catalogue                                                        \n\n\n                                                        Featured Products                                                        \n\n\n                                                        New Products  \n\n\n                                                        Press Releases  \n\n\n                                                        Articles  \n\n\n                                                        Product Training  \n\n\n                                                        Blog\n- ES Network                         \n\n\n                                                Engineering                                                \n\n\n                                                Student Circuit                                                \n\n\n                                                Electronics Datasheets                                                \n\n \n                                                ED Inventory                                                \n\n\n                                                IoT Insider\n\n# Majorana 1: Microsoft’s new quantum chip\n\nMicrosoft has unveiled Majorana 1, a quantum chip that promises a significant leap forward in the development of large-scale, fault-tolerant quantum computing. The company claims that this breakthrough could accelerate the arrival of practical quantum computers from decades to just a few years - a stark contrast to the words of NVIDIA's CEO earlier this year.\n\n### What is Majorana 1?\n\nMajorana 1 is Microsoft's first Quantum Processing Unit (QPU) powered by a topological core, an entirely new approach to quantum computing. The chip is built using a novel material known as a ‘topoconductor,’ which enables the creation of stable and scalable topological qubits. Unlike traditional quantum computing approaches that rely on highly fragile qubits, Microsoft's design is intended to be less prone to errors and more resistant to environmental noise.\n\nMicrosoft claims that Majorana 1 has the potential to scale up to one million qubits on a single chip, a milestone that would bring quantum computing significantly closer to commercial reality. This is a stark contrast to current quantum processors, which typically operate with fewer than 100 qubits and struggle with error correction.\n\nSatya Nadella, CEO of Microsoft, emphasised the significance of this development, stating: \"Majorana 1 represents a fundamental shift in quantum computing. With this breakthrough, we are not just making incremental progress; we are laying the groundwork for a future where quantum computing becomes a practical reality in the near term.\"\n\n### The magic behind Majorana 1\n\nAt the heart of the chip is a superconducting nanowire made from indium arsenide and aluminium. This material combination enables the formation of Majorana zero modes, a theoretical particle that was first proposed in the 1930s but has been notoriously difficult to demonstrate experimentally.\n\nMicrosoft's topoconductors allow the creation and manipulation of Majorana zero modes, forming the basis for topological qubits. These qubits are distinct from traditional superconducting qubits (such as those used by Google and IBM) because they are inherently protected from certain types of errors, making them more stable and reliable.\n\nUnlike standard quantum computing methods, which require thousands of physical qubits to create a single logical qubit, topological qubits naturally resist errors, reducing the overhead for quantum error correction. Microsoft has also developed a novel readout system that reportedly achieves 99% accuracy in qubit state detection.\n\nChetan Nayak, Corporate Vice President of Quantum Hardware at Microsoft, explained: \"Majorana 1 is built on nearly two decades of research and development. By leveraging topoconductors, we have developed a quantum chip that is not only scalable but also inherently robust against errors—an essential step toward building a fault-tolerant quantum computer.\"\n\n### How does it compare to its rivals at Google and IBM?\n\nMicrosoft’s announcement comes at a time when Google and IBM are also making significant advancements in quantum computing. In late 2024, Google unveiled its \"Willow\" quantum chip, which demonstrated quantum supremacy by solving complex calculations in minutes that would take classical supercomputers thousands of years. IBM, meanwhile, has projected that large-scale quantum computing will be commercially viable by 2033.\n\nMicrosoft, however, believes it can achieve fault-tolerant quantum computing much sooner, stating that its approach could bring quantum breakthroughs \"in years, not decades.\" If successful, this would place Microsoft ahead in the race to develop a scalable quantum computer.\n\n### Applications of Majorana 1\n\nMicrosoft envisions Majorana 1 unlocking solutions for some of the world's most challenging problems, including:\n\n- Drug discovery – Accelerating the identification of new medicines by simulating molecular interactions with unprecedented accuracy\n- AI optimisation – Enhancing artificial intelligence models by enabling massive parallel computation beyond classical limits\n- Climate science – Helping researchers find ways to break down microplastics in the ocean and develop",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9b2f9df57f4bc02062d9e547eaa48739"
  },
  "chunk-ad14e22685e9464aa457b28f34063654": {
    "tokens": 1200,
    "content": "this would place Microsoft ahead in the race to develop a scalable quantum computer.\n\n### Applications of Majorana 1\n\nMicrosoft envisions Majorana 1 unlocking solutions for some of the world's most challenging problems, including:\n\n- Drug discovery – Accelerating the identification of new medicines by simulating molecular interactions with unprecedented accuracy\n- AI optimisation – Enhancing artificial intelligence models by enabling massive parallel computation beyond classical limits\n- Climate science – Helping researchers find ways to break down microplastics in the ocean and develop self-healing materials for infrastructure\n- Financial modelling – Optimising complex economic simulations for risk assessment and market predictions\n\nPaul Stevenson, Professor of Physics at the University of Surrey, offered a cautious perspective, stating: \"While Majorana 1 is an exciting advancement, the path to scalable and practical quantum computing remains complex. Independent verification and further experimental validation will be critical to confirming Microsoft's claims.\"\n\n### Microsoft’s collaboration with DARPA and the road ahead\n\nMicrosoft has partnered with DARPA (Defense Advanced Research Projects Agency) as part of its \"Utility-Scale Quantum Computing\" initiative. The company has committed to building a fault-tolerant quantum prototype in the coming years, further solidifying its role as a leader in quantum research.\n\nAccording to Chetan Nayak, Microsoft’s Corporate Vice President of Quantum Hardware, the company has been working on this technology for nearly two decades. The research leading to Majorana 1 has been peer-reviewed and published in Nature, giving credibility to Microsoft’s claims.\n\nDARPA selected Microsoft and PsiQuantum to progress to the final phase of its Underexplored Systems for Utility-Scale Quantum Computing (US2QC) program. This initiative, part of DARPA's broader Quantum Benchmarking Initiative (QBI), aims to evaluate and validate innovative approaches to building utility-scale quantum computers.\n\nAs part of the US2QC program's Validation and Co-Design phase, Microsoft will work closely with DARPA's evaluation team to refine and validate their quantum computing design. This collaboration involves rigorous testing of components and hardware, as well as assessments of system-level performance capabilities of major prototypes. The goal is to demonstrate the feasibility of constructing a utility-scale quantum computer that can address real-world challenges.\n\n### Scepticisms &amp; final thoughts\n\nDespite the excitement surrounding Majorana 1, some experts remain cautious. Majorana zero modes have been a topic of scientific controversy, and Microsoft previously faced scrutiny when it retracted a 2018 paper claiming experimental evidence of these particles.\n\nWhile Microsoft's approach appears promising and its inclusion in Nature a good sign, independent verification of its claims will be critical. Some physicists argue that additional experimental validation is needed to confirm that Majorana 1 truly contains Majorana zero modes and is not producing false signals from other quasiparticles.\n\nMicrosoft’s Majorana 1 quantum chip is one of the most ambitious attempts yet to bridge the gap between theoretical quantum physics and practical quantum computing. If the company’s claims hold up to further scrutiny, this could be the beginning of a new era in computing – one where quantum processors solve problems far beyond the reach of classical machines.\n\nWith its roadmap leading to fault-tolerant, million-qubit quantum systems, Microsoft is staking its claim in the future of computing. Whether it can deliver on this vision remains to be seen, but one thing is certain: the quantum race is heating up, and Microsoft has just made a bold move to take the lead.\n\n<!-- image -->\n\n#### Product Spotlight\n\n###### R30-3002002\n\n#### Harwin\n\n<!-- image -->\n\n### 20.00mm M3 Metric M/F Threaded Hex Brass Spacer/Pillar\n\n### Hardware - ...\n\n| SKU:   | 952-1510-ND   |\n|--------|---------------|\n| Stock: | 8245          |\n| Cost:  | $0.76         |\n\n###### NRF54L15-QFAA-R\n\n#### Nordic Semiconductor\n\n<!-- image -->\n\nRF System on a Chip - SoC Ultra-low power Bluetooth Multiprotocol 5.4 SoC Sys...\n\n| SKU:   | 4823-NRF54L15-QFAA-RTR-ND   |\n|--------|-----------------------------|\n| Stock: | 0                           |\n| Cost:  | $2.39                       |\n\n###### STDRIVEG611Q\n\n#### STMicroelectronics\n\n<!-- image -->\n\nGate Drivers High voltage and high-speed half-bridge gate driver for GaN powe...\n\n| SKU:   | 497-STDRIVEG611Q-ND   |\n|--------|-----------------------|\n| Stock: | 300                   |\n| Cost:  | $2.63                 |\n\n###### TBF10SL-4PS-B\n\n#### ITT Interconnect Solutions\n\n<!-- image -->\n\nCircular Connector Standard 5/2 Female Sockets/Male Pins Panel Mount\n\n| SKU:   | 1003-TBF10SL-4PS-B-ND   |\n|--------|-------------------------|\n| Stock: | 50                      |\n| Cost:  | $44.29                  |\n\n###### CAA572C0G3A663J640LJ\n\n#### TDK Corporation\n\n<!-- image -->\n\nSpeciality Ceramic Capacitors Inline MEGA Cap,2220,C0G,1000V,66nF,+/-5%,6.4mm...\n\n| SKU:   | 445-CAA572C0G3A663J640LJDKR-ND   |\n|--------|----------------------------------|\n| Stock: | 1037                             |\n| Cost:  | $9.16                            |\n\n##### Tech Videos\n\n<!-- image -->\n\n#### Product Spotlight\n\n###### R30-3002002\n\n#### Harwin\n\n<!-- image -->\n\n### 20.00mm M3 Metric M/F Threaded Hex Brass Spacer/Pillar\n\n### Hardware - ...\n\n| SKU:   | 952-1510-ND   |\n|--------|---------------|\n| Stock: | 8245          |\n|",
    "chunk_order_index": 1,
    "full_doc_id": "doc-9b2f9df57f4bc02062d9e547eaa48739"
  },
  "chunk-a0c2eff2091cd01e291742580e2ae038": {
    "tokens": 897,
    "content": "--|\n| Stock: | 1037                             |\n| Cost:  | $9.16                            |\n\n##### Tech Videos\n\n<!-- image -->\n\n#### Product Spotlight\n\n###### R30-3002002\n\n#### Harwin\n\n<!-- image -->\n\n### 20.00mm M3 Metric M/F Threaded Hex Brass Spacer/Pillar\n\n### Hardware - ...\n\n| SKU:   | 952-1510-ND   |\n|--------|---------------|\n| Stock: | 8245          |\n| Cost:  | $0.76         |\n\n###### NRF54L15-QFAA-R\n\n#### Nordic Semiconductor\n\n<!-- image -->\n\nRF System on a Chip - SoC Ultra-low power Bluetooth Multiprotocol 5.4 SoC Sys...\n\n| SKU:   | 4823-NRF54L15-QFAA-RTR-ND   |\n|--------|-----------------------------|\n| Stock: | 0                           |\n| Cost:  | $2.39                       |\n\n###### STDRIVEG611Q\n\n#### STMicroelectronics\n\n<!-- image -->\n\nGate Drivers High voltage and high-speed half-bridge gate driver for GaN powe...\n\n| SKU:   | 497-STDRIVEG611Q-ND   |\n|--------|-----------------------|\n| Stock: | 300                   |\n| Cost:  | $2.63                 |\n\n###### TBF10SL-4PS-B\n\n#### ITT Interconnect Solutions\n\n<!-- image -->\n\nCircular Connector Standard 5/2 Female Sockets/Male Pins Panel Mount\n\n| SKU:   | 1003-TBF10SL-4PS-B-ND   |\n|--------|-------------------------|\n| Stock: | 50                      |\n| Cost:  | $44.29                  |\n\n###### CAA572C0G3A663J640LJ\n\n#### TDK Corporation\n\n<!-- image -->\n\nSpeciality Ceramic Capacitors Inline MEGA Cap,2220,C0G,1000V,66nF,+/-5%,6.4mm...\n\n| SKU:   | 445-CAA572C0G3A663J640LJDKR-ND   |\n|--------|----------------------------------|\n| Stock: | 1037                             |\n| Cost:  | $9.16                            |\n\n<!-- image -->\n\n#### Upcoming Events\n\n<!-- image -->\n\n## Further reading\n\nA selection of Quantum Tech articles for further reading\n\n<!-- image -->\n\n- \n- \n- \n- \n- \n- \n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n#### Products\n\n- 3D Printing\n- 5G/6G\n- AI\n- Boards/Backplanes\n- Cables/Connecting\n- Communications\n- Component Management\n- Cyber Security\n- Design\n- Displays\n- E-mech\n- Enclosures\n- FPGAs\n- Frequency\n- Internet of Things\n- Memory\n- Metaverse\n- Micros\n- Mixed Signal/Analog\n- Optoelectronics\n- Passives\n- Power\n- Quantum\n- Renewables\n- Sensors\n- T &amp; M\n- Tools\n- VR/AR\n- Wearables\n\n#### Industries\n\n- Aerospace &amp; Defence\n- Automotive\n- Eco Innovation\n- Industrial\n- Lighting\n- Medical\n- Production\n- Robotics\n- Security\n- Wireless\n\n#### News &amp; Analysis\n\n- Analysis\n- Appointments\n- Awards\n- Blog\n- Events\n- Latest\n- Podcasts\n- STEM News\n- Tech Videos\n- Webinars\n- Women in Tech\n\n#### TI Resource Centre\n\n- Welcome\n- Product Catalogue\n- Featured Products\n- Reference Designs\n- Application Notes\n- Evaluation Kits\n- Tech Videos\n- Development Tools\n- TI E2E™ Support Forums\n\n#### DigiKey Resource Centre\n\n- Welcome\n- Product Catalogue\n- Featured Products\n- New Products\n- Press Releases\n- Articles\n- Product Training\n- Blog\n\n#### Our Company\n\n- About Us\n- ES Tools\n- Media Kit Request\n- Our Publications &amp; Websites\n- Privacy Policy\n- Terms and Conditions\n- Newsletter Archive\n- Magazine Archive\n\n#### ES Network\n\n- Engineering\n- Student Circuit\n- Electronics Datasheets\n- ED Inventory\n- Company Directory\n\n- Cookie Policy\n- Privacy Policy\n- Terms and Conditions\n\n#### Login\n\n<!-- image -->\n\n#### Social Login",
    "chunk_order_index": 2,
    "full_doc_id": "doc-9b2f9df57f4bc02062d9e547eaa48739"
  },
  "chunk-dfc19e48d1da18b595c49bce1af9ad2d": {
    "tokens": 1200,
    "content": "<!-- image -->\n\n- Home\n- Product news Product news See all product updates See all product updates\n\n<!-- image -->\n\n<!-- image -->\n\n    - Android, Chrome &amp; Play\n\n<!-- image -->\n\n        - Android\n        - Chrome\n        - Chromebooks\n        - Google Play\n        - Wear OS\n        - See all\n- Platforms &amp; Devices\n\n<!-- image -->\n\n    - Fitbit\n    - Google Nest\n    - Pixel\n    - See all\n- Explore &amp; Get Answers\n\n<!-- image -->\n\n- Gemini\n- Maps\n- News\n- Search\n- Shopping\n- See all\n- Connect &amp; Communicate\n\n<!-- image -->\n\n- Classroom\n- Photos\n- Registry\n- Translate\n- In the Cloud\n\n<!-- image -->\n\n- Google Workspace\n- More on the Cloud Blog\n- Google Cloud\n- See all\n\n- Android, Chrome &amp; Play See all\n    - Android\n    - Chrome\n    - Chromebooks\n    - Google Play\n    - Wear OS\n- Platforms &amp; Devices See all\n\n- Fitbit\n- Google Nest\n- Pixel\n- Explore &amp; Get Answers See all\n\n- Gemini\n- Maps\n- News\n- Search\n- Shopping\n- Connect &amp; Communicate\n\n- Classroom\n- Photos\n- Registry\n- Translate\n- In the Cloud See all\n\n- Google Workspace\n- More on the Cloud Blog\n- Google Cloud\n- Company news Company news\n\n<!-- image -->\n\n<!-- image -->\n\n- Outreach &amp; initiatives\n\n<!-- image -->\n\n    - Arts &amp; Culture\n    - Education\n    - Entrepreneurs\n    - Public Policy\n    - Sustainability\n    - See all\n- Technology\n\n<!-- image -->\n\n- AI\n- Developers\n- Health\n- Google DeepMind\n- Google Labs\n- Safety and security\n- See all\n- Inside Google\n\n<!-- image -->\n\n- Data centers and infrastructure\n- Doodles\n- Googlers\n- Life at Google\n- See all\n- Around the globe\n\n<!-- image -->\n\n- Google in Asia\n- Google in Europe\n- Google in Latin America\n- See all\n- Authors\n\n<!-- image -->\n\n- Sundar Pichai, CEO\n- Ruth Porat, President &amp; Chief Investment Officer\n- Kent Walker, SVP\n- James Manyika, SVP\n- See all\n\n- Outreach &amp; initiatives See all\n    - Arts &amp; Culture\n    - Education\n    - Entrepreneurs\n    - Public Policy\n    - Sustainability\n- Technology See all\n\n- AI\n- Developers\n- Health\n- Google DeepMind\n- Google Labs\n- Safety and security\n- Inside Google See all\n\n- Data centers and infrastructure\n- Doodles\n- Googlers\n- Life at Google\n- Around the globe See all\n\n- Google in Asia\n- Google in Europe\n- Google in Latin America\n- Authors See all\n\n- Sundar Pichai, CEO\n- Ruth Porat, President &amp; Chief Investment Officer\n- Kent Walker, SVP\n- James Manyika, SVP\n- Feed\n\n<!-- image -->\n\n- Home\n- Product news Product news See all product updates\n\n<!-- image -->\n\n<!-- image -->\n\n    - Android, Chrome &amp; Play\n\n<!-- image -->\n\n        - Android\n        - Chrome\n        - Chromebooks\n        - Google Play\n        - Wear OS\n        - See all\n- Platforms &amp; Devices\n\n<!-- image -->\n\n    - Fitbit\n    - Google Nest\n    - Pixel\n    - See all\n- Explore &amp; Get Answers\n\n<!-- image -->\n\n- Gemini\n- Maps\n- News\n- Search\n- Shopping\n- See all\n- Connect &amp; Communicate\n\n<!-- image -->\n\n- Classroom\n- Photos\n- Registry\n- Translate\n- In the Cloud\n\n<!-- image -->\n\n- Google Workspace\n- More on the Cloud Blog\n- Google Cloud\n- See all\n- Company news Company news\n\n<!-- image -->\n\n<!-- image -->\n\n- Outreach &amp; initiatives\n\n<!-- image -->\n\n    - Arts &amp; Culture\n    - Education\n    - Entrepreneurs\n    - Public Policy\n    - Sustainability\n    - See all\n- Technology\n\n<!-- image -->\n\n- AI\n- Developers\n- Health\n- Google DeepMind\n- Google Labs\n- Safety and security\n- See all\n- Inside Google\n\n<!-- image -->\n\n- Data centers and infrastructure\n- Doodles\n- Googlers\n- Life at Google\n- See all\n- Around the globe\n\n<!-- image -->\n\n- Google in Asia\n- Google in Europe\n- Google in Latin America\n- See all\n- Authors\n\n<!-- image -->\n\n- Sundar Pichai, CEO\n- Ruth Porat, President &amp; Chief Investment Officer\n- Kent Walker, SVP\n- James Manyika, SVP\n- See all\n- Feed\n\n- Press corner\n- RSS feed\n\n1. \n2. Technology\n3. Research\n\n# Meet Willow, our state-of-the-art quantum chip\n\nDec 09, 2024\n\n[[read-time]] min read\n\nOur new chip demonstrates error correction and performance that paves the way to a useful, large-scale quantum computer\n\n## General summary\n\nGoogle has developed a new quantum chip called Willow, which significantly reduces errors as it scales up, a major breakthrough in quantum error correction. Willow also performed a computation in under five minutes that would take a supercomputer 10 septillion years, demonstrating its potential for solving complex problems beyond the reach of classical computers. This achievement marks a significant step towards building commercially relevant quantum computers that can revolutionize fields like medicine, energy, and AI.\n\n## Bullet points\n\nGoogle's new quantum chip, Willow, is a major step towards building a useful, large-scale quantum computer.\nWillow reduces errors exponentially as it scales up, achieving",
    "chunk_order_index": 0,
    "full_doc_id": "doc-38cc0e3d2428193ecac84aa412d16752"
  },
  "chunk-dd98de53c62e9f323481dcf74c07d397": {
    "tokens": 1200,
    "content": "error correction. Willow also performed a computation in under five minutes that would take a supercomputer 10 septillion years, demonstrating its potential for solving complex problems beyond the reach of classical computers. This achievement marks a significant step towards building commercially relevant quantum computers that can revolutionize fields like medicine, energy, and AI.\n\n## Bullet points\n\nGoogle's new quantum chip, Willow, is a major step towards building a useful, large-scale quantum computer.\nWillow reduces errors exponentially as it scales up, achieving a breakthrough in quantum error correction.\nWillow performed a benchmark computation in under five minutes that would take a supercomputer 10 septillion years.\nWillow's performance is a sign that useful, very large quantum computers can be built.\nGoogle is working on developing quantum algorithms that can solve real-world problems.\n\n#### Explore other styles:\n\n- General summary\n- Bullet points\n\nToday I’m delighted to announce Willow, our latest quantum chip. Willow has state-of-the-art performance across a number of metrics, enabling two major achievements.\n\n- The first is that Willow can reduce errors exponentially as we scale up using more qubits. This cracks a key challenge in quantum error correction that the field has pursued for almost 30 years.\n- Second, Willow performed a standard benchmark computation in under five minutes that would take one of today’s fastest supercomputers 10 septillion (that is, 1025) years — a number that vastly exceeds the age of the Universe.\n\nThe Willow chip is a major step on a journey that began over 10 years ago. When I founded Google Quantum AI in 2012, the vision was to build a useful, large-scale quantum computer that could harness quantum mechanics — the “operating system” of nature to the extent we know it today — to benefit society by advancing scientific discovery, developing helpful applications, and tackling some of society's greatest challenges. As part of Google Research, our team has charted a long-term roadmap, and Willow moves us significantly along that path towards commercially relevant applications.\n\n## Exponential quantum error correction — below threshold!\n\nErrors are one of the greatest challenges in quantum computing, since qubits, the units of computation in quantum computers, have a tendency to rapidly exchange information with their environment, making it difficult to protect the information needed to complete a computation. Typically the more qubits you use, the more errors will occur, and the system becomes classical.\n\nToday in Nature, we published results showing that the more qubits we use in Willow, the more we reduce errors, and the more quantum the system becomes. We tested ever-larger arrays of physical qubits, scaling up from a grid of 3x3 encoded qubits, to a grid of 5x5, to a grid of 7x7 — and each time, using our latest advances in quantum error correction, we were able to cut the error rate in half. In other words, we achieved an exponential reduction in the error rate. This historic accomplishment is known in the field as “below threshold” — being able to drive errors down while scaling up the number of qubits. You must demonstrate being below threshold to show real progress on error correction, and this has been an outstanding challenge since quantum error correction was introduced by Peter Shor in 1995.\n\nThere are other scientific “firsts” involved in this result as well. For example, it’s also one of the first compelling examples of real-time error correction on a superconducting quantum system — crucial for any useful computation, because if you can’t correct errors fast enough, they ruin your computation before it’s done. And it’s a \"beyond breakeven\" demonstration, where our arrays of qubits have longer lifetimes than the individual physical qubits do, an unfakable sign that error correction is improving the system overall.\n\nAs the first system below threshold, this is the most convincing prototype for a scalable logical qubit built to date. It’s a strong sign that useful, very large quantum computers can indeed be built. Willow brings us closer to running practical, commercially-relevant algorithms that can’t be replicated on conventional computers.\n\n## 10 septillion years on one of today’s fastest supercomputers\n\nAs a measure of Willow’s performance, we used the random circuit sampling (RCS) benchmark. Pioneered by our team and now widely used as a standard in the field, RCS is the classically hardest benchmark that can be done on a quantum computer today. You can think of this as an entry point for quantum computing — it checks whether a quantum computer is doing something that couldn’t be done on a classical computer. Any team building a quantum computer should check first if it can beat classical computers on RCS; otherwise there is strong reason for skepticism that it can tackle more complex quantum tasks. We’ve consistently used this benchmark to assess progress from one generation of chip to the next — we reported Sycamore results in October 2019 and again recently in October 2024.\n\nWillow’s performance on this benchmark is astonishing: It performed a computation in under five minutes that would take one of today’s fastest supercomputers 1025 or 10 septillion years. If you want to write it out, it’s 10,000,000,000,000,000,000,000,000 years. This mind-boggling number exceeds known timescales in physics and vastly exceeds the age of the universe. It lends credence to the notion that quantum computation occurs in many parallel universes, in line with the idea that we live in a multiverse, a prediction first made by David Deutsch.\n\nThese latest results for Willow, as shown in the plot below, are our best so far, but we’ll continue to make progress.\n\nComputational costs are heavily influenced by available memory. Our estimates therefore consider a range of scenarios, from an ideal situation with unlimited memory (▲) to a more practical, embarrassingly",
    "chunk_order_index": 1,
    "full_doc_id": "doc-38cc0e3d2428193ecac84aa412d16752"
  },
  "chunk-54fb39db5ce3443a4661e765705cdb56": {
    "tokens": 1200,
    "content": "credence to the notion that quantum computation occurs in many parallel universes, in line with the idea that we live in a multiverse, a prediction first made by David Deutsch.\n\nThese latest results for Willow, as shown in the plot below, are our best so far, but we’ll continue to make progress.\n\nComputational costs are heavily influenced by available memory. Our estimates therefore consider a range of scenarios, from an ideal situation with unlimited memory (▲) to a more practical, embarrassingly parallelizable implementation on GPUs (⬤).\n\n<!-- image -->\n\nOur assessment of how Willow outpaces one of the world’s most powerful classical supercomputers, Frontier, was based on conservative assumptions. For example, we assumed full access to secondary storage, i.e., hard drives, without any bandwidth overhead — a generous and unrealistic allowance for Frontier. Of course, as happened after we announced the first beyond-classical computation in 2019, we expect classical computers to keep improving on this benchmark, but the rapidly growing gap shows that quantum processors are peeling away at a double exponential rate and will continue to vastly outperform classical computers as we scale up.\n\n## State-of-the-art performance\n\nWillow was fabricated in our new, state-of-the-art fabrication facility in Santa Barbara — one of only a few facilities in the world built from the ground up for this purpose. System engineering is key when designing and fabricating quantum chips: All components of a chip, such as single and two-qubit gates, qubit reset, and readout, have to be simultaneously well engineered and integrated. If any component lags or if two components don't function well together, it drags down system performance. Therefore, maximizing system performance informs all aspects of our process, from chip architecture and fabrication to gate development and calibration. The achievements we report assess quantum computing systems holistically, not just one factor at a time.\n\nWe’re focusing on quality, not just quantity — because just producing larger numbers of qubits doesn’t help if they’re not high enough quality. With 105 qubits, Willow now has best-in-class performance across the two system benchmarks discussed above: quantum error correction and random circuit sampling. Such algorithmic benchmarks are the best way to measure overall chip performance. Other more specific performance metrics are also important; for example, our T1 times, which measure how long qubits can retain an excitation — the key quantum computational resource — are now approaching 100 µs (microseconds). This is an impressive ~5x improvement over our previous generation of chips. If you want to evaluate quantum hardware and compare across platforms, here is a table of key specifications:\n\nWillow’s performance across a number of metrics.\n\n<!-- image -->\n\n## What’s next with Willow and beyond\n\nThe next challenge for the field is to demonstrate a first \"useful, beyond-classical\" computation on today's quantum chips that is relevant to a real-world application. We’re optimistic that the Willow generation of chips can help us achieve this goal. So far, there have been two separate types of experiments. On the one hand, we’ve run the RCS benchmark, which measures performance against classical computers but has no known real-world applications. On the other hand, we’ve done scientifically interesting simulations of quantum systems, which have led to new scientific discoveries but are still within the reach of classical computers. Our goal is to do both at the same time — to step into the realm of algorithms that are beyond the reach of classical computers and that are useful for real-world, commercially relevant problems.\n\nRandom circuit sampling (RCS), while extremely challenging for classical computers, has yet to demonstrate practical commercial applications.\n\n<!-- image -->\n\nWe invite researchers, engineers, and developers to join us on this journey by checking out our open source software and educational resources, including our new course on Coursera, where developers can learn the essentials of quantum error correction and help us create algorithms that can solve the problems of the future.\n\n<!-- image -->\n\nMy colleagues sometimes ask me why I left the burgeoning field of AI to focus on quantum computing. My answer is that both will prove to be the most transformational technologies of our time, but advanced AI will significantly benefit from access to quantum computing. This is why I named our lab Quantum AI. Quantum algorithms have fundamental scaling laws on their side, as we’re seeing with RCS. There are similar scaling advantages for many foundational computational tasks that are essential for AI. So quantum computation will be indispensable for collecting training data that’s inaccessible to classical machines, training and optimizing certain learning architectures, and modeling systems where quantum effects are important. This includes helping us discover new medicines, designing more efficient batteries for electric cars, and accelerating progress in fusion and new energy alternatives. Many of these future game-changing applications won’t be feasible on classical computers; they’re waiting to be unlocked with quantum computing.\n\n- Research\n\n### Related stories\n\n- Health\nAdvancing healthcare and scientific discovery with AI\n\n                  By\n                  \n                    \n                    \n                    Yossi Matias\n                    \n\n Mar 04, 2025\n- AI\nThe latest AI news we announced in February\n\n                  By\n                  \n                    \n                    \n                    Keyword Team\n                    \n\n Mar 03, 2025\n- AI\nThe AI Action Summit: A golden age of innovation\n\n                  By\n                  \n                    \n                    \n                    Sundar Pichai\n                    \n\n Feb 10, 2025\n- AI\nThe latest AI news we announced in January\n\n                  By\n                  \n                    \n                    \n                    Keyword Team\n                    \n\n Feb 05, 2025\n- AI\n2024: A year of extraordinary progress and advancement in AI\n\n                  By\n                  \n                    \n                    \n                    Demis Hassabis\n                    \n                  \n                    \n                    &amp;\n                    \n                    \n                    James Manyika\n                    \n                  \n                    \n                    &amp;\n                    \n                    \n                    Jeff Dean\n                    \n\n Jan 23, 2025\n- AI\n60 of our biggest AI announcements in 2024\n\n                  By\n                  \n                    \n                    \n                    Keyword Team",
    "chunk_order_index": 2,
    "full_doc_id": "doc-38cc0e3d2428193ecac84aa412d16752"
  },
  "chunk-18079494aa2e256a5bae1da55d339575": {
    "tokens": 301,
    "content": "Keyword Team\n                    \n\n Feb 05, 2025\n- AI\n2024: A year of extraordinary progress and advancement in AI\n\n                  By\n                  \n                    \n                    \n                    Demis Hassabis\n                    \n                  \n                    \n                    &amp;\n                    \n                    \n                    James Manyika\n                    \n                  \n                    \n                    &amp;\n                    \n                    \n                    Jeff Dean\n                    \n\n Jan 23, 2025\n- AI\n60 of our biggest AI announcements in 2024\n\n                  By\n                  \n                    \n                    \n                    Keyword Team\n                    \n\n Dec 23, 2024\n- .\n\n<!-- image -->\n\nLet’s stay in touch. Get the latest news from Google in your inbox.\n\nFollow Us\n\n- \n- \n- \n- \n- \n\n- Privacy\n- Terms\n- About Google\n- Google Products\n- About the Keyword\n\n- Help\n- Bahasa Indonesia (Indonesia)\n      \n\n        Deutsch\n      \n\n        English\n      \n\n        English (Africa)\n      \n\n        English (Australia)\n      \n\n        English (Canada)\n      \n\n        English (India)\n      \n\n        English (MENA)\n      \n\n        Español (España)\n      \n\n        Español (Latinoamérica)\n      \n\n        Français (Canada)\n      \n\n        Français (France)\n      \n\n        Italiano\n      \n\n        Nederlands (Nederland)\n      \n\n        Polski\n      \n\n        Português (Brasil)\n      \n\n        Türkçe (Türkiye)\n      \n\n        Česko (Čeština)\n      \n\n        اللغة العربية (MENA)\n      \n\n        中文 (台灣)\n      \n\n        日本語 (日本)\n      \n\n        한국어",
    "chunk_order_index": 3,
    "full_doc_id": "doc-38cc0e3d2428193ecac84aa412d16752"
  },
  "chunk-db3163197a274d992858c10acda91bd5": {
    "tokens": 1200,
    "content": "- Main page\n- Contents\n- Current events\n- Random article\n- About Wikipedia\n- Contact us\n\n- Help\n- Learn to edit\n- Community portal\n- Recent changes\n- Upload file\n- Special pages\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n            - Donate\n            - Create account\n            - Log in\n            - Donate\n            - Create account\n            - Log in\n            - Contributions\n            - Talk\n\n## Contents\n\n            - (Top)\n            - 1 References\n\n# Willow processor\n\n    - فارسی\n    - Article\n    - Talk\n        - Read\n        - Edit\n        - View history\n        - Read\n        - Edit\n        - View history\n        - What links here\n        - Related changes\n        - Upload file\n        - Permanent link\n        - Page information\n        - Cite this page\n        - Get shortened URL\n        - Download QR code\n        - Download as PDF\n        - Printable version\n        - Wikidata item\n\n| Developer    | Google Quantum AI   |\n|--------------|---------------------|\n| Type         | Quantum processor   |\n| Release date | December 9, 2024    |\n| Predecessor  | Sycamore            |\n\nThe Willow processor is a 105-qubit superconducting quantum computing processor developed by Google Quantum AI and manufactured in Santa Barbara, California.[1] Willow is the first chip to achieve below threshold quantum error correction.[1][2]\n\nOn December 9, 2024, Google Quantum AI announced Willow in a Nature paper[2] and company blogpost,[1] and claiming two accomplishments: First, that Willow can reduce errors exponentially as the number of qubits is scaled, achieving below threshold quantum error correction.[1][2] Second, that Willow completed a  Random Circuit Sampling (RCS) benchmark task in 5 minutes that would take today's fastest supercomputers 10 septillion (1025) years.[3][4]\n\nWillow is constructed with a square grid of superconducting transmon physical qubits.[2] Improvements over past work were attributed to improved fabrication techniques, participation ratio engineering, and circuit parameter optimization.[2]\n\nWillow prompted optimism in accelerating applications in pharmaceuticals, material science, logistics, drug discovery, and energy grid allocation.[3] Popular media responses discussed its risk in breaking cryptographic systems,[3] but a Google spokesman said that they were still at least 10 years out from breaking RSA.[5][6] Hartmut Neven, founder and lead of Google Quantum AI, told the BBC that Willow would be used in practical applications,[4] and in the announcement blogpost expressed the belief that advanced AI will benefit from quantum computing.[1]\n\nWillow follows the release of Foxtail in 2017, Bristlecone in 2018, and Sycamore in 2019. Willow has twice as many qubits as Sycamore[3] and improves upon T1 coherence time from Sycamore's 20 microseconds to 100 microseconds.[1] Willow's 105 qubits have an average connectivity of 3.47.[1]\n\nHartmut Neven, founder of Google Quantum AI, prompted controversy[7][8] by claiming that the success of Willow \"lends credence to the notion that quantum computation occurs in many parallel universes, in line with the idea that we live in a multiverse, a prediction first made by David Deutsch.\"[1]\n\n## References\n\n        1. ^ a b c d e f g h Hartmut Neven (2024-12-09). \"Meet Willow, our state-of-the-art quantum chip\". Google. Retrieved 2025-01-12.\n        2. ^ a b c d e Acharya, Rajeev; Abanin, Dmitry A.; Aghababaie-Beni, Laleh; Aleiner, Igor; Andersen, Trond I.; Ansmann, Markus; Arute, Frank; Arya, Kunal; Asfaw, Abraham; Astrakhantsev, Nikita; Atalaya, Juan; Babbush, Ryan; Bacon, Dave; Ballard, Brian; Bardin, Joseph C. (2024-12-09). \"Quantum error correction below the surface code threshold\". Nature: 1–3. arXiv:2408.13687. doi:10.1038/s41586-024-08449-y. ISSN 1476-4687. PMID 39653125.\n        3. ^ a b c d Riani, Abdo. \"What Does Google's Willow Chip Mean For Startups In 2025\". Forbes. Retrieved 2025-01-12.\n        4. ^ a b \"Google unveils 'mind-boggling' quantum computing chip\". www.bbc.com. Retrieved 2025-01-12.\n        5. ^ Williams, Kevin (2024-12-22). \"What Google's quantum computing breakthrough Willow means for the future of bitcoin and other cryptos\". CNBC. Retrieved 2025-01-12.\n        6. ^ Hollister, Sean (2024-12-12). \"Google says its breakthrough quantum chip can't break modern cryptography\". The Verge. Retrieved 2025-01-12.\n        7. ^ Swayne, Matt (2024-12-16). \"Google's Quantum Chip Sparks Debate on Multiverse Theory\". The Quantum Insider. Retrieved 2025-01-12.\n        8. ^ Cost, Ben (2024-12-15). \"Google scientist believes quantum chip could prove multiverse's existence\". New York Post. Retrieved 2025-01-12.\n\n<!-- image -->\n\n        - Quantum computing\n        - Articles with short description\n        - Short description matches Wikidata",
    "chunk_order_index": 0,
    "full_doc_id": "doc-434976143d9ba951647593da2a9348a5"
  },
  "chunk-3727db17d6028677432328f30e9242b4": {
    "tokens": 232,
    "content": "Matt (2024-12-16). \"Google's Quantum Chip Sparks Debate on Multiverse Theory\". The Quantum Insider. Retrieved 2025-01-12.\n        8. ^ Cost, Ben (2024-12-15). \"Google scientist believes quantum chip could prove multiverse's existence\". New York Post. Retrieved 2025-01-12.\n\n<!-- image -->\n\n        - Quantum computing\n        - Articles with short description\n        - Short description matches Wikidata\n        - This page was last edited on 14 February 2025, at 01:18 (UTC).\n        - Text is available under the Creative Commons Attribution-ShareAlike 4.0 License;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n        - Privacy policy\n        - About Wikipedia\n        - Disclaimers\n        - Contact Wikipedia\n        - Code of Conduct\n        - Developers\n        - Statistics\n        - Cookie statement\n        - Mobile view\n        - \n        -",
    "chunk_order_index": 1,
    "full_doc_id": "doc-434976143d9ba951647593da2a9348a5"
  }
}